
<!DOCTYPE html>
<html lang="en">
    
<head>
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="generator" content="Star">
    <title>Archives - Star</title>
    <meta name="author" content="Star">
    
    
    
        <link rel="alternate" type="application/atom+xml" title="RSS" href="/atom.xml">
    
    <meta name="description" content="不要温和地走进那个良夜。@CMU">
<meta property="og:type" content="blog">
<meta property="og:title" content="Star">
<meta property="og:url" content="http://yoursite.com/archives/page/4/index.html">
<meta property="og:site_name" content="Star">
<meta property="og:description" content="不要温和地走进那个良夜。@CMU">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Star">
<meta name="twitter:description" content="不要温和地走进那个良夜。@CMU">
    
    
        
    
    
    
    
    
    <!--STYLES-->
    <link rel="stylesheet" href="/assets/css/style-yrst5vo1nxaxbp2g3v9na2wg1lixlpr3ghbjdvskeixmu79deycecx3rh4bt.min.css">
    <!--STYLES END--><!-- hexo-inject:begin --><!-- hexo-inject:end -->
    
    
</head>

    <body>
        <!-- hexo-inject:begin --><!-- hexo-inject:end --><div id="blog">
            <!-- Define author's picture -->


    

<header id="header" data-behavior="1">
    <i id="btn-open-sidebar" class="fa fa-lg fa-bars"></i>
    <div class="header-title">
        <a class="header-title-link" href="/ ">Star</a>
    </div>
    
        
            <a  class="header-right-picture "
                href="#about">
        
        
        </a>
    
</header>

            <!-- Define author's picture -->


<nav id="sidebar" data-behavior="1">
    <div class="sidebar-container">
        
        
            <ul class="sidebar-buttons">
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/ "
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-home"></i>
                        <span class="sidebar-button-desc">Home</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/all-categories"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-bookmark"></i>
                        <span class="sidebar-button-desc">Categories</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/all-tags"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-tags"></i>
                        <span class="sidebar-button-desc">Tags</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/all-archives"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-archive"></i>
                        <span class="sidebar-button-desc">Archives</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link open-algolia-search"
                             href="#search"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-search"></i>
                        <span class="sidebar-button-desc">Search</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="#about"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-question"></i>
                        <span class="sidebar-button-desc">About</span>
                    </a>
            </li>
            
        </ul>
        
            <ul class="sidebar-buttons">
            
        </ul>
        
            <ul class="sidebar-buttons">
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/atom.xml"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-rss"></i>
                        <span class="sidebar-button-desc">RSS</span>
                    </a>
            </li>
            
        </ul>
        
    </div>
</nav>

            
            <div id="main" data-behavior="1"
                 class="
                        hasCoverMetaIn
                        ">
                
    <section class="postShorten-group main-content-wrap">
    
    
    <article class="postShorten postShorten--thumbnailimg-bottom" itemscope itemType="http://schema.org/BlogPosting">
        <div class="postShorten-wrap">
            
            <div class="postShorten-header">
                <h1 class="postShorten-title" itemprop="headline">
                    
                        <a class="link-unstyled" href="/2016/07/21/2016-07-21/">
                            2016-07-21
                        </a>
                    
                </h1>
                <div class="postShorten-meta">
    <time itemprop="datePublished" datetime="2016-07-21T23:37:53-04:00">
	
		    Jul 21, 2016
    	
    </time>
    
        <span>in </span>
        
    <a class="category-link" href="/categories/真实的生命/">真实的生命</a>


    
</div>

            </div>
            
                <div class="postShorten-content" itemprop="articleBody">
                    <script src="/assets/js/DPlayer.min.js"> </script><p>&#x4E00;&#x3001;</p>
<pre><code>&#x6211;&#x6D3B;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5766;&#x7136;&#x7684;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;&#x5C31;&#x662F;&#xFF0C;&#x6211;&#x80FD;&#x52C7;&#x6562;&#x5730;&#x548C;&#x522B;&#x4EBA;&#x5B89;&#x5229;&#x81EA;&#x5DF1;&#x7684;&#x516C;&#x4F17;&#x53F7;&#x4E86;&#x3002;

&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x6587;&#x7AE0;&#x5E26;&#x7740;&#x60C5;&#x7EEA;&#x7684;&#x6210;&#x5206;&#x5F88;&#x591A;&#x3002;&#x800C;&#x6211;&#x7684;&#x4E60;&#x60EF;&#x662F;&#xFF0C;&#x5728;&#x73B0;&#x5B9E;&#x751F;&#x6D3B;&#x4E2D;&#x9762;&#x5BF9;&#x9762;&#x8BB2;&#x8BDD;&#x597D;&#x597D;&#x76F8;&#x5904;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x662F;&#x771F;&#x5B9E;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x865A;&#x65E0;&#x5730;&#x6BEB;&#x65E0;&#x57FA;&#x7840;&#x5730;&#x901A;&#x8FC7;&#x8868;&#x60C5;&#x548C;&#x6587;&#x5B57;&#x6765;&#x4F20;&#x8FBE;&#x5F7C;&#x6B64;&#x7684;&#x5FC3;&#x7406;&#x3002;&#x7F51;&#x7EDC;&#x66F4;&#x5E94;&#x8BE5;&#x662F;&#xFF0C;&#x8BA9;&#x4EB2;&#x5BC6;&#x5173;&#x7CFB;&#x66F4;&#x65B9;&#x4FBF;&#xFF0C;&#x4E0D;&#x8BE5;&#x662F;&#x8BA9;&#x964C;&#x751F;&#x7684;&#x4EBA;&#x53D8;&#x6210;&#x719F;&#x4EBA;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x3002;&#x5373;&#x4F7F;&#x6709;&#x53EF;&#x80FD;&#xFF0C;&#x4E5F;&#x662F;&#x8106;&#x5F31;&#x7684;&#xFF0C;&#x4E0D;&#x582A;&#x4E00;&#x51FB;&#x7684;&#x3002;

&#x540C;&#x65F6;&#xFF0C;&#x5728;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x91CC;&#xFF0C;&#x6211;&#x4E5F;&#x5F88;&#x4E0D;&#x613F;&#x8BA9;&#x522B;&#x4EBA;&#x5B8C;&#x5168;&#x770B;&#x900F;&#x6211;&#x7684;&#x5185;&#x5FC3;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x6050;&#x60E7;&#x548C;&#x4E0D;&#x77E5;&#x6240;&#x63AA;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x73B0;&#x5728;&#xFF0C;&#x6210;&#x719F;&#x5730;&#x770B;&#x6211;&#x4F9D;&#x65E7;&#x4E0D;&#x60F3;&#x8BA9;&#x522B;&#x4EBA;&#x5B8C;&#x5168;&#x770B;&#x900F;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x4E5F;&#x4E0D;&#x5FC5;&#x8981;&#x9690;&#x85CF;&#x81EA;&#x5DF1;&#x672C;&#x6765;&#x7684;&#x4E00;&#x9762;&#x3002;&#x6211;&#x786E;&#x5B9E;&#x60F3;&#x6CD5;&#x5F88;&#x591A;&#xFF0C;&#x5C0F;&#x5FC3;&#x601D;&#x5F88;&#x591A;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x8FD9;&#x4E0D;&#x4F1A;&#x8BA9;&#x4EBA;&#x56E0;&#x6B64;&#x800C;&#x653E;&#x5F03;&#x7231;&#x6211;&#x6216;&#x8005;&#x758F;&#x8FDC;&#x6211;&#xFF0C;&#x8FDC;&#x79BB;&#x6211;&#x3002;

&#x6587;&#x5B57;&#x8FD8;&#x662F;&#x8981;&#x5199;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x8981;&#x5199;&#x597D;&#xFF0C;&#x8981;&#x597D;&#x597D;&#x5199;&#xFF0C;&#x8981;&#x8BA4;&#x771F;&#x8E0F;&#x5B9E;&#x5730;&#xFF0C;&#x8A00;&#x4E4B;&#x6709;&#x7269;&#x5730;&#x5199;&#x3002;&#x751A;&#x81F3;&#x5199;&#x51FA;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x611F;&#x89C9;&#x6765;&#x3002;

&#x4E8C;&#x3001;

&#x6628;&#x5929;&#x89C1;&#x4E86;&#x5C0F;&#x5218;&#x6D77;&#xFF0C;&#x4E00;&#x4E2A;&#x9AD8;&#x9AD8;&#x7684;&#x59D1;&#x5A18;&#xFF0C;&#x505A;&#x82B1;&#x827A;&#xFF0C;&#x8BDD;&#x5520;&#xFF0C;&#x62C9;&#x62C9;&#xFF0C;&#x53EF;&#x7231;&#x3002;&#x6211;&#x4E0D;&#x662F;&#x8D34;&#x6807;&#x7B7E;&#x54E6;&#xFF0C;&#x5F53;&#x6211;&#x65E0;&#x6CD5;&#x5B8C;&#x6574;&#x5730;&#x5199;&#x51FA;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x8BB0;&#x5F55;&#x4E00;&#x4E9B;&#x7279;&#x5F81;&#x3002;&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5C31;&#x50CF;&#x6D77;&#x7EF5;&#x5438;&#x6C34;&#x4E00;&#x6837;&#xFF0C;&#x8FEB;&#x4E0D;&#x53CA;&#x5F85;&#x5730;&#x89C1;&#x8BC6;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x8BA9;&#x5404;&#x79CD;&#x4E16;&#x754C;&#x89C2;&#x51B2;&#x51FB;&#x6211;&#xFF0C;&#x8FEB;&#x4E0D;&#x53CA;&#x5F85;&#x62D3;&#x5C55;&#x81EA;&#x5DF1;&#x5BF9;&#x4E16;&#x754C;&#x8BA4;&#x77E5;&#x7684;&#x8FB9;&#x754C;&#x3002;

&#x540E;&#x6765;&#xFF0C;&#x6211;&#x6162;&#x6162;&#x953B;&#x70BC;&#x5230;&#x80FD;&#x591F;&#x81EA;&#x5DF1;&#x719F;&#x7EC3;&#x9009;&#x62E9;&#x60F3;&#x8981;&#x4EA4;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x60F3;&#x8981;&#x9760;&#x8FD1;&#x7684;&#x4EBA;&#xFF0C;&#x60F3;&#x8981;&#x8C08;&#x8BDD;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x65F6;&#x95F4;&#x6210;&#x672C;&#x5728;&#x4E00;&#x65B9;&#x9762;&#x7684;&#x51CF;&#x5C11;&#x610F;&#x5473;&#x7740;&#x6295;&#x5165;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#xFF0C;&#x5927;&#x6982;&#x66FE;&#x7ECF;&#x7684;&#x6211;&#x786E;&#x5B9E;&#x7A7A;&#x865A;&#x5427;&#x3002;

&#x5C0F;&#x5218;&#x6D77;&#x7ED9;&#x6211;&#x4E86;&#x4E00;&#x53EA;&#x82B1;&#xFF0C;&#x6211;&#x517B;&#x5728;&#x4E86;&#x6C34;&#x676F;&#x91CC;&#xFF0C;&#x53EF;&#x60DC;&#x4ECA;&#x5929;&#x56DE;&#x6765;&#x7684;&#x65F6;&#x5019;&#x5DF2;&#x7ECF;&#x6709;&#x70B9;&#x67AF;&#x840E;&#x4E86;&#x3002;&#x53EF;&#x4EE5;&#x505A;&#x6210;&#x5E72;&#x82B1;&#x3002;

&#x4E09;&#x3001;

&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#x53D8;&#x6210;&#x6D41;&#x6C34;&#x8D26;&#x535A;&#x5BA2;&#x3002;&#x6211;&#x5C31;&#x505C;&#x7B14;&#xFF0C;&#x4E0D;&#x5199;&#x4E86;&#x3002;

&#x4ECA;&#x5929;&#x7684;BGM&#x662F;&#x738B;&#x83F2;&#x300A;&#x77DC;&#x6301;&#x300B;&#x3002;Nighty
</code></pre>

                    
                        
                    
                    
                        <p>
                            <a href="/2016/07/21/2016-07-21/#post-footer" class="postShorten-excerpt_link link">
                                Comment and share
                            </a>
                        </p>
                    
                </div>
            
        </div>
        
    </article>
    
    
    <article class="postShorten postShorten--thumbnailimg-bottom" itemscope itemType="http://schema.org/BlogPosting">
        <div class="postShorten-wrap">
            
            <div class="postShorten-header">
                <h1 class="postShorten-title" itemprop="headline">
                    
                        <a class="link-unstyled" href="/2016/07/21/e5-bc-80-e7-af-87-ef-bc-9a-e6-89-93-e7-a2-8e-e6-b5-85-e8-96-84-e5-92-8c-e7-9f-ab-e6-83-85/">
                            开篇：打碎浅薄和矫情
                        </a>
                    
                </h1>
                <div class="postShorten-meta">
    <time itemprop="datePublished" datetime="2016-07-21T00:48:05-04:00">
	
		    Jul 21, 2016
    	
    </time>
    
        <span>in </span>
        
    <a class="category-link" href="/categories/真实的生命/">真实的生命</a>


    
</div>

            </div>
            
                <div class="postShorten-content" itemprop="articleBody">
                    <script src="/assets/js/DPlayer.min.js"> </script><p>&#x6240;&#x8C13;&#x5F00;&#x7BC7;&#xFF0C;&#x662F;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#x7684;&#x5F00;&#x7BC7;&#x3002;</p>
<p>&#x6211;&#x5199;&#x5B57;&#x7684;&#x5386;&#x53F2;&#x5F88;&#x957F;&#xFF0C;&#x6362;&#x4E86;&#x5F88;&#x591A;&#x5E73;&#x53F0;&#x3002;&#x5148;&#x884C;&#x603B;&#x7ED3;&#xFF0C;&#x5B57;&#x6570;&#x4E0D;&#x7B97;&#x60CA;&#x4EBA;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x7B97;&#x5C11;&#x4E86;&#x3002;</p>
<p>&#x5927;&#x81F4;&#x5982;&#x4E0B;&#xFF1A;</p>
<hr>
<p>2006- 2013&#x5E74;&#xFF1A; <a href="http://user.qzone.qq.com/576070839/main" target="_blank" rel="external">QQ&#x7A7A;&#x95F4;</a>&#xFF0C;107&#x7BC7;&#x65E5;&#x5FD7;&#xFF0C;&#x5176;&#x4E2D;100&#x7BC7;&#x5DE6;&#x53F3;&#x662F;&#x539F;&#x521B;&#xFF0C;&#x5E73;&#x5747;&#x6BCF;&#x7BC7;&#x5B57;&#x6570;&#x8FBE;&#x5230;1000&#x5B57;&#x3002;</p>
<p>2013- &#x81F3;&#x4ECA;&#xFF1A;&#x7B80;&#x4E66;&#xFF0C;58&#x7BC7;&#x6587;&#x7AE0;&#xFF08;&#x542B;&#x516C;&#x5F00;&#x548C;&#x4E0D;&#x516C;&#x5F00;&#xFF09;&#xFF0C;&#x5171;&#x8BA1;43898&#x5B57;&#x3002;</p>
<p>&#x516C;&#x4F17;&#x53F7;&#xFF1A;&#x770B;&#x4E0D;&#x89C1;&#x7684;&#x57CE;&#x5E02;&#xFF08;&#x5FAE;&#x4FE1;&#x641C;&#x7D22;&#x516C;&#x4F17;&#x53F7;&#xFF1A;alohomoracity&#xFF09;&#x4E5F;&#x5728;&#x4E0D;&#x65AD;&#x66F4;&#x65B0;&#x539F;&#x521B;&#x957F;&#x6587;+&#x77ED;&#x6587;&#x4E2D;&#x3002;</p>
<hr>
<p>&#x53EF;&#x60DC;&#xFF0C;&#x8BA4;&#x771F;&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x4E9B;&#x5730;&#x65B9;&#x8BB0;&#x5F55;&#x7684;&#x66F4;&#x591A;&#x662F;&#x7EC6;&#x5C0F;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x4E2A;&#x4EBA;&#x60C5;&#x611F;&#x503E;&#x5411;&#x5F88;&#x91CD;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#xFF0C;&#x5728;&#x8BB0;&#x5F55;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x5BF9;&#x4E8B;&#x7269;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x60C5;&#x7EEA;&#x5316;&#xFF0C;&#x5728;&#x4E0D;&#x65AD;&#x5F3A;&#x5316;&#x81EA;&#x5DF1;&#x7684;&#x611F;&#x53D7;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x6709;&#x68B3;&#x7406;&#x5E73;&#x9759;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x4F46;&#x4E5F;&#x786E;&#x5B9E;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x4F1A;&#x9020;&#x6210;&#x6211;&#x60C5;&#x611F;&#x5BFC;&#x5411;&#x7684;&#x6027;&#x683C;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x4ECE;&#x7B80;&#x4E66;&#x540E;&#x6BB5;&#x7684;&#x8BB0;&#x5F55;&#x4E2D;&#x5C24;&#x5176;&#x660E;&#x663E;&#x3002;&#x5728;Adelaide&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E16;&#x754C;&#x5F88;&#x5C0F;&#xFF0C;&#x53C8;&#x521A;&#x4ECE;&#x4E00;&#x4E2A;&#x60C5;&#x6DF1;&#x4E49;&#x91CD;&#x7684;Team&#x4E2D;&#x8131;&#x79BB;&#x51FA;&#x6765;&#xFF0C;&#x603B;&#x6CA1;&#x6CD5;&#x628A;&#x81EA;&#x8D1F;&#x3001;&#x77EB;&#x60C5;&#x5BA2;&#x89C2;&#x770B;&#x5F85;&#xFF0C;&#x52A0;&#x4E0A;Projects&#x591A;&#xFF0C;&#x4E0E;&#x8EAB;&#x8FB9;&#x7684;&#x4EBA;&#x76F8;&#x5904;&#x5173;&#x7CFB;&#x7B80;&#x5355;&#x53C8;&#x590D;&#x6742;&#xFF0C;&#x6613;&#x6012;&#x6613;&#x5D29;&#x6E83;&#xFF0C;&#x4E5F;&#x6613;&#x559C;&#x6613;&#x6EE1;&#x8DB3;&#x3002;</p>
<p>&#x4F46;&#x7531;&#x8877;&#x5730;&#xFF0C;&#x611F;&#x8C22;&#x7ECF;&#x5386;&#x8FC7;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x6BCF;&#x6B21;&#x60C5;&#x7EEA;&#x7684;&#x6765;&#x4E34;&#x6216;&#x79BB;&#x5F00;&#xFF0C;&#x90FD;&#x8BA9;&#x6211;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x591A;&#x4E86;&#x89E3;&#x4E00;&#x5206;&#x3002;</p>
<p>&#x51B7;&#x9759;&#x4E0E;&#x51B7;&#x6F20;&#x672C;&#x5C31;&#x4E0D;&#x662F;&#x6211;&#x7684;&#x4F5C;&#x98CE;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x6CE2;&#x6F9C;&#x4E0D;&#x60CA;&#x4E86;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x53EF;&#x6162;&#x6162;&#x5730;&#xFF0C;&#x5728;&#x4E0E;&#x6570;&#x636E;&#x3001;&#x4EE3;&#x7801;&#x6253;&#x4EA4;&#x9053;&#x7684;&#x65F6;&#x5149;&#x91CC;&#xFF0C;&#x5728;&#x548C;&#x7A0B;&#x5E8F;&#x5458;&#x8D8A;&#x8D70;&#x8D8A;&#x8FD1;&#xFF0C;&#x8D8A;&#x804A;&#x8D8A;&#x591A;&#x7684;&#x65F6;&#x5149;&#x91CC;&#xFF0C;&#x5728;&#x65E0;&#x6CD5;&#x4ECE;IT&#x8FD9;&#x4E2A;&#x4E00;&#x9897;&#x8D5B;&#x7279;&#x7684;&#x884C;&#x4E1A;&#x91CC;&#x8131;&#x79BB;&#x51FA;&#x6765;&#x7684;&#x65F6;&#x5149;&#x91CC;&#xFF0C;&#x60F3;&#x8981;&#x628A;&#x81EA;&#x5DF1;&#x5851;&#x9020;&#x6210;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x80FD;&#x529B;&#x5353;&#x8D8A;&#xFF0C;&#x601D;&#x7EF4;&#x654F;&#x6377;&#xFF0C;&#x5224;&#x65AD;&#x529B;&#x4E00;&#x6D41;&#x7684;&#x59D1;&#x5A18;&#x3002;&#x4E0D;&#xFF0C;&#x6211;&#x662F;&#x8BF4;&#x4EBA;&#x3002;</p>
<p>&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x7684;&#x601D;&#x7EF4;&#x91CC;&#x5E26;&#x7740;&#x6027;&#x522B;&#x7684;&#x89C2;&#x5FF5;&#xFF0C;&#x7ED9;&#x4E86;&#x81EA;&#x5DF1;&#x9000;&#x8DEF;&#x548C;&#x501F;&#x53E3;&#xFF0C;&#x540E;&#x6765;&#x53D1;&#x73B0;&#x8FD9;&#x624D;&#x662F;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x3002;&#x7537;&#x751F;&#x548C;&#x5973;&#x751F;&#x5728;&#x751F;&#x7406;&#x4E0A;&#x6784;&#x9020;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x786E;&#x5B9E;&#x4F1A;&#x5BFC;&#x81F4;&#x5148;&#x5929;&#x4F18;&#x52BF;&#x548C;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x4E25;&#x683C;&#x8BF4;&#x6765;&#xFF0C;&#x5728;&#x6CA1;&#x5230;&#x62FC;&#x5929;&#x8D4B;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x8FD9;&#x70B9;&#x5DEE;&#x5F02;&#x5E76;&#x4E0D;&#x80FD;&#x4F5C;&#x4E3A;&#x6211;&#x4EFB;&#x4F55;&#x5931;&#x8D25;&#x6216;&#x8005;&#x4E0D;&#x601D;&#x8FDB;&#x53D6;&#x7684;&#x501F;&#x53E3;&#x3002;&#x4E00;&#x70B9;&#x70B9;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x4E00;&#x4E2A;&#x5982;&#x6211;&#x822C;&#x9A84;&#x50B2;&#x7684;&#x4EBA;&#xFF0C;&#x81EA;&#x8BE9;&#x5C31;&#x662F;&#x8981;&#x517C;&#x987E;&#x903B;&#x8F91;&#x548C;&#x611F;&#x60C5;&#x7684;&#x3002;&#x4E00;&#x6837;&#x4E5F;&#x4E0D;&#x53EF;&#x4EE5;&#x653E;&#xFF0C;&#x4E00;&#x6837;&#x4E5F;&#x4E0D;&#x53EF;&#x4EE5;&#x8F93;&#x3002;</p>
<p>&#x611F;&#x8C22;Leon&#x7ED9;&#x6211;&#x5F04;&#x4E86;&#x8FD9;&#x4E2A;Wordpress&#xFF0C;&#x4E70;&#x4E86;&#x57DF;&#x540D;&#xFF0C;&#x4E4B;&#x540E;&#x6709;&#x673A;&#x4F1A;&#x60F3;&#x81EA;&#x5DF1;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;Hexo&#x3002;&#x4E4B;&#x524D;&#x6211;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x73CD;&#x60DC;&#xFF0C;&#x6CA1;&#x6709;&#x7528;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x591C;&#x6DF1;&#x4EBA;&#x9759;&#x7684;&#x665A;&#x4E0A;&#xFF0C;&#x5728;&#x6211;&#x5BB3;&#x6015;&#x4EBA;&#x751F;&#x505C;&#x6EDE;&#x4E0D;&#x524D;&#x7684;&#x665A;&#x4E0A;&#xFF0C;&#x6211;&#x8FD8;&#x4FDD;&#x7559;&#x7740;&#x76F2;&#x76EE;&#x7684;&#x4FE1;&#x5FC3;&#xFF0C;&#x671F;&#x5F85;&#x7740;&#x6211;&#x80FD;&#x5728;&#x8FD9;&#x91CC;&#x66F4;&#x597D;&#x5730;&#x8BB0;&#x5F55;&#xFF0C;&#x770B;&#x770B;&#x662F;&#x4E0D;&#x662F;&#x771F;&#x7684;&#x80FD;&#x201C;&#x6253;&#x7834;&#x6D45;&#x8584;&#x548C;&#x77EB;&#x60C5;&#x201D;&#xFF0C;&#x5982;&#x6211;&#x60F3;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x6210;&#x4E3A;&#x60F3;&#x8981;&#x6210;&#x4E3A;&#x7684;&#x4EBA;&#x3002;</p>

                    
                        
                    
                    
                        <p>
                            <a href="/2016/07/21/e5-bc-80-e7-af-87-ef-bc-9a-e6-89-93-e7-a2-8e-e6-b5-85-e8-96-84-e5-92-8c-e7-9f-ab-e6-83-85/#post-footer" class="postShorten-excerpt_link link">
                                Comment and share
                            </a>
                        </p>
                    
                </div>
            
        </div>
        
    </article>
    
    <div class="pagination-bar">
    <ul class="pagination">
        
        <li class="pagination-prev">
            
                <a class="btn btn--default btn--small" href="/archives/page/3/">
            
                <i class="fa fa-angle-left text-base icon-mr"></i>
                    <span>NEWER POSTS</span>
            </a>
        </li>
        
        
        <li class="pagination-number">page 4 of 4</li>
    </ul>
</div>

</section>



                <footer id="footer" class="main-content-wrap">
    <span class="copyrights">
        Copyrights &copy; 2017 Star. All Rights Reserved.
    </span>
</footer>

            </div>
            
        </div>
        


<div id="about">
    <div id="about-card">
        <div id="about-btn-close">
            <i class="fa fa-remove"></i>
        </div>
        
            <h4 id="about-card-name">Star</h4>
        
            <div id="about-card-bio"><p>author.bio</p>
</div>
        
        
            <div id="about-card-job">
                <i class="fa fa-briefcase"></i>
                <br/>
                <p>author.job</p>

            </div>
        
        
    </div>
</div>

        <div id="algolia-search-modal" class="modal-container">
    <div class="modal">
        <div class="modal-header">
            <span class="close-button"><i class="fa fa-close"></i></span>
            <a href="https://algolia.com" target="_blank" class="searchby-algolia text-color-light link-unstyled">
                <span class="searchby-algolia-text text-color-light text-small">by</span>
                <img class="searchby-algolia-logo" src="https://www.algolia.com/static_assets/images/press/downloads/algolia-light.svg">
            </a>
            <i class="search-icon fa fa-search"></i>
            <form id="algolia-search-form">
                <input type="text" id="algolia-search-input" name="search"
                    class="form-control input--large search-input" placeholder="Search "
                    autofocus="autofocus"/>
            </form>
        </div>
        <div class="modal-body">
            <div class="no-result text-color-light text-center">no post found</div>
            <div class="results">
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/21/e5-bc-80-e7-af-87-ef-bc-9a-e6-89-93-e7-a2-8e-e6-b5-85-e8-96-84-e5-92-8c-e7-9f-ab-e6-83-85/">
                            <h3 class="media-heading">开篇：打碎浅薄和矫情</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 21, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/21/2016-07-21/">
                            <h3 class="media-heading">2016-07-21</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 21, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/26/how-to-use-markdown-as-a-starter/">
                            <h3 class="media-heading">How to use Markdown as a starter</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 26, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/27/e4-bd-bf-e7-94-a8emacs-e4-bb-8e-e6-97-a0-e6-b3-95-e5-85-a5-e9-97-a8-e5-88-b0-e6-94-be-e5-bc-83/">
                            <h3 class="media-heading">使用Emacs: 从无法入门到放弃</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 27, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/30/e6-b8-a9-e5-ba-a6/">
                            <h3 class="media-heading">温度</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 30, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/08/02/2016-08-02/">
                            <h3 class="media-heading">2016-08-02</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Aug 2, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/08/27/e6-98-8e-e5-a4-a9-e4-b8-80-e5-88-87-e5-a5-bd-e8-af-b4/">
                            <h3 class="media-heading">明天一切好说</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Aug 27, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/09/19/python-remove-e8-af-af-e5-8c-ba/">
                            <h3 class="media-heading">python remove误区</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Sep 19, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/09/23/e5-90-ac-e6-9d-8e-e5-ae-97-e7-9b-9b/">
                            <h3 class="media-heading">听李宗盛</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Sep 23, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/10/15/leetcode-172-easyfactorial-trailing-zeroes/">
                            <h3 class="media-heading">LeetCode 172.Factorial Trailing Zeroes</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Oct 15, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
            </div>
        </div>
        <div class="modal-footer">
            <p class="results-count text-medium"
                data-message-zero="no post found"
                data-message-one="1 post found"
                data-message-other="{n} posts found">
                32 posts found
            </p>
        </div>
    </div>
</div>
        
<div id="cover" style="background-image:url('/assets/images/cover.jpg');"></div>
        <!--SCRIPTS-->
<script src="/assets/js/script-rt08quwts7iav5x0cfd2ym0gb5qkd1lvrsmwrakxtkhefmaaes4ywkmnjnwf.min.js"></script>
<!--SCRIPTS END--><!-- hexo-inject:begin --><!-- hexo-inject:end -->



    </body>
</html>
