
<!DOCTYPE html>
<html lang="en">
    
<head>
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="generator" content="Star">
    <title>天冷该吃火锅 - Star</title>
    <meta name="author" content="Star">
    
    
    
        <link rel="alternate" type="application/atom+xml" title="RSS" href="/atom.xml">
    
    <meta name="description" content="&amp;#x665A;&amp;#x4E0A;&amp;#xFF0C;&amp;#x7FFB;&amp;#x5230;&amp;#x4E00;&amp;#x7BC7;&amp;#x5199;&amp;#x5317;&amp;#x4EAC;&amp;#x5364;&amp;#x716E;&amp;#x7684;&amp;#x6587;&amp;#x7AE0;&amp;#x3002;15&amp;#x5E74;&amp;#x590F;&amp;#x5929;&amp;#x5728;&amp;#x5317;&amp;#x4EAC;&amp;#xFF0C;&amp;#x4E00;&amp;#x4">
<meta property="og:type" content="blog">
<meta property="og:title" content="天冷该吃火锅">
<meta property="og:url" content="http://yoursite.com/2016/11/22/e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85/index.html">
<meta property="og:site_name" content="Star">
<meta property="og:description" content="&amp;#x665A;&amp;#x4E0A;&amp;#xFF0C;&amp;#x7FFB;&amp;#x5230;&amp;#x4E00;&amp;#x7BC7;&amp;#x5199;&amp;#x5317;&amp;#x4EAC;&amp;#x5364;&amp;#x716E;&amp;#x7684;&amp;#x6587;&amp;#x7AE0;&amp;#x3002;15&amp;#x5E74;&amp;#x590F;&amp;#x5929;&amp;#x5728;&amp;#x5317;&amp;#x4EAC;&amp;#xFF0C;&amp;#x4E00;&amp;#x4">
<meta property="og:updated_time" content="2016-12-20T16:40:31.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="天冷该吃火锅">
<meta name="twitter:description" content="&amp;#x665A;&amp;#x4E0A;&amp;#xFF0C;&amp;#x7FFB;&amp;#x5230;&amp;#x4E00;&amp;#x7BC7;&amp;#x5199;&amp;#x5317;&amp;#x4EAC;&amp;#x5364;&amp;#x716E;&amp;#x7684;&amp;#x6587;&amp;#x7AE0;&amp;#x3002;15&amp;#x5E74;&amp;#x590F;&amp;#x5929;&amp;#x5728;&amp;#x5317;&amp;#x4EAC;&amp;#xFF0C;&amp;#x4E00;&amp;#x4">
    
    
        
    
    
    
    
    
    <!--STYLES-->
    <link rel="stylesheet" href="/assets/css/style-yrst5vo1nxaxbp2g3v9na2wg1lixlpr3ghbjdvskeixmu79deycecx3rh4bt.min.css">
    <!--STYLES END--><!-- hexo-inject:begin --><!-- hexo-inject:end -->
    
    
</head>

    <body>
        <!-- hexo-inject:begin --><!-- hexo-inject:end --><div id="blog">
            <!-- Define author's picture -->


    

<header id="header" data-behavior="4">
    <i id="btn-open-sidebar" class="fa fa-lg fa-bars"></i>
    <div class="header-title">
        <a class="header-title-link" href="/ ">Star</a>
    </div>
    
        
            <a  class="header-right-picture "
                href="#about">
        
        
        </a>
    
</header>

            <!-- Define author's picture -->


<nav id="sidebar" data-behavior="4">
    <div class="sidebar-container">
        
        
            <ul class="sidebar-buttons">
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/ "
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-home"></i>
                        <span class="sidebar-button-desc">Home</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/all-categories"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-bookmark"></i>
                        <span class="sidebar-button-desc">Categories</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/all-tags"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-tags"></i>
                        <span class="sidebar-button-desc">Tags</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/all-archives"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-archive"></i>
                        <span class="sidebar-button-desc">Archives</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link open-algolia-search"
                             href="#search"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-search"></i>
                        <span class="sidebar-button-desc">Search</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="#about"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-question"></i>
                        <span class="sidebar-button-desc">About</span>
                    </a>
            </li>
            
        </ul>
        
            <ul class="sidebar-buttons">
            
        </ul>
        
            <ul class="sidebar-buttons">
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/atom.xml"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-rss"></i>
                        <span class="sidebar-button-desc">RSS</span>
                    </a>
            </li>
            
        </ul>
        
    </div>
</nav>

            
            <div id="main" data-behavior="4"
                 class="
                        hasCoverMetaIn
                        ">
                
<article class="post" itemscope itemType="http://schema.org/BlogPosting">
    
    
        <div class="post-header main-content-wrap text-left">
    
        <h1 class="post-title" itemprop="headline">
            天冷该吃火锅
        </h1>
    
    <div class="post-meta">
    <time itemprop="datePublished" datetime="2016-11-22T13:18:43-05:00">
	
		    Nov 22, 2016
    	
    </time>
    
        <span>in </span>
        
    <a class="category-link" href="/categories/真实的生命/">真实的生命</a>


    
</div>

</div>
    
    <div class="post-content markdown" itemprop="articleBody">
        <div class="main-content-wrap">
            <script src="/assets/js/DPlayer.min.js"> </script><p><embed src="http://www.xiami.com/widget/12753884_1773763930/singlePlayer.swf" type="application/x-shockwave-flash" width="257" height="33" wmode="transparent"></p>
<p>&#x665A;&#x4E0A;&#xFF0C;&#x7FFB;&#x5230;&#x4E00;&#x7BC7;&#x5199;&#x5317;&#x4EAC;&#x5364;&#x716E;&#x7684;&#x6587;&#x7AE0;&#x3002;15&#x5E74;&#x590F;&#x5929;&#x5728;&#x5317;&#x4EAC;&#xFF0C;&#x4E00;&#x4E2A;&#x59D1;&#x5A18;&#x5E26;&#x6211;&#x53BB;&#x4E86;&#x4E00;&#x4E2A;&#x5357;&#x57CE;&#x7684;&#x80E1;&#x540C;&#x91CC;&#x5403;&#x5364;&#x716E;&#x3002;&#x4E70;&#x5355;&#x7684;&#x4E0D;&#x662F;&#x6211;&#xFF0C;&#x9886;&#x9910;&#x7684;&#x4E5F;&#x4E0D;&#x662F;&#x6211;&#x3002;</p>
<p>&#x5728;&#x5403;&#x5B8C;&#x4E4B;&#x524D;&#x6211;&#x90FD;&#x6CA1;&#x592A;&#x641E;&#x6E05;&#x695A;&#x5230;&#x5E95;&#x5364;&#x716E;&#x91CC;&#x9762;&#x7684;&#x90A3;&#x4E9B;&#x5177;&#x4F53;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x6211;&#x5728;&#x5F53;&#x65F6;&#x5E38;&#x804A;&#x7684;&#x5FAE;&#x4FE1;&#x7FA4;&#x91CC;&#x8BF4;&#x6211;&#x5728;&#x5403;&#x5364;&#x716E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x54E5;&#x6765;&#x4E86;&#x4E00;&#x53E5;&#xFF0C;Star&#xFF0C;&#x4F60;&#x5C45;&#x7136;&#x6562;&#x5403;&#x5364;&#x716E;&#x554A;&#xFF1F;&#x5F53;&#x7136;&#x6562;&#x3002;</p>
<p>&#x6211;&#x6709;&#x4EC0;&#x4E48;&#x662F;&#x4E0D;&#x6562;&#x7684;&#x3002;&#x79D1;&#x79D1;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x88AB;&#x79D1;&#x666E;&#x5B8C;&#x5364;&#x716E;&#x7684;&#x6784;&#x6210;&#x4EE5;&#x540E;&#xFF0C;&#x6B63;&#x7AD9;&#x5728;&#x4E94;&#x9053;&#x53E3;&#x519C;&#x79D1;&#x9662;&#x7684;&#x90A3;&#x7247;&#x7A3B;&#x7530;&#x524D;&#x7684;&#x6211;&#xFF0C;&#x5DEE;&#x70B9;&#x8FDE;&#x540C;&#x521A;&#x521A;&#x5403;&#x7684;&#x5434;&#x88D5;&#x6CF0;&#x62B9;&#x8336;&#x51B0;&#x6DC7;&#x6DCB;&#x4E00;&#x8D77;&#x5410;&#x51FA;&#x6765;&#x3002;&#x6211;&#x611F;&#x53D7;&#x5230;&#x4E86;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5357;&#x65B9;&#x4EBA;&#x7684;&#x6781;&#x9650;&#x3002;
&#x73B0;&#x5728;&#x60F3;&#x60F3;&#xFF0C;&#x900F;&#x8FC7;&#x73B0;&#x8C61;&#x629B;&#x5F00;&#x5FC3;&#x7406;&#x56E0;&#x7D20;&#xFF0C;&#x6211;&#x627F;&#x8BA4;&#x90A3;&#x662F;&#x597D;&#x5403;&#x7684;&#x3002;&#x522B;&#x5FD8;&#x4E86;&#xFF0C;&#x8981;&#x914D;&#x5317;&#x51B0;&#x6D0B;&#x3002;</p>
<p>&#x5728;&#x5916;&#x9762;&#xFF0C;&#x6700;&#x8106;&#x5F31;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x662F;&#x60F3;&#x5403;&#x800C;&#x4E0D;&#x53EF;&#x5F97;&#x3002;&#x4E4B;&#x524D;&#x60F3;&#x5403;&#x80A0;&#x7C89;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E50;&#x6587;&#x5E26;&#x6211;&#x53BB;&#x4E86;&#x5339;&#x6751;&#x552F;&#x4E00;&#x4E00;&#x5BB6;&#x7684;&#x65E9;&#x8336;&#x5E97;&#xFF0C;&#x53EF;&#x60DC;&#x4E0D;&#x597D;&#x5403;&#x3002;&#x4EE5;&#x524D;&#x5728;&#x6FB3;&#x6D32;&#xFF0C;&#x5E7F;&#x4E1C;&#x4EBA;&#x5230;&#x5904;&#x90FD;&#x6709;&#xFF0C;&#x5728;&#x5C0F;&#x5929;&#x4F7F;&#x548C;&#x56E7;&#x56E7;&#x4E24;&#x4E2A;&#x6F6E;&#x6C55;&#x4EBA;&#x7684;&#x5E26;&#x52A8;&#x4E0B;&#xFF0C;&#x6211;&#x6DF1;&#x6DF1;&#x7231;&#x4E0A;&#x4E86;&#x65E9;&#x8336;&#x3002;&#x867E;&#x997A;&#x7687;&#x8981;&#x6709;&#x6C41;&#x513F;&#x624D;&#x597D;&#x5403;&#xFF0C;&#x871C;&#x6C41;&#x6392;&#x9AA8;&#x8981;&#x719F;&#x900F;&#xFF0C;&#x51E4;&#x722A;&#x8981;&#x7C89;&#x70C2;&#x4E14;&#x5165;&#x5473;&#x3002;&#x5403;&#x5F97;&#x4E0B;&#x5462;&#xFF0C;&#x53EF;&#x4EE5;&#x6765;&#x4E00;&#x4E2A;&#x69B4;&#x83B2;&#x9165;&#xFF0C;&#x53C9;&#x70E7;&#x5305;&#x3002;&#x4E3B;&#x98DF;&#x5F53;&#x7136;&#x662F;&#x5E72;&#x7092;&#x725B;&#x6CB3;&#x6216;&#x8005;&#x9C9C;&#x867E;&#x4E91;&#x541E;&#x9762;&#x5566;&#x3002;&#x53EF;&#x662F;&#x8FD9;&#x91CC;&#x8FDE;&#x4E00;&#x5BB6;&#x50CF;&#x6837;&#x7684;&#x65E9;&#x8336;&#x5E97;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x548C;&#x5C0F;&#x5929;&#x4F7F;&#x4E00;&#x8D77;&#x611F;&#x5230;&#x5FE7;&#x4F24;&#x3002;</p>
<p>&#x6700;&#x8FD1;&#x5929;&#x51B7;&#xFF0C;&#x96EA;&#x5FFD;&#x7136;&#x4E0B;&#x8D77;&#x6765;&#xFF0C;&#x98CE;&#x5C31;&#x5728;&#x6211;&#x5C4B;&#x5B50;&#x7684;&#x5916;&#x9762;&#x547C;&#x547C;&#x5730;&#x522E;&#xFF0C;&#x6709;&#x670B;&#x53CB;&#x6765;&#x5BB6;&#x91CC;&#x5403;&#x706B;&#x9505;&#xFF0C;&#x7A97;&#x5916;&#x96EA;&#x82B1;&#x659C;&#x7740;&#x98D8;&#xFF0C;&#x5C4B;&#x91CC;&#x5374;&#x70ED;&#x6C14;&#x817E;&#x817E;&#x7684;&#x3002;&#x68A6;&#x7476;&#x57CB;&#x5934;&#x5BFB;&#x627E;&#x5979;&#x7684;&#x5E74;&#x7CD5;&#x3002;&#x4E50;&#x4E50;&#x76F4;&#x547C;&#x592A;&#x5E78;&#x798F;&#x4E86;&#x3002;&#x723D;&#x723D;&#x5403;&#x5F97;&#x5FD8;&#x4E86;&#x5979;&#x521A;&#x521A;&#x600E;&#x4E48;&#x4E5F;&#x4FEE;&#x4E0D;&#x597D;&#x7684;bug&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x523B;&#xFF0C;&#x6EE1;&#x8DB3;&#x53D8;&#x5F97;&#x5F88;&#x771F;&#x5B9E;&#x3002;&#x6EE1;&#x8DB3;&#x7684;&#xFF0C;&#x662F;&#x4E00;&#x76D2;&#x725B;&#x8089;&#xFF0C;&#x4E00;&#x76D8;&#x6D77;&#x5E26;&#x7ED3;&#xFF0C;&#x4E00;&#x5757;&#x8C46;&#x8150;&#x76AE;&#xFF0C;&#x4E00;&#x888B;&#x9C7C;&#x4E38;&#x5C31;&#x80FD;&#x89E3;&#x51B3;&#x7684;&#x6B32;&#x671B;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x5728;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#xFF0C;&#x5BF9;&#x98DF;&#x7269;&#x7684;&#x6B32;&#x671B;&#x53CD;&#x6620;&#x7740;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x7CBE;&#x795E;&#x72B6;&#x6001;&#x3002;&#x7279;&#x522B;&#x7FA1;&#x6155;&#x8FD8;&#x80FD;&#x5BF9;&#x98DF;&#x7269;&#x6000;&#x62B1;100%&#x671F;&#x5F85;&#x7684;&#x4EBA;&#x3002;&#x90A3;&#x4E00;&#x5B9A;&#x662F;&#x70ED;&#x7231;&#x751F;&#x6D3B;&#x7684;&#x4EBA;&#x3002;&#x50CF;&#x6211;&#xFF0C;&#x53EA;&#x6709;&#x60F3;&#x505A;&#x83DC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624D;&#x4F1A;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x662F;&#x5BF9;&#x751F;&#x6D3B;&#x62B1;&#x6709;&#x61A7;&#x61AC;&#x7684;&#x3002;</p>
<p>&#x72B6;&#x6001;&#x975E;&#x5E38;&#x5DEE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x548C;&#x8349;&#x8349;&#x8BA8;&#x8BBA;&#x8FC7;&#xFF0C;&#x5F53;&#x7ECF;&#x5386;&#x7740;&#x65E0;&#x6CD5;&#x81EA;&#x6108;&#x7684;&#x75DB;&#x82E6;&#xFF0C;&#x98DF;&#x7269;&#x8FD9;&#x79CD;&#x65E0;&#x95E8;&#x69DB;&#x3001;&#x4E0D;&#x9700;&#x8981;&#x9AD8;&#x96BE;&#x5EA6;&#x7ADE;&#x4E89;&#x5C31;&#x553E;&#x624B;&#x53EF;&#x5F97;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x662F;&#x6700;&#x4F4E;&#x7A0B;&#x5EA6;&#x7684;&#x6CBB;&#x7597;&#x65B9;&#x5F0F;&#x3002;&#x4F46;&#x968F;&#x7740;&#x5BF9;&#x75DB;&#x82E6;&#x7684;&#x8BA4;&#x77E5;&#x52A0;&#x6DF1;&#xFF0C;&#x5BF9;&#x4E8E;&#x81EA;&#x6211;&#x8C03;&#x8282;&#x7684;&#x8981;&#x6C42;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x53D8;&#x5F97;&#x96BE;&#x4EE5;&#x6EE1;&#x8DB3;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x201C;&#x5403;&#x4E00;&#x987F;&#x5927;&#x9910;&#x5C31;&#x597D;&#x4E86;&#x201D;&#x8FD9;&#x79CD;&#x89E3;&#x538B;&#x65B9;&#x5F0F;&#x5BF9;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x9002;&#x7528;&#x3002;high&#x70B9;&#x592A;&#x9AD8;&#x5230;&#xFF0C;&#x9700;&#x8981;&#x53BB;&#x8E66;&#x6781;&#xFF0C;&#x5750;&#x8FC7;&#x5C71;&#x8F66;&#xFF0C;&#x542C;live&#xFF0C;&#x559D;&#x9152;&#x624D;&#x80FD;&#x597D;&#x4E00;&#x4E9B;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x5FC3;&#x91CC;&#xFF0C;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#x662F;&#x98DF;&#x7269;&#x6240;&#x65E0;&#x6CD5;&#x89E3;&#x51B3;&#x7684;&#xFF0C;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x4E5F;&#x8BB8;&#x672A;&#x6765;&#x662F;&#x4F1A;&#x597D;&#x7684;&#xFF0C;&#x4F1A;&#x6709;&#x77ED;&#x6682;&#x7684;&#x5FEB;&#x4E50;&#x7684;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#xFF0C;&#x6211;&#x4EEC;&#x81EA;&#x8EAB;&#x4E0D;&#x4F1A;&#x597D;&#x4E86;&#x3002;&#x5C31;&#x50CF;Monica&#x548C;Rachel&#x8BF4;&#x7684;&#xFF0C;&#x201C;That&apos;s food, not love.&#x201D;&#x3002;&#x4E0D;&#x8FC7;&#x8FD8;&#x597D;&#xFF0C;&#x6700;&#x4E25;&#x91CD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5D29;&#x6E83;&#x5F97;&#x4E0D;&#x6210;&#x4EBA;&#x5F62;&#xFF0C;&#x4EC0;&#x4E48;&#x4E5F;&#x5E72;&#x4E0D;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x81F3;&#x4E8E;&#x6CA1;&#x6709;&#x5BF9;&#x98DF;&#x7269;&#x4E00;&#x70B9;&#x6B32;&#x671B;&#x90FD;&#x6CA1;&#x6709;&#x3002;</p>
<p>&#x5927;&#x4E09;&#x6691;&#x5047;&#xFF0C;&#x4E5D;&#x56DB;&#x548C;&#x6211;&#x6838;&#x5BF9;&#x6291;&#x90C1;&#x75C7;&#x75C7;&#x72B6;&#xFF0C;&#x5FEB;&#x5230;&#x89C9;&#x5F97;&#x6211;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x5403;&#x836F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x201C;&#x5B8C;&#x5168;&#x4E0D;&#x60F3;&#x5403;&#x4E1C;&#x897F;&#x201D;&#x8FD9;&#x4E00;&#x6761;&#x5C31;&#x6253;&#x56DE;&#x4E86;&#x539F;&#x5F62;&#x3002;&#x770B;&#x6765;&#x6CA1;&#x6709;&#x6291;&#x90C1;&#x75C7;&#xFF0C;&#x8FD8;&#x80FD;&#x7B11;&#x7740;&#x6D3B;&#x4E0B;&#x53BB;&#x3002;&#x53EF;&#x80FD;&#xFF0C;&#x98DF;&#x7269;&#x662F;&#x6700;&#x540E;&#x7684;&#x5E95;&#x7EBF;&#x4E86;&#x5427;&#x3002;</p>
<p>&#x53C8;&#x60F3;&#x8D77;&#x5F53;&#x65F6;&#x5E26;&#x6211;&#x53BB;&#x5403;&#x5364;&#x716E;&#x7684;&#x59D1;&#x5A18;&#xFF0C;&#x6211;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x5FD8;&#x4E86;&#x5979;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x53EA;&#x8BB0;&#x5F97;&#x5979;&#x7684;&#x5FAE;&#x4FE1;&#x5934;&#x50CF;&#x662F;&#x300A;&#x8FD9;&#x4E2A;&#x6740;&#x624B;&#x4E0D;&#x592A;&#x51B7;&#x300B;&#x91CC;&#x5A1C;&#x5854;&#x8389;&#x6CE2;&#x7279;&#x66FC;&#x62FF;&#x67AA;&#x7684;&#x6837;&#x5B50;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x5C31;&#x5728;&#x60F3;&#x554A;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#xFF0C;20&#x591A;&#x5C81;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x6B7B;&#x4E86;&#xFF0C;&#x4E4B;&#x540E;&#x7684;&#x65E5;&#x5B50;&#x4E0D;&#x8FC7;&#x662F;&#x673A;&#x68B0;&#x5730;&#x91CD;&#x590D;&#x4E4B;&#x524D;&#x7684;&#x65E5;&#x5B50;&#x3002;&#x4F46;&#x5979;&#x8FD8;&#x6CA1;&#x6709;&#xFF0C;&#x5979;&#x5BF9;&#x80E1;&#x540C;&#x6709;&#x70ED;&#x60C5;&#xFF0C;&#x5BF9;&#x7F8E;&#x98DF;&#x6709;&#x70ED;&#x60C5;&#xFF0C;&#x5BF9;&#x964C;&#x751F;&#x4EBA;&#x4E5F;&#x6709;&#x70ED;&#x60C5;&#x3002;&#x771F;&#x597D;&#x3002;</p>

            
        </div>
    </div>
    <div id="post-footer" class="post-footer main-content-wrap">
        
            <div class="post-footer-tags">
                <span class="text-color-light text-small">TAGGED IN</span><br/>
                
    <a class="tag tag--primary tag--small t-link" href="/tags/食物/">食物</a>

            </div>
        
        <div class="post-actions-wrap">
    <nav>
        <ul class="post-actions post-action-nav">
            <li class="post-action">
                
                    <a class="post-action-btn btn btn--default tooltip--top" href="/2016/12/29/LeetCode-401/"  data-tooltip="LeetCode 401. Binary Watch">
                
                    <i class="fa fa-angle-left"></i>
                    <span class="hide-xs hide-sm text-small icon-ml">PREVIOUS</span>
                </a>
            </li>
            <li class="post-action">
                
                    <a class="post-action-btn btn btn--default tooltip--top" href="/2016/11/13/java-e4-b8-ad-e7-9a-84-e6-af-94-e8-be-83/" data-tooltip="Java中的比较">
                
                    <span class="hide-xs hide-sm text-small icon-mr">NEXT</span>
                    <i class="fa fa-angle-right"></i>
                </a>
            </li>
        </ul>
    </nav>
    <ul class="post-actions post-action-share">
        <li class="post-action hide-lg hide-md hide-sm">
            <a class="post-action-btn btn btn--default btn-open-shareoptions"  href="#btn-open-shareoptions">
                <i class="fa fa-share-alt"></i>
            </a>
        </li>
        <li class="post-action hide-xs">
            <a class="post-action-btn btn btn--default" target="new" href="https://plus.google.com/share?url=http://yoursite.com/2016/11/22/e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85/">
                <i class="fa fa-google-plus"></i>
            </a>
        </li>
        <li class="post-action hide-xs">
            <a class="post-action-btn btn btn--default" target="new" href="https://www.facebook.com/sharer/sharer.php?u=http://yoursite.com/2016/11/22/e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85/">
                <i class="fa fa-facebook-official"></i>
            </a>
        </li>
        <li class="post-action hide-xs">
            <a class="post-action-btn btn btn--default" target="new" href="https://twitter.com/intent/tweet?text=http://yoursite.com/2016/11/22/e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85/">
                <i class="fa fa-twitter"></i>
            </a>
        </li>
        
        <li class="post-action">
            
                <a class="post-action-btn btn btn--default" href="#">
            
                <i class="fa fa-list"></i>
            </a>
        </li>
    </ul>
</div>


        
            
        
    </div>
</article>



                <footer id="footer" class="main-content-wrap">
    <span class="copyrights">
        Copyrights &copy; 2017 Star. All Rights Reserved.
    </span>
</footer>

            </div>
            
                <div id="bottom-bar" class="post-bottom-bar" data-behavior="4">
                    <div class="post-actions-wrap">
    <nav>
        <ul class="post-actions post-action-nav">
            <li class="post-action">
                
                    <a class="post-action-btn btn btn--default tooltip--top" href="/2016/12/29/LeetCode-401/"  data-tooltip="LeetCode 401. Binary Watch">
                
                    <i class="fa fa-angle-left"></i>
                    <span class="hide-xs hide-sm text-small icon-ml">PREVIOUS</span>
                </a>
            </li>
            <li class="post-action">
                
                    <a class="post-action-btn btn btn--default tooltip--top" href="/2016/11/13/java-e4-b8-ad-e7-9a-84-e6-af-94-e8-be-83/" data-tooltip="Java中的比较">
                
                    <span class="hide-xs hide-sm text-small icon-mr">NEXT</span>
                    <i class="fa fa-angle-right"></i>
                </a>
            </li>
        </ul>
    </nav>
    <ul class="post-actions post-action-share">
        <li class="post-action hide-lg hide-md hide-sm">
            <a class="post-action-btn btn btn--default btn-open-shareoptions"  href="#btn-open-shareoptions">
                <i class="fa fa-share-alt"></i>
            </a>
        </li>
        <li class="post-action hide-xs">
            <a class="post-action-btn btn btn--default" target="new" href="https://plus.google.com/share?url=http://yoursite.com/2016/11/22/e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85/">
                <i class="fa fa-google-plus"></i>
            </a>
        </li>
        <li class="post-action hide-xs">
            <a class="post-action-btn btn btn--default" target="new" href="https://www.facebook.com/sharer/sharer.php?u=http://yoursite.com/2016/11/22/e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85/">
                <i class="fa fa-facebook-official"></i>
            </a>
        </li>
        <li class="post-action hide-xs">
            <a class="post-action-btn btn btn--default" target="new" href="https://twitter.com/intent/tweet?text=http://yoursite.com/2016/11/22/e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85/">
                <i class="fa fa-twitter"></i>
            </a>
        </li>
        
        <li class="post-action">
            
                <a class="post-action-btn btn btn--default" href="#">
            
                <i class="fa fa-list"></i>
            </a>
        </li>
    </ul>
</div>


                </div>
                <div id="share-options-bar" class="share-options-bar" data-behavior="4">
    <ul class="share-options">
        <li class="share-option">
            <a class="share-option-btn" target="new" href="https://plus.google.com/share?url=http://yoursite.com/2016/11/22/e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85/">
                <i class="fa fa-google-plus"></i><span>Share on Google Plus</span>
            </a>
        </li>
        <li class="share-option">
            <a class="share-option-btn" target="new" href="https://www.facebook.com/sharer/sharer.php?u=http://yoursite.com/2016/11/22/e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85/">
                <i class="fa fa-facebook-official"></i><span>Share on Facebook</span>
            </a>
        </li>
        <li class="share-option">
            <a class="share-option-btn" target="new" href="https://twitter.com/intent/tweet?text=http://yoursite.com/2016/11/22/e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85/">
                <i class="fa fa-twitter"></i><span>Share on Twitter</span>
            </a>
        </li>
    </ul>
</div>
<div id="share-options-mask" class="share-options-mask"></div>

            
        </div>
        


<div id="about">
    <div id="about-card">
        <div id="about-btn-close">
            <i class="fa fa-remove"></i>
        </div>
        
            <h4 id="about-card-name">Star</h4>
        
            <div id="about-card-bio"><p>author.bio</p>
</div>
        
        
            <div id="about-card-job">
                <i class="fa fa-briefcase"></i>
                <br/>
                <p>author.job</p>

            </div>
        
        
    </div>
</div>

        <div id="algolia-search-modal" class="modal-container">
    <div class="modal">
        <div class="modal-header">
            <span class="close-button"><i class="fa fa-close"></i></span>
            <a href="https://algolia.com" target="_blank" class="searchby-algolia text-color-light link-unstyled">
                <span class="searchby-algolia-text text-color-light text-small">by</span>
                <img class="searchby-algolia-logo" src="https://www.algolia.com/static_assets/images/press/downloads/algolia-light.svg">
            </a>
            <i class="search-icon fa fa-search"></i>
            <form id="algolia-search-form">
                <input type="text" id="algolia-search-input" name="search"
                    class="form-control input--large search-input" placeholder="Search "
                    autofocus="autofocus"/>
            </form>
        </div>
        <div class="modal-body">
            <div class="no-result text-color-light text-center">no post found</div>
            <div class="results">
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/21/e5-bc-80-e7-af-87-ef-bc-9a-e6-89-93-e7-a2-8e-e6-b5-85-e8-96-84-e5-92-8c-e7-9f-ab-e6-83-85/">
                            <h3 class="media-heading">开篇：打碎浅薄和矫情</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 21, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/21/2016-07-21/">
                            <h3 class="media-heading">2016-07-21</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 21, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/26/how-to-use-markdown-as-a-starter/">
                            <h3 class="media-heading">How to use Markdown as a starter</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 26, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/27/e4-bd-bf-e7-94-a8emacs-e4-bb-8e-e6-97-a0-e6-b3-95-e5-85-a5-e9-97-a8-e5-88-b0-e6-94-be-e5-bc-83/">
                            <h3 class="media-heading">使用Emacs: 从无法入门到放弃</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 27, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/30/e6-b8-a9-e5-ba-a6/">
                            <h3 class="media-heading">温度</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 30, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/08/02/2016-08-02/">
                            <h3 class="media-heading">2016-08-02</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Aug 2, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/08/27/e6-98-8e-e5-a4-a9-e4-b8-80-e5-88-87-e5-a5-bd-e8-af-b4/">
                            <h3 class="media-heading">明天一切好说</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Aug 27, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/09/19/python-remove-e8-af-af-e5-8c-ba/">
                            <h3 class="media-heading">python remove误区</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Sep 19, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/09/23/e5-90-ac-e6-9d-8e-e5-ae-97-e7-9b-9b/">
                            <h3 class="media-heading">听李宗盛</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Sep 23, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/10/15/leetcode-172-easyfactorial-trailing-zeroes/">
                            <h3 class="media-heading">LeetCode 172.Factorial Trailing Zeroes</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Oct 15, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
            </div>
        </div>
        <div class="modal-footer">
            <p class="results-count text-medium"
                data-message-zero="no post found"
                data-message-one="1 post found"
                data-message-other="{n} posts found">
                32 posts found
            </p>
        </div>
    </div>
</div>
        
<div id="cover" style="background-image:url('/assets/images/cover.jpg');"></div>
        <!--SCRIPTS-->
<script src="/assets/js/script-rt08quwts7iav5x0cfd2ym0gb5qkd1lvrsmwrakxtkhefmaaes4ywkmnjnwf.min.js"></script>
<!--SCRIPTS END--><!-- hexo-inject:begin --><!-- hexo-inject:end -->

    



    </body>
</html>
