
<!DOCTYPE html>
<html lang="en">
    
<head>
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="generator" content="Star">
    <title>Category: 真实的生命 - Star</title>
    <meta name="author" content="Star">
    
    
    
        <link rel="alternate" type="application/atom+xml" title="RSS" href="/atom.xml">
    
    <meta name="description" content="不要温和地走进那个良夜。@CMU">
<meta property="og:type" content="blog">
<meta property="og:title" content="Star">
<meta property="og:url" content="http://yoursite.com/categories/真实的生命/index.html">
<meta property="og:site_name" content="Star">
<meta property="og:description" content="不要温和地走进那个良夜。@CMU">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Star">
<meta name="twitter:description" content="不要温和地走进那个良夜。@CMU">
    
    
        
    
    
    
    
    
    <!--STYLES-->
    <link rel="stylesheet" href="/assets/css/style-yrst5vo1nxaxbp2g3v9na2wg1lixlpr3ghbjdvskeixmu79deycecx3rh4bt.min.css">
    <!--STYLES END--><!-- hexo-inject:begin --><!-- hexo-inject:end -->
    
    
</head>

    <body>
        <!-- hexo-inject:begin --><!-- hexo-inject:end --><div id="blog">
            <!-- Define author's picture -->


    

<header id="header" data-behavior="1">
    <i id="btn-open-sidebar" class="fa fa-lg fa-bars"></i>
    <div class="header-title">
        <a class="header-title-link" href="/ ">Star</a>
    </div>
    
        
            <a  class="header-right-picture "
                href="#about">
        
        
        </a>
    
</header>

            <!-- Define author's picture -->


<nav id="sidebar" data-behavior="1">
    <div class="sidebar-container">
        
        
            <ul class="sidebar-buttons">
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/ "
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-home"></i>
                        <span class="sidebar-button-desc">Home</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/all-categories"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-bookmark"></i>
                        <span class="sidebar-button-desc">Categories</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/all-tags"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-tags"></i>
                        <span class="sidebar-button-desc">Tags</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/all-archives"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-archive"></i>
                        <span class="sidebar-button-desc">Archives</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link open-algolia-search"
                             href="#search"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-search"></i>
                        <span class="sidebar-button-desc">Search</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="#about"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-question"></i>
                        <span class="sidebar-button-desc">About</span>
                    </a>
            </li>
            
        </ul>
        
            <ul class="sidebar-buttons">
            
        </ul>
        
            <ul class="sidebar-buttons">
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/atom.xml"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-rss"></i>
                        <span class="sidebar-button-desc">RSS</span>
                    </a>
            </li>
            
        </ul>
        
    </div>
</nav>

            
            <div id="main" data-behavior="1"
                 class="
                        hasCoverMetaIn
                        ">
                
    <section class="postShorten-group main-content-wrap">
    
    
    <article class="postShorten postShorten--thumbnailimg-bottom" itemscope itemType="http://schema.org/BlogPosting">
        <div class="postShorten-wrap">
            
            <div class="postShorten-header">
                <h1 class="postShorten-title" itemprop="headline">
                    
                        <a class="link-unstyled" href="/2017/01/24/哪儿/">
                            哪儿
                        </a>
                    
                </h1>
                <div class="postShorten-meta">
    <time itemprop="datePublished" datetime="2017-01-24T01:02:55-05:00">
	
		    Jan 24, 2017
    	
    </time>
    
        <span>in </span>
        
    <a class="category-link" href="/categories/真实的生命/">真实的生命</a>


    
</div>

            </div>
            
                <div class="postShorten-content" itemprop="articleBody">
                    <script src="/assets/js/DPlayer.min.js"> </script><p><embed src="http://www.xiami.com/widget/12753884_1769553081/singlePlayer.swf" type="application/x-shockwave-flash" width="257" height="33" wmode="transparent"></p>
<p>&#x4ECA;&#x5929;&#x4E0A;Advanced Cloud Computing,&#x4E09;&#x4E2A;&#x6559;&#x6388;&#x5C31;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4E89;&#x8BBA;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x90A3;&#x771F;&#x7684;&#x662F;&#x5F88;&#x89E6;&#x52A8;&#x6211;&#x7684;&#x4E00;&#x523B;&#xFF0C;&#x52A0;&#x8D77;&#x6765;&#x90FD;&#x5FEB;150&#x5C81;&#x7684;&#x4E09;&#x4E2A;&#x9876;&#x5C16;&#x5B66;&#x672F;&#x5927;&#x725B;&#xFF0C;&#x5728;&#x6295;&#x5F71;&#x4EEA;&#x524D;&#x9762;&#xFF0C;&#x5BF9;&#x5F85;&#x77E5;&#x8BC6;&#x8FD8;&#x662F;&#x548C;&#x5B69;&#x5B50;&#x4E00;&#x6837;&#x4E13;&#x6CE8;&#x548C;&#x70ED;&#x60C5;&#xFF0C;&#x53EF;&#x7231;&#x6781;&#x4E86;&#x3002;</p>
<p>&#x5FFD;&#x7136;&#x60F3;&#x5230;&#xFF0C;Greg&#x7684;&#x4E3B;&#x9875;&#x4E0A;&#x5199;&#x7740;&#xFF0C;&#x201C;&#x6211;&#x624D;&#x4E0D;&#x662F;&#x4E2A;&#x4E0D;&#x5EA6;&#x5047;&#x7684;&#x6559;&#x6388;&#xFF0C;&#x6211;2012&#x5E74;&#x53BB;&#x51B2;&#x6D6A;&#x4E86;&#x5462;&#xFF01;&#x201D;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x6BCF;&#x6B21;&#x9009;&#x8BFE;&#x90FD;&#x5F88;&#x5934;&#x75BC;&#xFF0C;&#x65F6;&#x95F4;&#x592A;&#x5C11;&#xFF0C;&#x60F3;&#x5B66;&#x7684;&#x8BFE;&#x592A;&#x591A;&#xFF0C;&#x53EA;&#x6068;&#x81EA;&#x5DF1;&#x4E0D;&#x80FD;&#x591A;&#x8BFB;&#x51E0;&#x5E74;&#x3002;&#x6211;&#x4E5F;&#x77E5;&#x9053;&#x4E0A;&#x5B66;&#x671F;&#x5F88;&#x4E0D;&#x5F00;&#x5FC3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D1;&#x8FC7;&#x8A93;&#x8FD9;&#x5B66;&#x671F;&#x4E0D;&#x8981;&#x9009;&#x5F88;&#x96BE;&#x7684;&#x8BFE;&#x4E86;&#x3002;&#x53EF;&#x662F;&#x6211;&#x7684;&#x7814;&#x7A76;&#x751F;&#x53EA;&#x6709;&#x4E00;&#x6B21;&#xFF0C;&#x5728;CMU&#x5FF5;&#x4E66;&#x7684;&#x673A;&#x4F1A;&#x4E5F;&#x53EA;&#x6709;&#x4E00;&#x6B21;&#xFF08;&#x5F53;&#x7136;&#x6211;&#x4E0D;&#x4ECB;&#x610F;&#x4EE5;&#x540E;&#x518D;&#x6765;&#x54C8;&#x54C8;&#x54C8;&#xFF09;&#xFF0C;&#x65E0;&#x6CD5;&#x4E0D;&#x8BF4;&#x670D;&#x81EA;&#x5DF1;&#x518D;&#x4E89;&#x53D6;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x53EA;&#x662F;&#xFF0C;&#x6700;&#x8FD1;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5728;&#x6E10;&#x6E10;&#x653E;&#x5927;&#x3002;</p>
<p>&#x6211;&#x5230;&#x5E95;&#x8981;&#x53BB;&#x54EA;&#x91CC;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x5230;&#x5E95;&#x8981;&#x53BB;&#x54EA;&#x91CC;&#x3002;&#x4F46;&#x5176;&#x5B9E;&#x6BCF;&#x4E2A;&#x4EBA;&#xFF0C;&#x90FD;&#x80FD;&#x770B;&#x5230;&#x90A3;&#x4E48;&#x4E00;&#x4E9B;&#x4E9B;&#x5FAE;&#x5F31;&#x7684;&#x5149;&#xFF0C;&#x597D;&#x50CF;&#x662F;&#x90A3;&#x4E2A;&#x5730;&#x65B9;&#x3002;&#x53EA;&#x662F;&#x6709;&#x4E9B;&#x4EBA;&#x4F1A;&#x9009;&#x62E9;&#x52AA;&#x529B;&#x8DD1;&#x7740;&#x53BB;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x6000;&#x7591;&#x81EA;&#x5DF1;&#x662F;&#x5426;&#x771F;&#x7684;&#x770B;&#x89C1;&#x4E86;&#x5149;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#xFF0C;&#x88C5;&#x4F5C;&#x770B;&#x4E0D;&#x89C1;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x548C;&#x8431;&#x54E5;&#x804A;&#x5929;&#xFF0C;&#x8431;&#x54E5;&#x5012;&#x662F;&#x5F88;&#x723D;&#x5FEB;&#xFF0C;&#x8BF4;&#x4E0D;&#x7BA1;&#x53BB;&#x54EA;&#x513F;&#x4E0D;&#x60F3;&#x5446;&#x5317;&#x4EAC;&#x5438;&#x973E;&#x4E86;&#xFF0C;&#x9664;&#x975E;&#x8FD9;&#x6B21;&#x8003;&#x4E0A;&#x4E86;&#x5317;&#x5F71;&#x3002;&#x4E24;&#x5E74;&#x4E86;&#x554A;&#xFF0C;&#x5317;&#x5F71;&#x7684;&#x68A6;&#x8FD8;&#x5728;&#x3002;</p>
<p>&#x4F60;&#x770B;&#x4F60;&#x770B;&#xFF0C;&#x575A;&#x5B9A;&#x7684;&#x4EBA;&#x90FD;&#x5F88;&#x5766;&#x7136;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x62FF;&#x4E86;&#x6EE1;&#x5206;&#x7684;Mengyao&#xFF0C;&#x603B;&#x548C;&#x6211;&#x8BF4;&#x6BD5;&#x4E1A;&#x627E;&#x4E0D;&#x5230;&#x5DE5;&#x4F5C;&#xFF0C;&#x6253;&#x7B97;&#x53BB;&#x661F;&#x5DF4;&#x514B;&#x95E8;&#x53E3;&#x8E72;&#x7740;&#x6446;&#x4E2A;&#x7897;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6709;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x8981;&#x53BB;&#x54EA;&#x513F;&#x5176;&#x5B9E;&#x4E5F;&#x4E0D;&#x53EF;&#x6015;&#x3002;</p>
<p>&#x6BD5;&#x7ADF;&#x672A;&#x6765;&#x672A;&#x77E5;&#x4E0D;&#x53EF;&#x6015;&#xFF0C;&#x5DF2;&#x77E5;&#x624D;&#x6700;&#x53EF;&#x6015;&#x3002;</p>
<p>&#x6211;&#x7B97;&#x662F;&#x60F3;&#x660E;&#x767D;&#x4E86;&#xFF0C;&#x5173;&#x4E8E;&#x4EBA;&#x751F;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x601D;&#x8003;&#x5F97;&#x592A;&#x7D2F;&#x4E86;&#x3002;&#x8FD9;&#x660E;&#x660E;&#x662F;&#x4E00;&#x9053;&#x65E0;&#x89E3;&#x9898;&#xFF0C;&#x5C31;&#x7B97;&#x6211;&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x523B;&#x5FC3;&#x6EE1;&#x610F;&#x8DB3;&#x60F3;&#x660E;&#x767D;&#x4E86;&#xFF0C;&#x4E5F;&#x4E00;&#x5B9A;&#x662F;&#x5E7B;&#x89C9;&#x3002;</p>
<p>&#x6CA1;&#x6709;&#x7B54;&#x6848;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x8981;&#x601D;&#x8003;&#x4E86;&#x3002;</p>
<p>&#x8FD8;&#x4E0D;&#x5982;&#x75DB;&#x75DB;&#x5FEB;&#x5FEB;&#x6D3B;&#x4E00;&#x6B21;&#x5C31;&#x597D;&#x3002;</p>

                    
                        
                    
                    
                        <p>
                            <a href="/2017/01/24/哪儿/#post-footer" class="postShorten-excerpt_link link">
                                Comment and share
                            </a>
                        </p>
                    
                </div>
            
        </div>
        
    </article>
    
    
    <article class="postShorten postShorten--thumbnailimg-bottom" itemscope itemType="http://schema.org/BlogPosting">
        <div class="postShorten-wrap">
            
            <div class="postShorten-header">
                <h1 class="postShorten-title" itemprop="headline">
                    
                        <a class="link-unstyled" href="/2016/11/22/e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85/">
                            天冷该吃火锅
                        </a>
                    
                </h1>
                <div class="postShorten-meta">
    <time itemprop="datePublished" datetime="2016-11-22T13:18:43-05:00">
	
		    Nov 22, 2016
    	
    </time>
    
        <span>in </span>
        
    <a class="category-link" href="/categories/真实的生命/">真实的生命</a>


    
</div>

            </div>
            
                <div class="postShorten-content" itemprop="articleBody">
                    <script src="/assets/js/DPlayer.min.js"> </script><p><embed src="http://www.xiami.com/widget/12753884_1773763930/singlePlayer.swf" type="application/x-shockwave-flash" width="257" height="33" wmode="transparent"></p>
<p>&#x665A;&#x4E0A;&#xFF0C;&#x7FFB;&#x5230;&#x4E00;&#x7BC7;&#x5199;&#x5317;&#x4EAC;&#x5364;&#x716E;&#x7684;&#x6587;&#x7AE0;&#x3002;15&#x5E74;&#x590F;&#x5929;&#x5728;&#x5317;&#x4EAC;&#xFF0C;&#x4E00;&#x4E2A;&#x59D1;&#x5A18;&#x5E26;&#x6211;&#x53BB;&#x4E86;&#x4E00;&#x4E2A;&#x5357;&#x57CE;&#x7684;&#x80E1;&#x540C;&#x91CC;&#x5403;&#x5364;&#x716E;&#x3002;&#x4E70;&#x5355;&#x7684;&#x4E0D;&#x662F;&#x6211;&#xFF0C;&#x9886;&#x9910;&#x7684;&#x4E5F;&#x4E0D;&#x662F;&#x6211;&#x3002;</p>
<p>&#x5728;&#x5403;&#x5B8C;&#x4E4B;&#x524D;&#x6211;&#x90FD;&#x6CA1;&#x592A;&#x641E;&#x6E05;&#x695A;&#x5230;&#x5E95;&#x5364;&#x716E;&#x91CC;&#x9762;&#x7684;&#x90A3;&#x4E9B;&#x5177;&#x4F53;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x6211;&#x5728;&#x5F53;&#x65F6;&#x5E38;&#x804A;&#x7684;&#x5FAE;&#x4FE1;&#x7FA4;&#x91CC;&#x8BF4;&#x6211;&#x5728;&#x5403;&#x5364;&#x716E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x54E5;&#x6765;&#x4E86;&#x4E00;&#x53E5;&#xFF0C;Star&#xFF0C;&#x4F60;&#x5C45;&#x7136;&#x6562;&#x5403;&#x5364;&#x716E;&#x554A;&#xFF1F;&#x5F53;&#x7136;&#x6562;&#x3002;</p>
<p>&#x6211;&#x6709;&#x4EC0;&#x4E48;&#x662F;&#x4E0D;&#x6562;&#x7684;&#x3002;&#x79D1;&#x79D1;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x88AB;&#x79D1;&#x666E;&#x5B8C;&#x5364;&#x716E;&#x7684;&#x6784;&#x6210;&#x4EE5;&#x540E;&#xFF0C;&#x6B63;&#x7AD9;&#x5728;&#x4E94;&#x9053;&#x53E3;&#x519C;&#x79D1;&#x9662;&#x7684;&#x90A3;&#x7247;&#x7A3B;&#x7530;&#x524D;&#x7684;&#x6211;&#xFF0C;&#x5DEE;&#x70B9;&#x8FDE;&#x540C;&#x521A;&#x521A;&#x5403;&#x7684;&#x5434;&#x88D5;&#x6CF0;&#x62B9;&#x8336;&#x51B0;&#x6DC7;&#x6DCB;&#x4E00;&#x8D77;&#x5410;&#x51FA;&#x6765;&#x3002;&#x6211;&#x611F;&#x53D7;&#x5230;&#x4E86;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5357;&#x65B9;&#x4EBA;&#x7684;&#x6781;&#x9650;&#x3002;
&#x73B0;&#x5728;&#x60F3;&#x60F3;&#xFF0C;&#x900F;&#x8FC7;&#x73B0;&#x8C61;&#x629B;&#x5F00;&#x5FC3;&#x7406;&#x56E0;&#x7D20;&#xFF0C;&#x6211;&#x627F;&#x8BA4;&#x90A3;&#x662F;&#x597D;&#x5403;&#x7684;&#x3002;&#x522B;&#x5FD8;&#x4E86;&#xFF0C;&#x8981;&#x914D;&#x5317;&#x51B0;&#x6D0B;&#x3002;</p>
<p>&#x5728;&#x5916;&#x9762;&#xFF0C;&#x6700;&#x8106;&#x5F31;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x662F;&#x60F3;&#x5403;&#x800C;&#x4E0D;&#x53EF;&#x5F97;&#x3002;&#x4E4B;&#x524D;&#x60F3;&#x5403;&#x80A0;&#x7C89;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E50;&#x6587;&#x5E26;&#x6211;&#x53BB;&#x4E86;&#x5339;&#x6751;&#x552F;&#x4E00;&#x4E00;&#x5BB6;&#x7684;&#x65E9;&#x8336;&#x5E97;&#xFF0C;&#x53EF;&#x60DC;&#x4E0D;&#x597D;&#x5403;&#x3002;&#x4EE5;&#x524D;&#x5728;&#x6FB3;&#x6D32;&#xFF0C;&#x5E7F;&#x4E1C;&#x4EBA;&#x5230;&#x5904;&#x90FD;&#x6709;&#xFF0C;&#x5728;&#x5C0F;&#x5929;&#x4F7F;&#x548C;&#x56E7;&#x56E7;&#x4E24;&#x4E2A;&#x6F6E;&#x6C55;&#x4EBA;&#x7684;&#x5E26;&#x52A8;&#x4E0B;&#xFF0C;&#x6211;&#x6DF1;&#x6DF1;&#x7231;&#x4E0A;&#x4E86;&#x65E9;&#x8336;&#x3002;&#x867E;&#x997A;&#x7687;&#x8981;&#x6709;&#x6C41;&#x513F;&#x624D;&#x597D;&#x5403;&#xFF0C;&#x871C;&#x6C41;&#x6392;&#x9AA8;&#x8981;&#x719F;&#x900F;&#xFF0C;&#x51E4;&#x722A;&#x8981;&#x7C89;&#x70C2;&#x4E14;&#x5165;&#x5473;&#x3002;&#x5403;&#x5F97;&#x4E0B;&#x5462;&#xFF0C;&#x53EF;&#x4EE5;&#x6765;&#x4E00;&#x4E2A;&#x69B4;&#x83B2;&#x9165;&#xFF0C;&#x53C9;&#x70E7;&#x5305;&#x3002;&#x4E3B;&#x98DF;&#x5F53;&#x7136;&#x662F;&#x5E72;&#x7092;&#x725B;&#x6CB3;&#x6216;&#x8005;&#x9C9C;&#x867E;&#x4E91;&#x541E;&#x9762;&#x5566;&#x3002;&#x53EF;&#x662F;&#x8FD9;&#x91CC;&#x8FDE;&#x4E00;&#x5BB6;&#x50CF;&#x6837;&#x7684;&#x65E9;&#x8336;&#x5E97;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x548C;&#x5C0F;&#x5929;&#x4F7F;&#x4E00;&#x8D77;&#x611F;&#x5230;&#x5FE7;&#x4F24;&#x3002;</p>
<p>&#x6700;&#x8FD1;&#x5929;&#x51B7;&#xFF0C;&#x96EA;&#x5FFD;&#x7136;&#x4E0B;&#x8D77;&#x6765;&#xFF0C;&#x98CE;&#x5C31;&#x5728;&#x6211;&#x5C4B;&#x5B50;&#x7684;&#x5916;&#x9762;&#x547C;&#x547C;&#x5730;&#x522E;&#xFF0C;&#x6709;&#x670B;&#x53CB;&#x6765;&#x5BB6;&#x91CC;&#x5403;&#x706B;&#x9505;&#xFF0C;&#x7A97;&#x5916;&#x96EA;&#x82B1;&#x659C;&#x7740;&#x98D8;&#xFF0C;&#x5C4B;&#x91CC;&#x5374;&#x70ED;&#x6C14;&#x817E;&#x817E;&#x7684;&#x3002;&#x68A6;&#x7476;&#x57CB;&#x5934;&#x5BFB;&#x627E;&#x5979;&#x7684;&#x5E74;&#x7CD5;&#x3002;&#x4E50;&#x4E50;&#x76F4;&#x547C;&#x592A;&#x5E78;&#x798F;&#x4E86;&#x3002;&#x723D;&#x723D;&#x5403;&#x5F97;&#x5FD8;&#x4E86;&#x5979;&#x521A;&#x521A;&#x600E;&#x4E48;&#x4E5F;&#x4FEE;&#x4E0D;&#x597D;&#x7684;bug&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x523B;&#xFF0C;&#x6EE1;&#x8DB3;&#x53D8;&#x5F97;&#x5F88;&#x771F;&#x5B9E;&#x3002;&#x6EE1;&#x8DB3;&#x7684;&#xFF0C;&#x662F;&#x4E00;&#x76D2;&#x725B;&#x8089;&#xFF0C;&#x4E00;&#x76D8;&#x6D77;&#x5E26;&#x7ED3;&#xFF0C;&#x4E00;&#x5757;&#x8C46;&#x8150;&#x76AE;&#xFF0C;&#x4E00;&#x888B;&#x9C7C;&#x4E38;&#x5C31;&#x80FD;&#x89E3;&#x51B3;&#x7684;&#x6B32;&#x671B;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x5728;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#xFF0C;&#x5BF9;&#x98DF;&#x7269;&#x7684;&#x6B32;&#x671B;&#x53CD;&#x6620;&#x7740;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x7CBE;&#x795E;&#x72B6;&#x6001;&#x3002;&#x7279;&#x522B;&#x7FA1;&#x6155;&#x8FD8;&#x80FD;&#x5BF9;&#x98DF;&#x7269;&#x6000;&#x62B1;100%&#x671F;&#x5F85;&#x7684;&#x4EBA;&#x3002;&#x90A3;&#x4E00;&#x5B9A;&#x662F;&#x70ED;&#x7231;&#x751F;&#x6D3B;&#x7684;&#x4EBA;&#x3002;&#x50CF;&#x6211;&#xFF0C;&#x53EA;&#x6709;&#x60F3;&#x505A;&#x83DC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624D;&#x4F1A;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x662F;&#x5BF9;&#x751F;&#x6D3B;&#x62B1;&#x6709;&#x61A7;&#x61AC;&#x7684;&#x3002;</p>
<p>&#x72B6;&#x6001;&#x975E;&#x5E38;&#x5DEE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x548C;&#x8349;&#x8349;&#x8BA8;&#x8BBA;&#x8FC7;&#xFF0C;&#x5F53;&#x7ECF;&#x5386;&#x7740;&#x65E0;&#x6CD5;&#x81EA;&#x6108;&#x7684;&#x75DB;&#x82E6;&#xFF0C;&#x98DF;&#x7269;&#x8FD9;&#x79CD;&#x65E0;&#x95E8;&#x69DB;&#x3001;&#x4E0D;&#x9700;&#x8981;&#x9AD8;&#x96BE;&#x5EA6;&#x7ADE;&#x4E89;&#x5C31;&#x553E;&#x624B;&#x53EF;&#x5F97;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x662F;&#x6700;&#x4F4E;&#x7A0B;&#x5EA6;&#x7684;&#x6CBB;&#x7597;&#x65B9;&#x5F0F;&#x3002;&#x4F46;&#x968F;&#x7740;&#x5BF9;&#x75DB;&#x82E6;&#x7684;&#x8BA4;&#x77E5;&#x52A0;&#x6DF1;&#xFF0C;&#x5BF9;&#x4E8E;&#x81EA;&#x6211;&#x8C03;&#x8282;&#x7684;&#x8981;&#x6C42;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x53D8;&#x5F97;&#x96BE;&#x4EE5;&#x6EE1;&#x8DB3;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x201C;&#x5403;&#x4E00;&#x987F;&#x5927;&#x9910;&#x5C31;&#x597D;&#x4E86;&#x201D;&#x8FD9;&#x79CD;&#x89E3;&#x538B;&#x65B9;&#x5F0F;&#x5BF9;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x9002;&#x7528;&#x3002;high&#x70B9;&#x592A;&#x9AD8;&#x5230;&#xFF0C;&#x9700;&#x8981;&#x53BB;&#x8E66;&#x6781;&#xFF0C;&#x5750;&#x8FC7;&#x5C71;&#x8F66;&#xFF0C;&#x542C;live&#xFF0C;&#x559D;&#x9152;&#x624D;&#x80FD;&#x597D;&#x4E00;&#x4E9B;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x5FC3;&#x91CC;&#xFF0C;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#x662F;&#x98DF;&#x7269;&#x6240;&#x65E0;&#x6CD5;&#x89E3;&#x51B3;&#x7684;&#xFF0C;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x4E5F;&#x8BB8;&#x672A;&#x6765;&#x662F;&#x4F1A;&#x597D;&#x7684;&#xFF0C;&#x4F1A;&#x6709;&#x77ED;&#x6682;&#x7684;&#x5FEB;&#x4E50;&#x7684;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#xFF0C;&#x6211;&#x4EEC;&#x81EA;&#x8EAB;&#x4E0D;&#x4F1A;&#x597D;&#x4E86;&#x3002;&#x5C31;&#x50CF;Monica&#x548C;Rachel&#x8BF4;&#x7684;&#xFF0C;&#x201C;That&apos;s food, not love.&#x201D;&#x3002;&#x4E0D;&#x8FC7;&#x8FD8;&#x597D;&#xFF0C;&#x6700;&#x4E25;&#x91CD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5D29;&#x6E83;&#x5F97;&#x4E0D;&#x6210;&#x4EBA;&#x5F62;&#xFF0C;&#x4EC0;&#x4E48;&#x4E5F;&#x5E72;&#x4E0D;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x81F3;&#x4E8E;&#x6CA1;&#x6709;&#x5BF9;&#x98DF;&#x7269;&#x4E00;&#x70B9;&#x6B32;&#x671B;&#x90FD;&#x6CA1;&#x6709;&#x3002;</p>
<p>&#x5927;&#x4E09;&#x6691;&#x5047;&#xFF0C;&#x4E5D;&#x56DB;&#x548C;&#x6211;&#x6838;&#x5BF9;&#x6291;&#x90C1;&#x75C7;&#x75C7;&#x72B6;&#xFF0C;&#x5FEB;&#x5230;&#x89C9;&#x5F97;&#x6211;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x5403;&#x836F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x201C;&#x5B8C;&#x5168;&#x4E0D;&#x60F3;&#x5403;&#x4E1C;&#x897F;&#x201D;&#x8FD9;&#x4E00;&#x6761;&#x5C31;&#x6253;&#x56DE;&#x4E86;&#x539F;&#x5F62;&#x3002;&#x770B;&#x6765;&#x6CA1;&#x6709;&#x6291;&#x90C1;&#x75C7;&#xFF0C;&#x8FD8;&#x80FD;&#x7B11;&#x7740;&#x6D3B;&#x4E0B;&#x53BB;&#x3002;&#x53EF;&#x80FD;&#xFF0C;&#x98DF;&#x7269;&#x662F;&#x6700;&#x540E;&#x7684;&#x5E95;&#x7EBF;&#x4E86;&#x5427;&#x3002;</p>
<p>&#x53C8;&#x60F3;&#x8D77;&#x5F53;&#x65F6;&#x5E26;&#x6211;&#x53BB;&#x5403;&#x5364;&#x716E;&#x7684;&#x59D1;&#x5A18;&#xFF0C;&#x6211;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x5FD8;&#x4E86;&#x5979;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x53EA;&#x8BB0;&#x5F97;&#x5979;&#x7684;&#x5FAE;&#x4FE1;&#x5934;&#x50CF;&#x662F;&#x300A;&#x8FD9;&#x4E2A;&#x6740;&#x624B;&#x4E0D;&#x592A;&#x51B7;&#x300B;&#x91CC;&#x5A1C;&#x5854;&#x8389;&#x6CE2;&#x7279;&#x66FC;&#x62FF;&#x67AA;&#x7684;&#x6837;&#x5B50;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x5C31;&#x5728;&#x60F3;&#x554A;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#xFF0C;20&#x591A;&#x5C81;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x6B7B;&#x4E86;&#xFF0C;&#x4E4B;&#x540E;&#x7684;&#x65E5;&#x5B50;&#x4E0D;&#x8FC7;&#x662F;&#x673A;&#x68B0;&#x5730;&#x91CD;&#x590D;&#x4E4B;&#x524D;&#x7684;&#x65E5;&#x5B50;&#x3002;&#x4F46;&#x5979;&#x8FD8;&#x6CA1;&#x6709;&#xFF0C;&#x5979;&#x5BF9;&#x80E1;&#x540C;&#x6709;&#x70ED;&#x60C5;&#xFF0C;&#x5BF9;&#x7F8E;&#x98DF;&#x6709;&#x70ED;&#x60C5;&#xFF0C;&#x5BF9;&#x964C;&#x751F;&#x4EBA;&#x4E5F;&#x6709;&#x70ED;&#x60C5;&#x3002;&#x771F;&#x597D;&#x3002;</p>

                    
                        
                    
                    
                        <p>
                            <a href="/2016/11/22/e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85/#post-footer" class="postShorten-excerpt_link link">
                                Comment and share
                            </a>
                        </p>
                    
                </div>
            
        </div>
        
    </article>
    
    
    <article class="postShorten postShorten--thumbnailimg-bottom" itemscope itemType="http://schema.org/BlogPosting">
        <div class="postShorten-wrap">
            
            <div class="postShorten-header">
                <h1 class="postShorten-title" itemprop="headline">
                    
                        <a class="link-unstyled" href="/2016/08/27/e6-98-8e-e5-a4-a9-e4-b8-80-e5-88-87-e5-a5-bd-e8-af-b4/">
                            明天一切好说
                        </a>
                    
                </h1>
                <div class="postShorten-meta">
    <time itemprop="datePublished" datetime="2016-08-27T13:29:32-04:00">
	
		    Aug 27, 2016
    	
    </time>
    
        <span>in </span>
        
    <a class="category-link" href="/categories/真实的生命/">真实的生命</a>


    
</div>

            </div>
            
                <div class="postShorten-content" itemprop="articleBody">
                    <script src="/assets/js/DPlayer.min.js"> </script><p>&#xA0;</p>
<p>&#xA0; &#xA0; &#xA0; &#x843D;&#x5730;&#x706F;&#x6E29;&#x548C;&#x5730;&#x4EAE;&#x7740;&#xFF0C;&#x6536;&#x62FE;&#x597D;&#x5367;&#x5BA4;&#xFF0C;&#x6446;&#x597D;&#x8863;&#x67B6;&#xFF0C;&#x53A8;&#x623F;&#x9910;&#x5177;&#x6446;&#x597D;&#xFF0C;&#x624D;&#x7EC8;&#x4E8E;&#x6709;&#x65F6;&#x95F4;&#x5750;&#x5728;&#x81EA;&#x5DF1;&#x62FC;&#x7684;&#x6C99;&#x53D1;&#x4E0A;&#x548C;&#x5BA4;&#x53CB;&#x8BB2;&#x51E0;&#x53E5;&#x8BDD;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#x6765;&#x4E86;&#x4E00;&#x5468;&#x591A;&#x4E00;&#x4E9B;&#xFF0C;&#x51E0;&#x4E4E;&#x90FD;&#x5728;&#x75B2;&#x4E8E;&#x5E94;&#x4ED8;&#x4E00;&#x4E2A;&#x5B89;&#x8EAB;&#x7ACB;&#x547D;&#x7684;&#x5730;&#x65B9;&#x3002;&#x60F3;&#x6765;&#xFF0C;&#x88AB;&#x6D77;&#x5173;&#x5173;&#x8FC7;&#x5C0F;&#x9ED1;&#x5C4B;&#xFF0C;&#x88AB;&#x623F;&#x5C4B;manager&#x543C;&#x8FC7;&#xFF0C;&#x88AB;&#x4E0D;&#x9760;&#x8C31;&#x7684;&#x7BA1;&#x7406;&#x4EBA;&#x5458;&#x653E;&#x9E3D;&#x5B50;&#xFF0C;&#x88AB;&#x8BA1;&#x5212;&#x4E2D;&#x7684;&#x5BA4;&#x53CB;&#x5751;&#x5F97;&#x63AA;&#x624B;&#x4E0D;&#x53CA;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#x521A;&#x5230;&#x5339;&#x5179;&#x5821;&#xFF0C;&#x7B2C;&#x4E09;&#x6B21;&#x8DD1;&#x5230;&#x81EA;&#x5DF1;&#x56DB;&#x6708;&#x4EFD;&#x5C31;&#x79DF;&#x4E0B;&#x6765;&#x7684;&#x516C;&#x5BD3;&#x5374;&#x8FD8;&#x662F;&#x62FF;&#x4E0D;&#x5230;&#x94A5;&#x5319;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x5728;&#x516C;&#x4EA4;&#x7AD9;&#x53F0;&#xFF0C;&#x5DEE;&#x70B9;&#x5C31;&#x54ED;&#x51FA;&#x6765;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0;&#x540E;&#x6765;&#x4E5F;&#x6CA1;&#x6709;&#x54ED;&#xFF0C;&#x5FC3;&#x91CC;&#x89C9;&#x5F97;&#x4E0D;&#x503C;&#x5F97;&#xFF0C;&#x81EA;&#x5DF1;&#x63D0;&#x524D;&#x5B9A;&#x4E86;&#x5408;&#x7EA6;&#xFF0C;&#x6253;&#x8FC7;&#x7535;&#x8BDD;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8FC7;&#x9519;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x662F;&#x6211;&#x8981;&#x54ED;&#x3002;&#x6709;&#x95EE;&#x9898;&#x5C31;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x597D;&#x4E86;&#xFF0C;&#x4E0D;&#x7ED9;&#x6211;&#x6211;&#x5C31;&#x4E00;&#x76F4;&#x6253;&#x7535;&#x8BDD;&#xFF0C;&#x4E00;&#x76F4;&#x6765;&#xFF0C;&#x8017;&#x4E0B;&#x53BB;&#x3002;&#x8FD9;&#x4E48;&#x60F3;&#x7740;&#xFF0C;&#x773C;&#x6CEA;&#x8FD8;&#x662F;&#x6253;&#x4E86;&#x4E2A;&#x8F6C;&#x3002;&#x773C;&#x524D;&#x662F;&#x6559;&#x5802;&#xFF0C;&#x5BF9;&#x9762;&#x662F;&#x94F6;&#x884C;&#xFF0C;&#x6765;&#x5F80;&#x7684;&#x8F66;&#x8F86;&#x91CC;&#x8FD8;&#x6709;&#x7279;&#x65AF;&#x62C9;&#x3002;&#x771F;&#x4E0D;&#x6562;&#x76F8;&#x4FE1;&#xFF0C;&#x8FD9;&#x91CC;&#x662F;&#x7F8E;&#x56FD;&#x554A;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0;&#x7EC8;&#x4E8E;&#x62FF;&#x5230;&#x4E86;&#x94A5;&#x5319;&#xFF0C;&#x6FC0;&#x52A8;&#x5F97;&#x53BB;&#x4E2D;&#x9910;&#x9986;&#x5403;&#x4E86;&#x4E00;&#x7897;&#x725B;&#x8089;&#x9762;&#xFF0C;&#x548C;&#x4E00;&#x8D77;&#x7684;&#x59D1;&#x5A18;&#x8BF4;&#x8D77;&#x665A;&#x4E0A;&#x60F3;&#x53BB;&#x63A5;yuki&#xFF0C;&#x5979;&#x8BF4;&#x4F60;&#x81EA;&#x5DF1;&#x90FD;&#x6CA1;&#x7167;&#x987E;&#x597D;&#xFF0C;&#x8FD8;&#x7BA1;&#x522B;&#x4EBA;&#x3002;&#x54C7;&#x5730;&#x4E00;&#x4E0B;&#xFF0C;&#x5FC3;&#x91CC;&#x611F;&#x89C9;&#x88AB;&#x523A;&#x5230;&#x4E86;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x8BB0;&#x5F97;&#x5927;&#x56DB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x820D;&#x53CB;&#x90FD;&#x4E0D;&#x5728;&#xFF0C;&#x5BBF;&#x820D;&#x9ED1;&#x4E86;&#xFF0C;&#x6211;&#x624D;&#x53D1;&#x73B0;&#x56DB;&#x5E74;&#x6211;&#x4ECE;&#x6765;&#x6CA1;&#x53BB;&#x5145;&#x8FC7;&#x4E00;&#x6B21;&#x7535;&#x3002;&#x540E;&#x6765;&#x53BB;&#x6FB3;&#x6D32;&#xFF0C;&#x5BA4;&#x53CB;&#x662F;&#x4E2A;&#x4E8B;&#x65E0;&#x5DE8;&#x7EC6;&#x90FD;&#x4F1A;&#x7167;&#x987E;&#x5468;&#x5168;&#x7684;&#x5F3A;&#x8FEB;&#x75C7;&#x59D1;&#x5A18;&#xFF0C;&#x6211;&#x51E0;&#x4E4E;&#x4E5F;&#x6CA1;&#x6709;&#x64CD;&#x8FC7;&#x4EC0;&#x4E48;&#x5FC3;&#x3002;&#x201C;&#x751F;&#x6D3B;&#x4ECE;&#x6765;&#x90FD;&#x662F;&#x4E0D;&#x5BB9;&#x6613;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x89C9;&#x5F97;&#x5BB9;&#x6613;&#xFF0C;&#x53EA;&#x662F;&#x6709;&#x4EBA;&#x66FF;&#x4F60;&#x627F;&#x62C5;&#x4E86;&#x800C;&#x5DF2;&#x3002;&#x201D;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4EE5;&#x524D;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x4ECE;&#x6765;&#x4E5F;&#x90FD;&#x662F;&#x72EC;&#x5F53;&#x4E00;&#x9762;&#x7684;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x6240;&#x4EE5;&#xFF0C;&#x5C1D;&#x8BD5;&#x5BA2;&#x6C14;&#x5730;&#x7ED9;&#x623F;&#x5C4B;&#x7BA1;&#x7406;&#x8FDE;&#x53D1;&#x90AE;&#x4EF6;&#xFF0C;&#x6709;&#x4E8B;&#x513F;&#x6CA1;&#x4E8B;&#x513F;&#x53BB;&#x697C;&#x4E0B;&#x529E;&#x516C;&#x5BA4;&#x770B;manager&#x5728;&#x4E0D;&#x5728;&#xFF0C;&#x53BB;&#x94F6;&#x884C;&#x89E3;&#x51B3;&#x8D26;&#x6237;&#x88AB;&#x51BB;&#x7ED3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4ECE;li&#x59D0;&#x59D0;&#x5BB6;&#x91CC;&#x62D6;&#x5E8A;&#x56DE;&#x5BB6;&#xFF0C;&#x627E;&#x4EBA;&#x5F00;&#x5C0F;&#x8D27;&#x8F66;&#x8FD0;&#x9001;&#x5BB6;&#x5177;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0;&#xA0;&#x65E2;&#x7136;&#x8981;&#x7ED3;&#x679C;&#xFF0C;&#x5C31;&#x8981;&#x597D;&#x597D;&#x5904;&#x7406;&#x95EE;&#x9898;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4ECA;&#x5929;&#xFF0C;manager&#x8FC5;&#x901F;&#x5E2E;&#x6211;&#x6362;&#x4E86;&#x574F;&#x6389;&#x7684;&#x95E8;&#x9501;&#xFF0C;&#x6211;&#x521A;&#x8BF4;&#x51B0;&#x7BB1;&#x574F;&#x4E86;&#x4E0B;&#x5348;&#x5C31;&#x7ED9;&#x6211;&#x6362;&#x4E86;&#x65B0;&#x7684;&#xFF0C;&#x8FD8;&#x5F00;&#x59CB;&#x548C;&#x6211;&#x5F00;&#x73A9;&#x7B11;&#xFF0C;&#x6211;&#x867D;&#x7136;&#x542C;&#x4E0D;&#x61C2;&#x4ED6;&#x8BF4;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x7B11;&#x8BDD;&#xFF0C;&#x4F46;&#x80FD;&#x611F;&#x89C9;&#x4ED6;&#x7684;&#x6001;&#x5EA6;&#x597D;&#x4E86;&#x5F88;&#x591A;&#x3002;&#x4EA4;&#x4E86;&#x5B66;&#x8D39;&#xFF0C;&#x4E5F;&#x627E;&#x5230;&#x4E86;&#x65B0;&#x5BA4;&#x53CB;&#xFF0C;&#x7EC8;&#x4E8E;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x6210;&#x578B;&#x7684;&#x7A9D;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x548C;&#x68A6;&#x7476;&#x8BF4;&#xFF0C;&#x4FE9;&#x4EBA;&#x4F4F;&#x4E5F;&#x633A;&#x597D;&#xFF0C;&#x8981;&#x4E0D;&#x662F;&#x623F;&#x79DF;&#x592A;&#x8D35;&#xFF0C;&#x771F;&#x60F3;&#x5C31;&#x8FD9;&#x4E48;&#x5F85;&#x7740;&#xFF0C;&#x6709;&#x4E2A;&#x91C7;&#x5149;&#x597D;&#x7684;&#x5927;&#x5BA2;&#x5385;&#x6211;&#x5C31;&#x662F;&#x57FA;&#x672C;&#x4E0D;&#x5728;&#x5BB6;&#x4E5F;&#x4F1A;&#x89C9;&#x5F97;&#x5F00;&#x5FC3;&#x7684;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0;&#x5979;&#x8BF4;&#xFF0C;&#x4F60;&#x60F3;&#x554A;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0;&#x7FFB;&#x767D;&#x773C;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0;&#x8FD9;&#x59D1;&#x5A18;&#x6765;&#x4E86;&#x4EE5;&#x540E;&#xFF0C;&#x4E5F;&#x6CA1;&#x5C11;&#x8D70;&#x8DEF;&#xFF0C;&#x53EF;&#x662F;&#x6709;&#x5979;&#x4E00;&#x8D77;&#xFF0C;&#x6211;&#x53CD;&#x5012;&#x6BD4;&#x4E4B;&#x524D;&#x597D;&#x8FC7;&#x4E86;&#x5F88;&#x591A;&#x3002;&#x597D;&#x50CF;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x7684;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0;&#x8FD9;&#x4E00;&#x5468;&#x6765;&#xFF0C;&#x5954;&#x6CE2;&#x6765;&#x53BB;&#x4E4B;&#x5916;&#x7684;&#x671F;&#x5F85;&#x7ADF;&#x662F;&#x5750;&#x4E0B;&#x597D;&#x597D;&#x505A;&#x9898;&#xFF0C;&#x597D;&#x597D;&#x8BFB;&#x4E66;&#xFF0C;&#x6CA1;&#x4EBA;&#x6253;&#x6270;&#x3002;&#x539F;&#x6765;&#x5B89;&#x9759;&#x4E5F;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x5962;&#x4F88;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#x60F3;&#x6765;&#xFF0C;&#x4E4B;&#x540E;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x8D1F;&#x62C5;&#x91CD;&#xFF0C;&#x538B;&#x529B;&#x5927;&#xFF0C;&#x6050;&#x6015;&#x5728;&#x6240;&#x96BE;&#x514D;&#x3002;&#x53EF;&#x662F;&#x554A;&#xFF0C;&#x65E2;&#x7136;&#x9009;&#x62E9;&#x6765;&#x5230;&#x4E86;&#x8FD9;&#x91CC;&#xFF0C;&#x4E5F;&#x8BB8;&#x5C31;&#x4E0D;&#x8BA1;&#x8F83;&#x8FD9;&#x4E9B;&#x4E86;&#x3002;</p>
<pre><code>&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &#x660E;&#x5929;&#x4E00;&#x5207;&#x597D;&#x8BF4;&#x3002;&#x665A;&#x5B89;&#x3002;
</code></pre>

                    
                        
                    
                    
                        <p>
                            <a href="/2016/08/27/e6-98-8e-e5-a4-a9-e4-b8-80-e5-88-87-e5-a5-bd-e8-af-b4/#post-footer" class="postShorten-excerpt_link link">
                                Comment and share
                            </a>
                        </p>
                    
                </div>
            
        </div>
        
    </article>
    
    
    <article class="postShorten postShorten--thumbnailimg-bottom" itemscope itemType="http://schema.org/BlogPosting">
        <div class="postShorten-wrap">
            
            <div class="postShorten-header">
                <h1 class="postShorten-title" itemprop="headline">
                    
                        <a class="link-unstyled" href="/2016/08/02/2016-08-02/">
                            2016-08-02
                        </a>
                    
                </h1>
                <div class="postShorten-meta">
    <time itemprop="datePublished" datetime="2016-08-02T23:27:22-04:00">
	
		    Aug 02, 2016
    	
    </time>
    
        <span>in </span>
        
    <a class="category-link" href="/categories/真实的生命/">真实的生命</a>


    
</div>

            </div>
            
                <div class="postShorten-content" itemprop="articleBody">
                    <script src="/assets/js/DPlayer.min.js"> </script><p>&#x4ECA;&#x5929;&#x5750;&#x5728;&#x7A97;&#x53F0;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x770B;&#x7740;&#x84DD;&#x5929;&#x767D;&#x4E91;&#x53D1;&#x4E86;&#x4F1A;&#x513F;&#x5446;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E09;&#x5929;&#x5C31;&#x8981;&#x79BB;&#x5F00;&#x4E0A;&#x6D77;&#x4E86;&#x3002;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x5199;&#x8FC7;&#x6587;&#x5B57;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x4F1A;&#x8BF4;&#xFF0C;&#x4E0A;&#x6D77;&#x554A;&#xFF0C;&#x6211;&#x771F;&#x559C;&#x6B22;&#x8FD9;&#x5EA7;&#x57CE;&#x3002;</p>
<p>&#x4E5F;&#x8BB8;&#x53BB;&#x8FC7;&#x5F88;&#x591A;&#x5730;&#x65B9;&#xFF0C;&#x4E5F;&#x8BB8;&#x5C06;&#x8981;&#x53BB;&#x5F88;&#x591A;&#x5730;&#x65B9;&#xFF0C;&#x4E5F;&#x8BB8;&#x770B;&#x8FC7;&#x5F88;&#x591A;&#x98CE;&#x666F;&#xFF0C;&#x4E5F;&#x8BB8;&#x5C06;&#x8981;&#x770B;&#x5F88;&#x591A;&#x98CE;&#x666F;&#xFF0C;&#x4F46;&#x6211;&#x4E0D;&#x4F1A;&#x5FD8;&#x8BB0;&#x5728;&#x6211;&#x8FD8;&#x5E74;&#x8F7B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0A;&#x6D77;&#x6240;&#x7ED9;&#x4E88;&#x6211;&#x7684;&#x4E00;&#x5207;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x662F;&#x8BA9;&#x6211;&#x5FC3;&#x5B89;&#x7684;&#x5730;&#x65B9;&#x3002;&#x5BF9;&#x4E00;&#x4E2A;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5730;&#x65B9;&#x4E0D;&#x4F1A;&#x5F88;&#x591A;&#x7684;&#x3002;</p>
<p>&#x60F3;&#x8D77;&#x5728;&#x6FB3;&#x6D32;&#x7684;&#x65F6;&#x5019;&#x603B;&#x4F1A;&#x770B;&#x661F;&#x7A7A;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x4F4F;&#x8FDB;&#x5927;&#x623F;&#x5B50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5750;&#x5728;&#x9633;&#x53F0;&#x4E0A;&#x770B;&#x4E86;&#x597D;&#x4E45;&#xFF0C;&#x4E5F;&#x4E0D;&#x8BF4;&#x8BDD;&#xFF0C;&#x4E5F;&#x4E0D;&#x60F3;&#x6709;&#x4EBA;&#x5728;&#x65C1;&#x8FB9;&#x3002;&#x5C31;&#x60F3;&#x8FD9;&#x4E48;&#x770B;&#x7740;&#xFF0C;&#x540E;&#x6765;&#x592A;&#x51B7;&#x4E86;&#x8FDB;&#x4E86;&#x5C4B;&#xFF0C;&#x5750;&#x5728;&#x5730;&#x6BEF;&#x4E0A;&#xFF0C;&#x8111;&#x5B50;&#x91CC;&#x8FD8;&#x662F;&#x661F;&#x7A7A;&#x3002;</p>
<p>&#x5BD2;&#x5047;&#x7684;&#x65F6;&#x5019;&#x88AB;&#x62C9;&#x53BB;Road Trip&#xFF0C;&#x4F4F;&#x8FDB;&#x4E00;&#x4E2A;&#x65C1;&#x8FB9;&#x4EC0;&#x4E48;&#x4E5F;&#x6CA1;&#x6709;&#x7684;&#x5C0F;&#x6728;&#x5C4B;&#xFF0C;&#x8EBA;&#x5728;&#x5E8A;&#x4E0A;&#x5C31;&#x80FD;&#x770B;&#x5230;&#x5929;&#x7A7A;&#x3002;&#x53EF;&#x662F;&#x6211;&#x4E00;&#x4E0A;&#x5E8A;&#x5C31;&#x7761;&#x7740;&#x4E86;&#xFF0C;&#x9192;&#x6765;&#x7684;&#x65F6;&#x5019;&#x51CC;&#x6668;&#x56DB;&#x70B9;&#xFF0C;&#x9519;&#x8FC7;&#x4E86;&#x4E09;&#x70B9;&#x4E8C;&#x5341;&#x7684;&#x53CC;&#x5B50;&#x5EA7;&#x6D41;&#x661F;&#x96E8;&#x3002;</p>
<p>&#x53EF;&#x90A3;&#x4E00;&#x523B;&#xFF0C;&#x4E00;&#x70B9;&#x4E5F;&#x4E0D;&#x89C9;&#x5F97;&#x53EF;&#x60DC;&#x3002;</p>
<p>&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5FC3;&#x91CC;&#x4E5F;&#x662F;&#x60F3;&#x7740;&#x8FD9;&#x56DB;&#x4E2A;&#x5B57;&#xFF0C;&#x6765;&#x65E5;&#x65B9;&#x957F;&#x3002;&#x661F;&#x7A7A;&#x4E00;&#x76F4;&#x5728;&#x554A;&#x3002;&#x4E0D;&#x7528;&#x6015;&#x3002;</p>
<p>&#x9AD8;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x987E;&#x8349;&#x8349;&#x7B2C;&#x4E00;&#x6B21;&#x5728;&#x672C;&#x5B50;&#x4E0A;&#x5199;&#x7ED9;&#x6211;&#x8FD9;&#x53E5;&#x8BDD;&#xFF0C;&#x6765;&#x65E5;&#x65B9;&#x957F;&#x3002;&#x7EC6;&#x7626;&#x7684;&#x5B57;&#x4F53;&#x7279;&#x522B;&#x597D;&#x770B;&#x3002;&#x4F46;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x5B57;&#x4F53;&#xFF0C;&#x5979;&#x548C;&#x6211;&#x51B7;&#x6218;&#x3001;&#x95F9;&#x77DB;&#x76FE;&#xFF0C;&#x4E00;&#x4E2A;&#x5B66;&#x671F;&#x6CA1;&#x6709;&#x8BB2;&#x8BDD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x662F;&#x7528;&#x8FD9;&#x79CD;&#x5B57;&#x4F53;&#x7ED9;&#x6211;&#x5199;&#x4E86;&#x5C0F;&#x7EB8;&#x6761;&#x6765;&#x548C;&#x597D;&#x3002;</p>
<p>&#x90A3;&#x65F6;&#x5019;&#x771F;&#x662F;&#x5E74;&#x8F7B;&#xFF0C;&#x73B0;&#x5728;&#x8C01;&#x8FD8;&#x6709;&#x7CBE;&#x529B;&#x7EA0;&#x7F20;&#x8FD9;&#x4E48;&#x4E45;&#x3002;</p>
<p>&#x53EF;&#x662F;&#x6765;&#x65E5;&#x65B9;&#x957F;&#xFF0C;&#x5230;&#x540E;&#x6765;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x6211;&#x548C;&#x6211;&#x6700;&#x597D;&#x7684;&#x670B;&#x53CB;&#x4E00;&#x5E74;&#x624D;&#x89C1;&#x4E00;&#x9762;&#xFF0C;&#x4E00;&#x9762;&#x624D;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x4E00;&#x676F;&#x5496;&#x5561;&#x6216;&#x8005;&#x4E00;&#x987F;&#x996D;&#x3002;&#x5728;&#x673A;&#x573A;&#x8FD9;&#x6837;&#x5306;&#x5FD9;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x542C;&#x4E0A;&#x53BB;&#x6765;&#x65E5;&#x65B9;&#x957F;&#x771F;&#x662F;&#x9EBB;&#x6728;&#x81EA;&#x5DF1;&#x7684;&#x8BF4;&#x8F9E;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x90A3;&#x5929;&#x6960;&#x6960;&#x548C;&#x6211;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x628A;&#x75DB;&#x82E6;&#x5F53;&#x78E8;&#x70BC;&#xFF0C;&#x628A;&#x5E73;&#x51E1;&#x5F53;&#x5E78;&#x798F;&#xFF0C;&#x5728;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x7ED9;&#x81EA;&#x5DF1;&#x627E;&#x5230;&#x501F;&#x53E3;&#xFF0C;&#x627E;&#x5230;&#x5FC3;&#x5B89;&#x7406;&#x5F97;&#x7EE7;&#x7EED;&#x6D3B;&#x4E0B;&#x53BB;&#x7684;&#x501F;&#x53E3;&#x3002;&#x6211;&#x60F3;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x65E0;&#x6CD5;&#x5206;&#x8FA8;&#x75DB;&#x82E6;&#x548C;&#x771F;&#x6B63;&#x7684;&#x6109;&#x60A6;&#xFF0C;&#x4E60;&#x60EF;&#x4E86;&#x987A;&#x5E94;&#x4E86;&#x75DB;&#x82E6;&#xFF0C;&#x53CD;&#x800C;&#x5FD8;&#x8BB0;&#x4E86;&#x5982;&#x4F55;&#x89C4;&#x907F;&#x75DB;&#x82E6;&#x3002;&#x4F46;&#x89C4;&#x907F;&#x75DB;&#x82E6;&#xFF0C;&#x5F88;&#x96BE;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#xFF0C;&#x4EBA;&#x7684;&#x60EF;&#x6027;&#x4F1A;&#x7528;&#x7ECF;&#x9A8C;&#x4EE3;&#x66FF;&#x611F;&#x77E5;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x8FD8;&#x662F;&#x522B;&#x4EBA;&#x7684;&#x3002;</p>
<p>&#x53EF;&#x6211;&#x8FD8;&#x662F;&#x8BA4;&#x4E3A;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x611F;&#x53D7;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x54EA;&#x6015;&#x627E;&#x4E0D;&#x5230;&#x8DEF;&#x3002;&#x54EA;&#x6015;&#x56DE;&#x4E0D;&#x5230;&#x539F;&#x70B9;&#x3002;&#x4E5F;&#x8981;&#x5FE0;&#x4E8E;&#x81EA;&#x6211;&#x3002;</p>
<p>&#x665A;&#x5B89;&#x3002;</p>

                    
                        
                    
                    
                        <p>
                            <a href="/2016/08/02/2016-08-02/#post-footer" class="postShorten-excerpt_link link">
                                Comment and share
                            </a>
                        </p>
                    
                </div>
            
        </div>
        
    </article>
    
    
    <article class="postShorten postShorten--thumbnailimg-bottom" itemscope itemType="http://schema.org/BlogPosting">
        <div class="postShorten-wrap">
            
            <div class="postShorten-header">
                <h1 class="postShorten-title" itemprop="headline">
                    
                        <a class="link-unstyled" href="/2016/07/21/2016-07-21/">
                            2016-07-21
                        </a>
                    
                </h1>
                <div class="postShorten-meta">
    <time itemprop="datePublished" datetime="2016-07-21T23:37:53-04:00">
	
		    Jul 21, 2016
    	
    </time>
    
        <span>in </span>
        
    <a class="category-link" href="/categories/真实的生命/">真实的生命</a>


    
</div>

            </div>
            
                <div class="postShorten-content" itemprop="articleBody">
                    <script src="/assets/js/DPlayer.min.js"> </script><p>&#x4E00;&#x3001;</p>
<pre><code>&#x6211;&#x6D3B;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5766;&#x7136;&#x7684;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;&#x5C31;&#x662F;&#xFF0C;&#x6211;&#x80FD;&#x52C7;&#x6562;&#x5730;&#x548C;&#x522B;&#x4EBA;&#x5B89;&#x5229;&#x81EA;&#x5DF1;&#x7684;&#x516C;&#x4F17;&#x53F7;&#x4E86;&#x3002;

&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x6587;&#x7AE0;&#x5E26;&#x7740;&#x60C5;&#x7EEA;&#x7684;&#x6210;&#x5206;&#x5F88;&#x591A;&#x3002;&#x800C;&#x6211;&#x7684;&#x4E60;&#x60EF;&#x662F;&#xFF0C;&#x5728;&#x73B0;&#x5B9E;&#x751F;&#x6D3B;&#x4E2D;&#x9762;&#x5BF9;&#x9762;&#x8BB2;&#x8BDD;&#x597D;&#x597D;&#x76F8;&#x5904;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x662F;&#x771F;&#x5B9E;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x865A;&#x65E0;&#x5730;&#x6BEB;&#x65E0;&#x57FA;&#x7840;&#x5730;&#x901A;&#x8FC7;&#x8868;&#x60C5;&#x548C;&#x6587;&#x5B57;&#x6765;&#x4F20;&#x8FBE;&#x5F7C;&#x6B64;&#x7684;&#x5FC3;&#x7406;&#x3002;&#x7F51;&#x7EDC;&#x66F4;&#x5E94;&#x8BE5;&#x662F;&#xFF0C;&#x8BA9;&#x4EB2;&#x5BC6;&#x5173;&#x7CFB;&#x66F4;&#x65B9;&#x4FBF;&#xFF0C;&#x4E0D;&#x8BE5;&#x662F;&#x8BA9;&#x964C;&#x751F;&#x7684;&#x4EBA;&#x53D8;&#x6210;&#x719F;&#x4EBA;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x3002;&#x5373;&#x4F7F;&#x6709;&#x53EF;&#x80FD;&#xFF0C;&#x4E5F;&#x662F;&#x8106;&#x5F31;&#x7684;&#xFF0C;&#x4E0D;&#x582A;&#x4E00;&#x51FB;&#x7684;&#x3002;

&#x540C;&#x65F6;&#xFF0C;&#x5728;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x91CC;&#xFF0C;&#x6211;&#x4E5F;&#x5F88;&#x4E0D;&#x613F;&#x8BA9;&#x522B;&#x4EBA;&#x5B8C;&#x5168;&#x770B;&#x900F;&#x6211;&#x7684;&#x5185;&#x5FC3;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x6050;&#x60E7;&#x548C;&#x4E0D;&#x77E5;&#x6240;&#x63AA;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x73B0;&#x5728;&#xFF0C;&#x6210;&#x719F;&#x5730;&#x770B;&#x6211;&#x4F9D;&#x65E7;&#x4E0D;&#x60F3;&#x8BA9;&#x522B;&#x4EBA;&#x5B8C;&#x5168;&#x770B;&#x900F;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x4E5F;&#x4E0D;&#x5FC5;&#x8981;&#x9690;&#x85CF;&#x81EA;&#x5DF1;&#x672C;&#x6765;&#x7684;&#x4E00;&#x9762;&#x3002;&#x6211;&#x786E;&#x5B9E;&#x60F3;&#x6CD5;&#x5F88;&#x591A;&#xFF0C;&#x5C0F;&#x5FC3;&#x601D;&#x5F88;&#x591A;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x8FD9;&#x4E0D;&#x4F1A;&#x8BA9;&#x4EBA;&#x56E0;&#x6B64;&#x800C;&#x653E;&#x5F03;&#x7231;&#x6211;&#x6216;&#x8005;&#x758F;&#x8FDC;&#x6211;&#xFF0C;&#x8FDC;&#x79BB;&#x6211;&#x3002;

&#x6587;&#x5B57;&#x8FD8;&#x662F;&#x8981;&#x5199;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x8981;&#x5199;&#x597D;&#xFF0C;&#x8981;&#x597D;&#x597D;&#x5199;&#xFF0C;&#x8981;&#x8BA4;&#x771F;&#x8E0F;&#x5B9E;&#x5730;&#xFF0C;&#x8A00;&#x4E4B;&#x6709;&#x7269;&#x5730;&#x5199;&#x3002;&#x751A;&#x81F3;&#x5199;&#x51FA;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x611F;&#x89C9;&#x6765;&#x3002;

&#x4E8C;&#x3001;

&#x6628;&#x5929;&#x89C1;&#x4E86;&#x5C0F;&#x5218;&#x6D77;&#xFF0C;&#x4E00;&#x4E2A;&#x9AD8;&#x9AD8;&#x7684;&#x59D1;&#x5A18;&#xFF0C;&#x505A;&#x82B1;&#x827A;&#xFF0C;&#x8BDD;&#x5520;&#xFF0C;&#x62C9;&#x62C9;&#xFF0C;&#x53EF;&#x7231;&#x3002;&#x6211;&#x4E0D;&#x662F;&#x8D34;&#x6807;&#x7B7E;&#x54E6;&#xFF0C;&#x5F53;&#x6211;&#x65E0;&#x6CD5;&#x5B8C;&#x6574;&#x5730;&#x5199;&#x51FA;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x8BB0;&#x5F55;&#x4E00;&#x4E9B;&#x7279;&#x5F81;&#x3002;&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5C31;&#x50CF;&#x6D77;&#x7EF5;&#x5438;&#x6C34;&#x4E00;&#x6837;&#xFF0C;&#x8FEB;&#x4E0D;&#x53CA;&#x5F85;&#x5730;&#x89C1;&#x8BC6;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x8BA9;&#x5404;&#x79CD;&#x4E16;&#x754C;&#x89C2;&#x51B2;&#x51FB;&#x6211;&#xFF0C;&#x8FEB;&#x4E0D;&#x53CA;&#x5F85;&#x62D3;&#x5C55;&#x81EA;&#x5DF1;&#x5BF9;&#x4E16;&#x754C;&#x8BA4;&#x77E5;&#x7684;&#x8FB9;&#x754C;&#x3002;

&#x540E;&#x6765;&#xFF0C;&#x6211;&#x6162;&#x6162;&#x953B;&#x70BC;&#x5230;&#x80FD;&#x591F;&#x81EA;&#x5DF1;&#x719F;&#x7EC3;&#x9009;&#x62E9;&#x60F3;&#x8981;&#x4EA4;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x60F3;&#x8981;&#x9760;&#x8FD1;&#x7684;&#x4EBA;&#xFF0C;&#x60F3;&#x8981;&#x8C08;&#x8BDD;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x65F6;&#x95F4;&#x6210;&#x672C;&#x5728;&#x4E00;&#x65B9;&#x9762;&#x7684;&#x51CF;&#x5C11;&#x610F;&#x5473;&#x7740;&#x6295;&#x5165;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#xFF0C;&#x5927;&#x6982;&#x66FE;&#x7ECF;&#x7684;&#x6211;&#x786E;&#x5B9E;&#x7A7A;&#x865A;&#x5427;&#x3002;

&#x5C0F;&#x5218;&#x6D77;&#x7ED9;&#x6211;&#x4E86;&#x4E00;&#x53EA;&#x82B1;&#xFF0C;&#x6211;&#x517B;&#x5728;&#x4E86;&#x6C34;&#x676F;&#x91CC;&#xFF0C;&#x53EF;&#x60DC;&#x4ECA;&#x5929;&#x56DE;&#x6765;&#x7684;&#x65F6;&#x5019;&#x5DF2;&#x7ECF;&#x6709;&#x70B9;&#x67AF;&#x840E;&#x4E86;&#x3002;&#x53EF;&#x4EE5;&#x505A;&#x6210;&#x5E72;&#x82B1;&#x3002;

&#x4E09;&#x3001;

&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#x53D8;&#x6210;&#x6D41;&#x6C34;&#x8D26;&#x535A;&#x5BA2;&#x3002;&#x6211;&#x5C31;&#x505C;&#x7B14;&#xFF0C;&#x4E0D;&#x5199;&#x4E86;&#x3002;

&#x4ECA;&#x5929;&#x7684;BGM&#x662F;&#x738B;&#x83F2;&#x300A;&#x77DC;&#x6301;&#x300B;&#x3002;Nighty
</code></pre>

                    
                        
                    
                    
                        <p>
                            <a href="/2016/07/21/2016-07-21/#post-footer" class="postShorten-excerpt_link link">
                                Comment and share
                            </a>
                        </p>
                    
                </div>
            
        </div>
        
    </article>
    
    
    <article class="postShorten postShorten--thumbnailimg-bottom" itemscope itemType="http://schema.org/BlogPosting">
        <div class="postShorten-wrap">
            
            <div class="postShorten-header">
                <h1 class="postShorten-title" itemprop="headline">
                    
                        <a class="link-unstyled" href="/2016/07/21/e5-bc-80-e7-af-87-ef-bc-9a-e6-89-93-e7-a2-8e-e6-b5-85-e8-96-84-e5-92-8c-e7-9f-ab-e6-83-85/">
                            开篇：打碎浅薄和矫情
                        </a>
                    
                </h1>
                <div class="postShorten-meta">
    <time itemprop="datePublished" datetime="2016-07-21T00:48:05-04:00">
	
		    Jul 21, 2016
    	
    </time>
    
        <span>in </span>
        
    <a class="category-link" href="/categories/真实的生命/">真实的生命</a>


    
</div>

            </div>
            
                <div class="postShorten-content" itemprop="articleBody">
                    <script src="/assets/js/DPlayer.min.js"> </script><p>&#x6240;&#x8C13;&#x5F00;&#x7BC7;&#xFF0C;&#x662F;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#x7684;&#x5F00;&#x7BC7;&#x3002;</p>
<p>&#x6211;&#x5199;&#x5B57;&#x7684;&#x5386;&#x53F2;&#x5F88;&#x957F;&#xFF0C;&#x6362;&#x4E86;&#x5F88;&#x591A;&#x5E73;&#x53F0;&#x3002;&#x5148;&#x884C;&#x603B;&#x7ED3;&#xFF0C;&#x5B57;&#x6570;&#x4E0D;&#x7B97;&#x60CA;&#x4EBA;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x7B97;&#x5C11;&#x4E86;&#x3002;</p>
<p>&#x5927;&#x81F4;&#x5982;&#x4E0B;&#xFF1A;</p>
<hr>
<p>2006- 2013&#x5E74;&#xFF1A; <a href="http://user.qzone.qq.com/576070839/main" target="_blank" rel="external">QQ&#x7A7A;&#x95F4;</a>&#xFF0C;107&#x7BC7;&#x65E5;&#x5FD7;&#xFF0C;&#x5176;&#x4E2D;100&#x7BC7;&#x5DE6;&#x53F3;&#x662F;&#x539F;&#x521B;&#xFF0C;&#x5E73;&#x5747;&#x6BCF;&#x7BC7;&#x5B57;&#x6570;&#x8FBE;&#x5230;1000&#x5B57;&#x3002;</p>
<p>2013- &#x81F3;&#x4ECA;&#xFF1A;&#x7B80;&#x4E66;&#xFF0C;58&#x7BC7;&#x6587;&#x7AE0;&#xFF08;&#x542B;&#x516C;&#x5F00;&#x548C;&#x4E0D;&#x516C;&#x5F00;&#xFF09;&#xFF0C;&#x5171;&#x8BA1;43898&#x5B57;&#x3002;</p>
<p>&#x516C;&#x4F17;&#x53F7;&#xFF1A;&#x770B;&#x4E0D;&#x89C1;&#x7684;&#x57CE;&#x5E02;&#xFF08;&#x5FAE;&#x4FE1;&#x641C;&#x7D22;&#x516C;&#x4F17;&#x53F7;&#xFF1A;alohomoracity&#xFF09;&#x4E5F;&#x5728;&#x4E0D;&#x65AD;&#x66F4;&#x65B0;&#x539F;&#x521B;&#x957F;&#x6587;+&#x77ED;&#x6587;&#x4E2D;&#x3002;</p>
<hr>
<p>&#x53EF;&#x60DC;&#xFF0C;&#x8BA4;&#x771F;&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x4E9B;&#x5730;&#x65B9;&#x8BB0;&#x5F55;&#x7684;&#x66F4;&#x591A;&#x662F;&#x7EC6;&#x5C0F;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x4E2A;&#x4EBA;&#x60C5;&#x611F;&#x503E;&#x5411;&#x5F88;&#x91CD;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#xFF0C;&#x5728;&#x8BB0;&#x5F55;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x5BF9;&#x4E8B;&#x7269;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x60C5;&#x7EEA;&#x5316;&#xFF0C;&#x5728;&#x4E0D;&#x65AD;&#x5F3A;&#x5316;&#x81EA;&#x5DF1;&#x7684;&#x611F;&#x53D7;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x6709;&#x68B3;&#x7406;&#x5E73;&#x9759;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x4F46;&#x4E5F;&#x786E;&#x5B9E;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x4F1A;&#x9020;&#x6210;&#x6211;&#x60C5;&#x611F;&#x5BFC;&#x5411;&#x7684;&#x6027;&#x683C;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x4ECE;&#x7B80;&#x4E66;&#x540E;&#x6BB5;&#x7684;&#x8BB0;&#x5F55;&#x4E2D;&#x5C24;&#x5176;&#x660E;&#x663E;&#x3002;&#x5728;Adelaide&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E16;&#x754C;&#x5F88;&#x5C0F;&#xFF0C;&#x53C8;&#x521A;&#x4ECE;&#x4E00;&#x4E2A;&#x60C5;&#x6DF1;&#x4E49;&#x91CD;&#x7684;Team&#x4E2D;&#x8131;&#x79BB;&#x51FA;&#x6765;&#xFF0C;&#x603B;&#x6CA1;&#x6CD5;&#x628A;&#x81EA;&#x8D1F;&#x3001;&#x77EB;&#x60C5;&#x5BA2;&#x89C2;&#x770B;&#x5F85;&#xFF0C;&#x52A0;&#x4E0A;Projects&#x591A;&#xFF0C;&#x4E0E;&#x8EAB;&#x8FB9;&#x7684;&#x4EBA;&#x76F8;&#x5904;&#x5173;&#x7CFB;&#x7B80;&#x5355;&#x53C8;&#x590D;&#x6742;&#xFF0C;&#x6613;&#x6012;&#x6613;&#x5D29;&#x6E83;&#xFF0C;&#x4E5F;&#x6613;&#x559C;&#x6613;&#x6EE1;&#x8DB3;&#x3002;</p>
<p>&#x4F46;&#x7531;&#x8877;&#x5730;&#xFF0C;&#x611F;&#x8C22;&#x7ECF;&#x5386;&#x8FC7;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x6BCF;&#x6B21;&#x60C5;&#x7EEA;&#x7684;&#x6765;&#x4E34;&#x6216;&#x79BB;&#x5F00;&#xFF0C;&#x90FD;&#x8BA9;&#x6211;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x591A;&#x4E86;&#x89E3;&#x4E00;&#x5206;&#x3002;</p>
<p>&#x51B7;&#x9759;&#x4E0E;&#x51B7;&#x6F20;&#x672C;&#x5C31;&#x4E0D;&#x662F;&#x6211;&#x7684;&#x4F5C;&#x98CE;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x6CE2;&#x6F9C;&#x4E0D;&#x60CA;&#x4E86;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x53EF;&#x6162;&#x6162;&#x5730;&#xFF0C;&#x5728;&#x4E0E;&#x6570;&#x636E;&#x3001;&#x4EE3;&#x7801;&#x6253;&#x4EA4;&#x9053;&#x7684;&#x65F6;&#x5149;&#x91CC;&#xFF0C;&#x5728;&#x548C;&#x7A0B;&#x5E8F;&#x5458;&#x8D8A;&#x8D70;&#x8D8A;&#x8FD1;&#xFF0C;&#x8D8A;&#x804A;&#x8D8A;&#x591A;&#x7684;&#x65F6;&#x5149;&#x91CC;&#xFF0C;&#x5728;&#x65E0;&#x6CD5;&#x4ECE;IT&#x8FD9;&#x4E2A;&#x4E00;&#x9897;&#x8D5B;&#x7279;&#x7684;&#x884C;&#x4E1A;&#x91CC;&#x8131;&#x79BB;&#x51FA;&#x6765;&#x7684;&#x65F6;&#x5149;&#x91CC;&#xFF0C;&#x60F3;&#x8981;&#x628A;&#x81EA;&#x5DF1;&#x5851;&#x9020;&#x6210;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x80FD;&#x529B;&#x5353;&#x8D8A;&#xFF0C;&#x601D;&#x7EF4;&#x654F;&#x6377;&#xFF0C;&#x5224;&#x65AD;&#x529B;&#x4E00;&#x6D41;&#x7684;&#x59D1;&#x5A18;&#x3002;&#x4E0D;&#xFF0C;&#x6211;&#x662F;&#x8BF4;&#x4EBA;&#x3002;</p>
<p>&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x7684;&#x601D;&#x7EF4;&#x91CC;&#x5E26;&#x7740;&#x6027;&#x522B;&#x7684;&#x89C2;&#x5FF5;&#xFF0C;&#x7ED9;&#x4E86;&#x81EA;&#x5DF1;&#x9000;&#x8DEF;&#x548C;&#x501F;&#x53E3;&#xFF0C;&#x540E;&#x6765;&#x53D1;&#x73B0;&#x8FD9;&#x624D;&#x662F;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x3002;&#x7537;&#x751F;&#x548C;&#x5973;&#x751F;&#x5728;&#x751F;&#x7406;&#x4E0A;&#x6784;&#x9020;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x786E;&#x5B9E;&#x4F1A;&#x5BFC;&#x81F4;&#x5148;&#x5929;&#x4F18;&#x52BF;&#x548C;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x4E25;&#x683C;&#x8BF4;&#x6765;&#xFF0C;&#x5728;&#x6CA1;&#x5230;&#x62FC;&#x5929;&#x8D4B;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x8FD9;&#x70B9;&#x5DEE;&#x5F02;&#x5E76;&#x4E0D;&#x80FD;&#x4F5C;&#x4E3A;&#x6211;&#x4EFB;&#x4F55;&#x5931;&#x8D25;&#x6216;&#x8005;&#x4E0D;&#x601D;&#x8FDB;&#x53D6;&#x7684;&#x501F;&#x53E3;&#x3002;&#x4E00;&#x70B9;&#x70B9;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x4E00;&#x4E2A;&#x5982;&#x6211;&#x822C;&#x9A84;&#x50B2;&#x7684;&#x4EBA;&#xFF0C;&#x81EA;&#x8BE9;&#x5C31;&#x662F;&#x8981;&#x517C;&#x987E;&#x903B;&#x8F91;&#x548C;&#x611F;&#x60C5;&#x7684;&#x3002;&#x4E00;&#x6837;&#x4E5F;&#x4E0D;&#x53EF;&#x4EE5;&#x653E;&#xFF0C;&#x4E00;&#x6837;&#x4E5F;&#x4E0D;&#x53EF;&#x4EE5;&#x8F93;&#x3002;</p>
<p>&#x611F;&#x8C22;Leon&#x7ED9;&#x6211;&#x5F04;&#x4E86;&#x8FD9;&#x4E2A;Wordpress&#xFF0C;&#x4E70;&#x4E86;&#x57DF;&#x540D;&#xFF0C;&#x4E4B;&#x540E;&#x6709;&#x673A;&#x4F1A;&#x60F3;&#x81EA;&#x5DF1;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;Hexo&#x3002;&#x4E4B;&#x524D;&#x6211;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x73CD;&#x60DC;&#xFF0C;&#x6CA1;&#x6709;&#x7528;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x591C;&#x6DF1;&#x4EBA;&#x9759;&#x7684;&#x665A;&#x4E0A;&#xFF0C;&#x5728;&#x6211;&#x5BB3;&#x6015;&#x4EBA;&#x751F;&#x505C;&#x6EDE;&#x4E0D;&#x524D;&#x7684;&#x665A;&#x4E0A;&#xFF0C;&#x6211;&#x8FD8;&#x4FDD;&#x7559;&#x7740;&#x76F2;&#x76EE;&#x7684;&#x4FE1;&#x5FC3;&#xFF0C;&#x671F;&#x5F85;&#x7740;&#x6211;&#x80FD;&#x5728;&#x8FD9;&#x91CC;&#x66F4;&#x597D;&#x5730;&#x8BB0;&#x5F55;&#xFF0C;&#x770B;&#x770B;&#x662F;&#x4E0D;&#x662F;&#x771F;&#x7684;&#x80FD;&#x201C;&#x6253;&#x7834;&#x6D45;&#x8584;&#x548C;&#x77EB;&#x60C5;&#x201D;&#xFF0C;&#x5982;&#x6211;&#x60F3;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x6210;&#x4E3A;&#x60F3;&#x8981;&#x6210;&#x4E3A;&#x7684;&#x4EBA;&#x3002;</p>

                    
                        
                    
                    
                        <p>
                            <a href="/2016/07/21/e5-bc-80-e7-af-87-ef-bc-9a-e6-89-93-e7-a2-8e-e6-b5-85-e8-96-84-e5-92-8c-e7-9f-ab-e6-83-85/#post-footer" class="postShorten-excerpt_link link">
                                Comment and share
                            </a>
                        </p>
                    
                </div>
            
        </div>
        
    </article>
    
    <div class="pagination-bar">
    <ul class="pagination">
        
        
        <li class="pagination-number">page 1 of 1</li>
    </ul>
</div>

</section>



                <footer id="footer" class="main-content-wrap">
    <span class="copyrights">
        Copyrights &copy; 2017 Star. All Rights Reserved.
    </span>
</footer>

            </div>
            
        </div>
        


<div id="about">
    <div id="about-card">
        <div id="about-btn-close">
            <i class="fa fa-remove"></i>
        </div>
        
            <h4 id="about-card-name">Star</h4>
        
            <div id="about-card-bio"><p>author.bio</p>
</div>
        
        
            <div id="about-card-job">
                <i class="fa fa-briefcase"></i>
                <br/>
                <p>author.job</p>

            </div>
        
        
    </div>
</div>

        <div id="algolia-search-modal" class="modal-container">
    <div class="modal">
        <div class="modal-header">
            <span class="close-button"><i class="fa fa-close"></i></span>
            <a href="https://algolia.com" target="_blank" class="searchby-algolia text-color-light link-unstyled">
                <span class="searchby-algolia-text text-color-light text-small">by</span>
                <img class="searchby-algolia-logo" src="https://www.algolia.com/static_assets/images/press/downloads/algolia-light.svg">
            </a>
            <i class="search-icon fa fa-search"></i>
            <form id="algolia-search-form">
                <input type="text" id="algolia-search-input" name="search"
                    class="form-control input--large search-input" placeholder="Search "
                    autofocus="autofocus"/>
            </form>
        </div>
        <div class="modal-body">
            <div class="no-result text-color-light text-center">no post found</div>
            <div class="results">
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/21/e5-bc-80-e7-af-87-ef-bc-9a-e6-89-93-e7-a2-8e-e6-b5-85-e8-96-84-e5-92-8c-e7-9f-ab-e6-83-85/">
                            <h3 class="media-heading">开篇：打碎浅薄和矫情</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 21, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/21/2016-07-21/">
                            <h3 class="media-heading">2016-07-21</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 21, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/26/how-to-use-markdown-as-a-starter/">
                            <h3 class="media-heading">How to use Markdown as a starter</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 26, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/27/e4-bd-bf-e7-94-a8emacs-e4-bb-8e-e6-97-a0-e6-b3-95-e5-85-a5-e9-97-a8-e5-88-b0-e6-94-be-e5-bc-83/">
                            <h3 class="media-heading">使用Emacs: 从无法入门到放弃</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 27, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/30/e6-b8-a9-e5-ba-a6/">
                            <h3 class="media-heading">温度</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 30, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/08/02/2016-08-02/">
                            <h3 class="media-heading">2016-08-02</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Aug 2, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/08/27/e6-98-8e-e5-a4-a9-e4-b8-80-e5-88-87-e5-a5-bd-e8-af-b4/">
                            <h3 class="media-heading">明天一切好说</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Aug 27, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/09/19/python-remove-e8-af-af-e5-8c-ba/">
                            <h3 class="media-heading">python remove误区</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Sep 19, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/09/23/e5-90-ac-e6-9d-8e-e5-ae-97-e7-9b-9b/">
                            <h3 class="media-heading">听李宗盛</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Sep 23, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/10/15/leetcode-172-easyfactorial-trailing-zeroes/">
                            <h3 class="media-heading">LeetCode 172.Factorial Trailing Zeroes</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Oct 15, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
            </div>
        </div>
        <div class="modal-footer">
            <p class="results-count text-medium"
                data-message-zero="no post found"
                data-message-one="1 post found"
                data-message-other="{n} posts found">
                32 posts found
            </p>
        </div>
    </div>
</div>
        
<div id="cover" style="background-image:url('/assets/images/cover.jpg');"></div>
        <!--SCRIPTS-->
<script src="/assets/js/script-rt08quwts7iav5x0cfd2ym0gb5qkd1lvrsmwrakxtkhefmaaes4ywkmnjnwf.min.js"></script>
<!--SCRIPTS END--><!-- hexo-inject:begin --><!-- hexo-inject:end -->



    </body>
</html>
