<!DOCTYPE html>
<html>
<head>
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
  
  <meta name="renderer" content="webkit">
  <meta http-equiv="X-UA-Compatible" content="IE=edge" >
  <link rel="dns-prefetch" href="http://yoursite.com">
  <title>Star</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="不要温和地走进那个良夜。@CMU">
<meta property="og:type" content="website">
<meta property="og:title" content="Star">
<meta property="og:url" content="http://yoursite.com/page/4/index.html">
<meta property="og:site_name" content="Star">
<meta property="og:description" content="不要温和地走进那个良夜。@CMU">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Star">
<meta name="twitter:description" content="不要温和地走进那个良夜。@CMU">
  
    <link rel="alternative" href="/atom.xml" title="Star" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  <link rel="stylesheet" type="text/css" href="/./main.2d7529.css">
  <style type="text/css">
  
    #container.show {
      background: linear-gradient(200deg,#a0cfe4,#e8c37e);
    }
  </style><!-- hexo-inject:begin --><!-- hexo-inject:end -->
  

  

</head>

<body>
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><div id="container" q-class="show:isCtnShow">
    <canvas id="anm-canvas" class="anm-canvas"></canvas>
    <div class="left-col" q-class="show:isShow">
      
<div class="overlay" style="background: #4d4d4d"></div>
<div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			<img src="null" class="js-avatar">
		</a>
		<hgroup>
		  <h1 class="header-author"><a href="/">Star</a></h1>
		</hgroup>
		

		<nav class="header-menu">
			<ul>
			
				<li><a href="/">主页</a></li>
	        
				<li><a href="/tags/随笔/">随笔</a></li>
	        
			</ul>
		</nav>
		<nav class="header-smart-menu">
    		
    			
    			<a q-on="click: openSlider(e, 'innerArchive')" href="javascript:void(0)">所有文章</a>
    			
            
    			
    			<a q-on="click: openSlider(e, 'friends')" href="javascript:void(0)">友链</a>
    			
            
    			
    			<a q-on="click: openSlider(e, 'aboutme')" href="javascript:void(0)">关于我</a>
    			
            
		</nav>
		<nav class="header-nav">
			<div class="social">
				
					<a class="github" target="_blank" href="#" title="github"><i class="icon-github"></i></a>
		        
					<a class="weibo" target="_blank" href="#" title="weibo"><i class="icon-weibo"></i></a>
		        
					<a class="rss" target="_blank" href="#" title="rss"><i class="icon-rss"></i></a>
		        
					<a class="zhihu" target="_blank" href="#" title="zhihu"><i class="icon-zhihu"></i></a>
		        
			</div>
		</nav>
	</header>		
</div>

    </div>
    <div class="mid-col" q-class="show:isShow,hide:isShow|isFalse">
      
<nav id="mobile-nav">
  	<div class="overlay js-overlay" style="background: #4d4d4d"></div>
	<div class="btnctn js-mobile-btnctn">
  		<div class="slider-trigger list" q-on="click: openSlider(e)"><i class="icon icon-sort"></i></div>
	</div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
				<img src="null" class="js-avatar">
			</div>
			<hgroup>
			  <h1 class="header-author js-header-author">Star</h1>
			</hgroup>
			
			
			
				
			
				
			
			
			
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="#" title="github"><i class="icon-github"></i></a>
			        
						<a class="weibo" target="_blank" href="#" title="weibo"><i class="icon-weibo"></i></a>
			        
						<a class="rss" target="_blank" href="#" title="rss"><i class="icon-rss"></i></a>
			        
						<a class="zhihu" target="_blank" href="#" title="zhihu"><i class="icon-zhihu"></i></a>
			        
				</div>
			</nav>

			<nav class="header-menu js-header-menu">
				<ul style="width: 50%">
				
				
					<li style="width: 50%"><a href="/">主页</a></li>
		        
					<li style="width: 50%"><a href="/tags/随笔/">随笔</a></li>
		        
				</ul>
			</nav>
		</header>				
	</div>
	<div class="mobile-mask" style="display:none" q-show="isShow"></div>
</nav>

      <div id="wrapper" class="body-wrap">
        <div class="menu-l">
          <div class="canvas-wrap">
            <canvas data-colors="#eaeaea" data-sectionHeight="100" data-contentId="js-content" id="myCanvas1" class="anm-canvas"></canvas>
          </div>
          <div id="js-content" class="content-ll">
            
  
    <article id="post-LeetCode-401" class="article article-type-post  article-index" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/12/29/LeetCode-401/">LeetCode 401. Binary Watch</a>
    </h1>
  

        
        <a href="/2016/12/29/LeetCode-401/" class="archive-article-date">
  	<time datetime="2016-12-29T23:05:44.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-12-29</time>
</a>
        
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <script src="/assets/js/DPlayer.min.js"> </script><p><a href="https://leetcode.com/problems/binary-watch/" target="_blank" rel="external"><strong>Question:</strong></a></p>
<p>A binary watch has 4 LEDs on the top which represent the hours (0-11), and the 6 LEDs on the bottom represent the minutes (0-59).</p>
<p>Each LED represents a zero or one, with the least significant bit on the right.
For example, the above binary watch reads &quot;3:25&quot;.</p>
<p>Given a non-negative integer n which represents the number of LEDs that are currently on, return all possible times the watch could represent.</p>
<p>Example:</p>
<pre><code>Input: n = 1
Return: [&quot;1:00&quot;, &quot;2:00&quot;, &quot;4:00&quot;, &quot;8:00&quot;, &quot;0:01&quot;, &quot;0:02&quot;, &quot;0:04&quot;, &quot;0:08&quot;, &quot;0:16&quot;, &quot;0:32&quot;]
</code></pre>
<p>Note:</p>
<ul>
<li>The order of output does not matter.</li>
<li>The hour must not contain a leading zero, for example &quot;01:00&quot; is not valid, it should be &quot;1:00&quot;.</li>
<li>The minute must be consist of two digits and may contain a leading zero, for example &quot;10:2&quot; is not valid, it should be &quot;10:02&quot;.</li>
</ul>
<p><strong>Explanation</strong></p>
<p>&#x5229;&#x7528;&#x4F4D;&#x8FD0;&#x7B97;&#x5C06;&#x72B6;&#x6001;&#x62C6;&#x5206;&#x4E3A;&#x5C0F;&#x65F6;&#x548C;&#x5206;&#x949F;&#x3002;
&#x679A;&#x4E3E;&#x5C0F;&#x65F6;h&#x548C;&#x5206;&#x949F;m&#xFF0C;&#x7136;&#x540E;&#x5224;&#x65AD;&#x4E8C;&#x8FDB;&#x5236;1&#x7684;&#x4E2A;&#x6570;&#x662F;&#x5426;&#x7B49;&#x4E8E;num</p>
<p><strong>Code</strong></p>
<p><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div></pre></td><td class="code"><pre><div class="line">class Solution(object):</div><div class="line">    def readBinaryWatch(self, num):</div><div class="line">        &quot;&quot;&quot;</div><div class="line">        :type num: int</div><div class="line">        :rtype: List[str]</div><div class="line">        &quot;&quot;&quot;</div><div class="line">        result = []</div><div class="line">        for h in range(12):</div><div class="line">            for m in range(60):</div><div class="line">                if (bin(h) + bin(m)).count(&apos;1&apos;) == num:</div><div class="line">                    result.append(&apos;%d:%02d&apos; % (h, m))</div><div class="line">        return result</div></pre></td></tr></table></figure></p>

      

      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color4">LeetCode</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color5">Easy</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color2">Python</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color2">Bit Manipulation</a>
        		</li>
      		
		</ul>
	</div>

      
	<div class="article-category tagcloud">
		<i class="icon-book icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="/categories/LeetCode/" class="article-tag-list-link color4">LeetCode</a>
        		</li>
      		
		</ul>
	</div>


      
        <p class="article-more-link">
          <a class="article-more-a" href="/2016/12/29/LeetCode-401/">展开全文 >></a>
        </p>
      

      
      <div class="clearfix"></div>
    </div>
  </div>
</article>








  
    <article id="post-e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85" class="article article-type-post  article-index" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/11/22/e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85/">天冷该吃火锅</a>
    </h1>
  

        
        <a href="/2016/11/22/e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85/" class="archive-article-date">
  	<time datetime="2016-11-22T18:18:43.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-11-22</time>
</a>
        
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <script src="/assets/js/DPlayer.min.js"> </script><p><embed src="http://www.xiami.com/widget/12753884_1773763930/singlePlayer.swf" type="application/x-shockwave-flash" width="257" height="33" wmode="transparent"></p>
<p>&#x665A;&#x4E0A;&#xFF0C;&#x7FFB;&#x5230;&#x4E00;&#x7BC7;&#x5199;&#x5317;&#x4EAC;&#x5364;&#x716E;&#x7684;&#x6587;&#x7AE0;&#x3002;15&#x5E74;&#x590F;&#x5929;&#x5728;&#x5317;&#x4EAC;&#xFF0C;&#x4E00;&#x4E2A;&#x59D1;&#x5A18;&#x5E26;&#x6211;&#x53BB;&#x4E86;&#x4E00;&#x4E2A;&#x5357;&#x57CE;&#x7684;&#x80E1;&#x540C;&#x91CC;&#x5403;&#x5364;&#x716E;&#x3002;&#x4E70;&#x5355;&#x7684;&#x4E0D;&#x662F;&#x6211;&#xFF0C;&#x9886;&#x9910;&#x7684;&#x4E5F;&#x4E0D;&#x662F;&#x6211;&#x3002;</p>
<p>&#x5728;&#x5403;&#x5B8C;&#x4E4B;&#x524D;&#x6211;&#x90FD;&#x6CA1;&#x592A;&#x641E;&#x6E05;&#x695A;&#x5230;&#x5E95;&#x5364;&#x716E;&#x91CC;&#x9762;&#x7684;&#x90A3;&#x4E9B;&#x5177;&#x4F53;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x6211;&#x5728;&#x5F53;&#x65F6;&#x5E38;&#x804A;&#x7684;&#x5FAE;&#x4FE1;&#x7FA4;&#x91CC;&#x8BF4;&#x6211;&#x5728;&#x5403;&#x5364;&#x716E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x54E5;&#x6765;&#x4E86;&#x4E00;&#x53E5;&#xFF0C;Star&#xFF0C;&#x4F60;&#x5C45;&#x7136;&#x6562;&#x5403;&#x5364;&#x716E;&#x554A;&#xFF1F;&#x5F53;&#x7136;&#x6562;&#x3002;</p>
<p>&#x6211;&#x6709;&#x4EC0;&#x4E48;&#x662F;&#x4E0D;&#x6562;&#x7684;&#x3002;&#x79D1;&#x79D1;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x88AB;&#x79D1;&#x666E;&#x5B8C;&#x5364;&#x716E;&#x7684;&#x6784;&#x6210;&#x4EE5;&#x540E;&#xFF0C;&#x6B63;&#x7AD9;&#x5728;&#x4E94;&#x9053;&#x53E3;&#x519C;&#x79D1;&#x9662;&#x7684;&#x90A3;&#x7247;&#x7A3B;&#x7530;&#x524D;&#x7684;&#x6211;&#xFF0C;&#x5DEE;&#x70B9;&#x8FDE;&#x540C;&#x521A;&#x521A;&#x5403;&#x7684;&#x5434;&#x88D5;&#x6CF0;&#x62B9;&#x8336;&#x51B0;&#x6DC7;&#x6DCB;&#x4E00;&#x8D77;&#x5410;&#x51FA;&#x6765;&#x3002;&#x6211;&#x611F;&#x53D7;&#x5230;&#x4E86;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5357;&#x65B9;&#x4EBA;&#x7684;&#x6781;&#x9650;&#x3002;
&#x73B0;&#x5728;&#x60F3;&#x60F3;&#xFF0C;&#x900F;&#x8FC7;&#x73B0;&#x8C61;&#x629B;&#x5F00;&#x5FC3;&#x7406;&#x56E0;&#x7D20;&#xFF0C;&#x6211;&#x627F;&#x8BA4;&#x90A3;&#x662F;&#x597D;&#x5403;&#x7684;&#x3002;&#x522B;&#x5FD8;&#x4E86;&#xFF0C;&#x8981;&#x914D;&#x5317;&#x51B0;&#x6D0B;&#x3002;</p>
<p>&#x5728;&#x5916;&#x9762;&#xFF0C;&#x6700;&#x8106;&#x5F31;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x662F;&#x60F3;&#x5403;&#x800C;&#x4E0D;&#x53EF;&#x5F97;&#x3002;&#x4E4B;&#x524D;&#x60F3;&#x5403;&#x80A0;&#x7C89;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E50;&#x6587;&#x5E26;&#x6211;&#x53BB;&#x4E86;&#x5339;&#x6751;&#x552F;&#x4E00;&#x4E00;&#x5BB6;&#x7684;&#x65E9;&#x8336;&#x5E97;&#xFF0C;&#x53EF;&#x60DC;&#x4E0D;&#x597D;&#x5403;&#x3002;&#x4EE5;&#x524D;&#x5728;&#x6FB3;&#x6D32;&#xFF0C;&#x5E7F;&#x4E1C;&#x4EBA;&#x5230;&#x5904;&#x90FD;&#x6709;&#xFF0C;&#x5728;&#x5C0F;&#x5929;&#x4F7F;&#x548C;&#x56E7;&#x56E7;&#x4E24;&#x4E2A;&#x6F6E;&#x6C55;&#x4EBA;&#x7684;&#x5E26;&#x52A8;&#x4E0B;&#xFF0C;&#x6211;&#x6DF1;&#x6DF1;&#x7231;&#x4E0A;&#x4E86;&#x65E9;&#x8336;&#x3002;&#x867E;&#x997A;&#x7687;&#x8981;&#x6709;&#x6C41;&#x513F;&#x624D;&#x597D;&#x5403;&#xFF0C;&#x871C;&#x6C41;&#x6392;&#x9AA8;&#x8981;&#x719F;&#x900F;&#xFF0C;&#x51E4;&#x722A;&#x8981;&#x7C89;&#x70C2;&#x4E14;&#x5165;&#x5473;&#x3002;&#x5403;&#x5F97;&#x4E0B;&#x5462;&#xFF0C;&#x53EF;&#x4EE5;&#x6765;&#x4E00;&#x4E2A;&#x69B4;&#x83B2;&#x9165;&#xFF0C;&#x53C9;&#x70E7;&#x5305;&#x3002;&#x4E3B;&#x98DF;&#x5F53;&#x7136;&#x662F;&#x5E72;&#x7092;&#x725B;&#x6CB3;&#x6216;&#x8005;&#x9C9C;&#x867E;&#x4E91;&#x541E;&#x9762;&#x5566;&#x3002;&#x53EF;&#x662F;&#x8FD9;&#x91CC;&#x8FDE;&#x4E00;&#x5BB6;&#x50CF;&#x6837;&#x7684;&#x65E9;&#x8336;&#x5E97;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x548C;&#x5C0F;&#x5929;&#x4F7F;&#x4E00;&#x8D77;&#x611F;&#x5230;&#x5FE7;&#x4F24;&#x3002;</p>
<p>&#x6700;&#x8FD1;&#x5929;&#x51B7;&#xFF0C;&#x96EA;&#x5FFD;&#x7136;&#x4E0B;&#x8D77;&#x6765;&#xFF0C;&#x98CE;&#x5C31;&#x5728;&#x6211;&#x5C4B;&#x5B50;&#x7684;&#x5916;&#x9762;&#x547C;&#x547C;&#x5730;&#x522E;&#xFF0C;&#x6709;&#x670B;&#x53CB;&#x6765;&#x5BB6;&#x91CC;&#x5403;&#x706B;&#x9505;&#xFF0C;&#x7A97;&#x5916;&#x96EA;&#x82B1;&#x659C;&#x7740;&#x98D8;&#xFF0C;&#x5C4B;&#x91CC;&#x5374;&#x70ED;&#x6C14;&#x817E;&#x817E;&#x7684;&#x3002;&#x68A6;&#x7476;&#x57CB;&#x5934;&#x5BFB;&#x627E;&#x5979;&#x7684;&#x5E74;&#x7CD5;&#x3002;&#x4E50;&#x4E50;&#x76F4;&#x547C;&#x592A;&#x5E78;&#x798F;&#x4E86;&#x3002;&#x723D;&#x723D;&#x5403;&#x5F97;&#x5FD8;&#x4E86;&#x5979;&#x521A;&#x521A;&#x600E;&#x4E48;&#x4E5F;&#x4FEE;&#x4E0D;&#x597D;&#x7684;bug&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x523B;&#xFF0C;&#x6EE1;&#x8DB3;&#x53D8;&#x5F97;&#x5F88;&#x771F;&#x5B9E;&#x3002;&#x6EE1;&#x8DB3;&#x7684;&#xFF0C;&#x662F;&#x4E00;&#x76D2;&#x725B;&#x8089;&#xFF0C;&#x4E00;&#x76D8;&#x6D77;&#x5E26;&#x7ED3;&#xFF0C;&#x4E00;&#x5757;&#x8C46;&#x8150;&#x76AE;&#xFF0C;&#x4E00;&#x888B;&#x9C7C;&#x4E38;&#x5C31;&#x80FD;&#x89E3;&#x51B3;&#x7684;&#x6B32;&#x671B;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x5728;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#xFF0C;&#x5BF9;&#x98DF;&#x7269;&#x7684;&#x6B32;&#x671B;&#x53CD;&#x6620;&#x7740;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x7CBE;&#x795E;&#x72B6;&#x6001;&#x3002;&#x7279;&#x522B;&#x7FA1;&#x6155;&#x8FD8;&#x80FD;&#x5BF9;&#x98DF;&#x7269;&#x6000;&#x62B1;100%&#x671F;&#x5F85;&#x7684;&#x4EBA;&#x3002;&#x90A3;&#x4E00;&#x5B9A;&#x662F;&#x70ED;&#x7231;&#x751F;&#x6D3B;&#x7684;&#x4EBA;&#x3002;&#x50CF;&#x6211;&#xFF0C;&#x53EA;&#x6709;&#x60F3;&#x505A;&#x83DC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624D;&#x4F1A;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x662F;&#x5BF9;&#x751F;&#x6D3B;&#x62B1;&#x6709;&#x61A7;&#x61AC;&#x7684;&#x3002;</p>
<p>&#x72B6;&#x6001;&#x975E;&#x5E38;&#x5DEE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x548C;&#x8349;&#x8349;&#x8BA8;&#x8BBA;&#x8FC7;&#xFF0C;&#x5F53;&#x7ECF;&#x5386;&#x7740;&#x65E0;&#x6CD5;&#x81EA;&#x6108;&#x7684;&#x75DB;&#x82E6;&#xFF0C;&#x98DF;&#x7269;&#x8FD9;&#x79CD;&#x65E0;&#x95E8;&#x69DB;&#x3001;&#x4E0D;&#x9700;&#x8981;&#x9AD8;&#x96BE;&#x5EA6;&#x7ADE;&#x4E89;&#x5C31;&#x553E;&#x624B;&#x53EF;&#x5F97;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x662F;&#x6700;&#x4F4E;&#x7A0B;&#x5EA6;&#x7684;&#x6CBB;&#x7597;&#x65B9;&#x5F0F;&#x3002;&#x4F46;&#x968F;&#x7740;&#x5BF9;&#x75DB;&#x82E6;&#x7684;&#x8BA4;&#x77E5;&#x52A0;&#x6DF1;&#xFF0C;&#x5BF9;&#x4E8E;&#x81EA;&#x6211;&#x8C03;&#x8282;&#x7684;&#x8981;&#x6C42;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x53D8;&#x5F97;&#x96BE;&#x4EE5;&#x6EE1;&#x8DB3;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x201C;&#x5403;&#x4E00;&#x987F;&#x5927;&#x9910;&#x5C31;&#x597D;&#x4E86;&#x201D;&#x8FD9;&#x79CD;&#x89E3;&#x538B;&#x65B9;&#x5F0F;&#x5BF9;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x9002;&#x7528;&#x3002;high&#x70B9;&#x592A;&#x9AD8;&#x5230;&#xFF0C;&#x9700;&#x8981;&#x53BB;&#x8E66;&#x6781;&#xFF0C;&#x5750;&#x8FC7;&#x5C71;&#x8F66;&#xFF0C;&#x542C;live&#xFF0C;&#x559D;&#x9152;&#x624D;&#x80FD;&#x597D;&#x4E00;&#x4E9B;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x5FC3;&#x91CC;&#xFF0C;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#x662F;&#x98DF;&#x7269;&#x6240;&#x65E0;&#x6CD5;&#x89E3;&#x51B3;&#x7684;&#xFF0C;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x4E5F;&#x8BB8;&#x672A;&#x6765;&#x662F;&#x4F1A;&#x597D;&#x7684;&#xFF0C;&#x4F1A;&#x6709;&#x77ED;&#x6682;&#x7684;&#x5FEB;&#x4E50;&#x7684;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#xFF0C;&#x6211;&#x4EEC;&#x81EA;&#x8EAB;&#x4E0D;&#x4F1A;&#x597D;&#x4E86;&#x3002;&#x5C31;&#x50CF;Monica&#x548C;Rachel&#x8BF4;&#x7684;&#xFF0C;&#x201C;That&apos;s food, not love.&#x201D;&#x3002;&#x4E0D;&#x8FC7;&#x8FD8;&#x597D;&#xFF0C;&#x6700;&#x4E25;&#x91CD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5D29;&#x6E83;&#x5F97;&#x4E0D;&#x6210;&#x4EBA;&#x5F62;&#xFF0C;&#x4EC0;&#x4E48;&#x4E5F;&#x5E72;&#x4E0D;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x81F3;&#x4E8E;&#x6CA1;&#x6709;&#x5BF9;&#x98DF;&#x7269;&#x4E00;&#x70B9;&#x6B32;&#x671B;&#x90FD;&#x6CA1;&#x6709;&#x3002;</p>
<p>&#x5927;&#x4E09;&#x6691;&#x5047;&#xFF0C;&#x4E5D;&#x56DB;&#x548C;&#x6211;&#x6838;&#x5BF9;&#x6291;&#x90C1;&#x75C7;&#x75C7;&#x72B6;&#xFF0C;&#x5FEB;&#x5230;&#x89C9;&#x5F97;&#x6211;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x5403;&#x836F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x201C;&#x5B8C;&#x5168;&#x4E0D;&#x60F3;&#x5403;&#x4E1C;&#x897F;&#x201D;&#x8FD9;&#x4E00;&#x6761;&#x5C31;&#x6253;&#x56DE;&#x4E86;&#x539F;&#x5F62;&#x3002;&#x770B;&#x6765;&#x6CA1;&#x6709;&#x6291;&#x90C1;&#x75C7;&#xFF0C;&#x8FD8;&#x80FD;&#x7B11;&#x7740;&#x6D3B;&#x4E0B;&#x53BB;&#x3002;&#x53EF;&#x80FD;&#xFF0C;&#x98DF;&#x7269;&#x662F;&#x6700;&#x540E;&#x7684;&#x5E95;&#x7EBF;&#x4E86;&#x5427;&#x3002;</p>
<p>&#x53C8;&#x60F3;&#x8D77;&#x5F53;&#x65F6;&#x5E26;&#x6211;&#x53BB;&#x5403;&#x5364;&#x716E;&#x7684;&#x59D1;&#x5A18;&#xFF0C;&#x6211;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x5FD8;&#x4E86;&#x5979;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x53EA;&#x8BB0;&#x5F97;&#x5979;&#x7684;&#x5FAE;&#x4FE1;&#x5934;&#x50CF;&#x662F;&#x300A;&#x8FD9;&#x4E2A;&#x6740;&#x624B;&#x4E0D;&#x592A;&#x51B7;&#x300B;&#x91CC;&#x5A1C;&#x5854;&#x8389;&#x6CE2;&#x7279;&#x66FC;&#x62FF;&#x67AA;&#x7684;&#x6837;&#x5B50;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x5C31;&#x5728;&#x60F3;&#x554A;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#xFF0C;20&#x591A;&#x5C81;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x6B7B;&#x4E86;&#xFF0C;&#x4E4B;&#x540E;&#x7684;&#x65E5;&#x5B50;&#x4E0D;&#x8FC7;&#x662F;&#x673A;&#x68B0;&#x5730;&#x91CD;&#x590D;&#x4E4B;&#x524D;&#x7684;&#x65E5;&#x5B50;&#x3002;&#x4F46;&#x5979;&#x8FD8;&#x6CA1;&#x6709;&#xFF0C;&#x5979;&#x5BF9;&#x80E1;&#x540C;&#x6709;&#x70ED;&#x60C5;&#xFF0C;&#x5BF9;&#x7F8E;&#x98DF;&#x6709;&#x70ED;&#x60C5;&#xFF0C;&#x5BF9;&#x964C;&#x751F;&#x4EBA;&#x4E5F;&#x6709;&#x70ED;&#x60C5;&#x3002;&#x771F;&#x597D;&#x3002;</p>

      

      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color3">食物</a>
        		</li>
      		
		</ul>
	</div>

      
	<div class="article-category tagcloud">
		<i class="icon-book icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="/categories/真实的生命/" class="article-tag-list-link color1">真实的生命</a>
        		</li>
      		
		</ul>
	</div>


      
        <p class="article-more-link">
          <a class="article-more-a" href="/2016/11/22/e5-a4-a9-e5-86-b7-e8-af-a5-e5-90-83-e7-81-ab-e9-94-85/">展开全文 >></a>
        </p>
      

      
      <div class="clearfix"></div>
    </div>
  </div>
</article>








  
    <article id="post-java-e4-b8-ad-e7-9a-84-e6-af-94-e8-be-83" class="article article-type-post  article-index" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/11/13/java-e4-b8-ad-e7-9a-84-e6-af-94-e8-be-83/">Java中的比较</a>
    </h1>
  

        
        <a href="/2016/11/13/java-e4-b8-ad-e7-9a-84-e6-af-94-e8-be-83/" class="archive-article-date">
  	<time datetime="2016-11-13T10:26:48.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-11-13</time>
</a>
        
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <script src="/assets/js/DPlayer.min.js"> </script><h3 id="equals-he-compareto">equals, == &#x548C;compareTo <a href="#equals-he-compareto" class="header-anchor">#</a></h3>
<ul>
<li>== &#x64CD;&#x4F5C;&#x7B26;&#x5E76;&#x4E0D;&#x6D89;&#x53CA;&#x5BF9;&#x8C61;&#x5185;&#x5BB9;&#x7684;&#x6BD4;&#x8F83;&#x3002;</li>
<li>equals &#x6BD4;&#x8F83;&#x7684;&#x662F;reference&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5F15;&#x7528;&#x5185;&#x5BB9;</li>
<li>compareTo():
&#x5728;&#x57FA;&#x672C;&#x6570;&#x636E;&#x4E2D;&#xFF0C;compareTo()&#x662F;&#x6BD4;&#x8F83;&#x4E24;&#x4E2A;Character &#x5BF9;&#x8C61;&#xFF1B;
&#x5728; Boolean&#x4E2D;&#xFF0C;&#x662F;&#x7528;boolean&#x7684;&#x5B9E;&#x4F8B;&#x4E8E;&#x5176;&#x5B83;&#x5B9E;&#x4F8B;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF1B;
&#x5728;String &#x4E2D;&#xFF0C;&#x5219;&#x662F;&#x6309;&#x7167;&#x5B57;&#x5178;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x8FD4;&#x56DE;&#x7684;&#x503C;&#x662F;&#x4E00;&#x4E2A;int &#x578B;&#x3002;</li>
</ul>
<p>&lt;pre class=&quot;editor-colors lang-text&quot;&gt;&lt;div class=&quot;line&quot;&gt;&lt;span class=&quot;text plain&quot;&gt;&lt;span&gt;&#xA0;&lt;/span&gt;&lt;span class=&quot;meta paragraph text&quot;&gt;&lt;span&gt;String&#xA0;a&#xA0;=&#xA0;&quot;abc&quot;;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/div&gt;&lt;div class=&quot;line&quot;&gt;&lt;span class=&quot;text plain&quot;&gt;&lt;span class=&quot;meta paragraph text&quot;&gt;&lt;span&gt;&#xA0;String&#xA0;b&#xA0;=&#xA0;&quot;abc&quot;;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/div&gt;&lt;/pre&gt;</p>
<pre><code>a == b: **true**
</code></pre>
<p>a.equals(b): <strong>true</strong></p>
<p>a.compareTo(b): ** 0**</p>
<p>&lt;pre class=&quot;editor-colors lang-text&quot;&gt;&lt;div class=&quot;line&quot;&gt;&lt;span class=&quot;text plain&quot;&gt;&lt;span&gt;&#xA0;&lt;/span&gt;&lt;span class=&quot;meta paragraph text&quot;&gt;&lt;span&gt;String&#xA0;a&#xA0;=&#xA0;new&#xA0;String(&quot;abc&quot;);&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/div&gt;&lt;div class=&quot;line&quot;&gt;&lt;span class=&quot;text plain&quot;&gt;&lt;span class=&quot;meta paragraph text&quot;&gt;&lt;span&gt;&#xA0;String&#xA0;b&#xA0;=&#xA0;new&#xA0;String(&quot;abc&quot;);&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/div&gt;&lt;/pre&gt;</p>
<pre><code> a == b: **false**
</code></pre>
<p>&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x5BF9;&#x4E8E;&#x5BF9;&#x8C61;&#x7684;&#x6BD4;&#x8F83;&#x662F;&#x5BF9;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x7684;&#x6BD4;&#x8F83;&#x3002;a&#x548C;b&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x4E0D;&#x540C;&#xFF0C;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x4E0D;&#x540C;</p>
<p>a.equals(b): <strong>true</strong></p>
<p>a.compareTo(b): ** 0**</p>
<ul>
<li>&#x5728;&#x7EE7;&#x627F;&#x4E86;Comparabale&#x63A5;&#x53E3;&#x7684;&#x7C7B;&#x4E2D;&#xFF0C;compareTo&#xFF08;&#xFF09;&#x7684;&#x5E94;&#x8BE5;&#x4E0E;euqals&#xFF08;&#xFF09;&#x4E00;&#x81F4;&#xFF0C;&#x6BD4;&#x5982; x.equals(y) == true, &#x5219;
x.compareTo(y) == 0</li>
</ul>
<h3 id="guan-yu-equals-he-hashcode">&#x5173;&#x4E8E;equals&#x548C;hashcode <a href="#guan-yu-equals-he-hashcode" class="header-anchor">#</a></h3>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;equals&#x867D;&#x7136;&#x8BF4;&#x662F;&#x8868;&#x9762;&#x6BD4;&#x8F83;&#x662F;&#x5426;&#x4E00;&#x81F4;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x7684;&#x539F;&#x7406;&#x662F;&#x4E8E;hashcode&#xFF08;&#xFF09;&#x65B9;&#x6CD5;&#x6709;&#x5173;&#x7684;&#x3002;
&#x6BD4;&#x5982;&#x4E0A;&#x4F8B;&#x4E2D;&#x7684;String&#x7684;&#x6BD4;&#x8F83;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;String&#x91CD;&#x5199;&#x4E86;hashcode&#xFF08;&#xFF09;&#x548C;equals&#xFF08;&#xFF09;
&#x65B9;&#x6CD5;&#x3002;</p>
<ul>
<li>
<p>&#x5982;&#x679C;x.equals(y)&#x8FD4;&#x56DE;&#x201C;true&#x201D;&#xFF0C;&#x90A3;&#x4E48;x&#x548C;y&#x7684;hashCode()&#x5FC5;&#x987B;&#x76F8;&#x7B49;&#x3002;</p>
</li>
<li>
<p>&#x5982;&#x679C;x.equals(y)&#x8FD4;&#x56DE;&#x201C;false&#x201D;&#xFF0C;&#x90A3;&#x4E48;x&#x548C;y&#x7684;hashCode()&#x6709;&#x53EF;&#x80FD;&#x76F8;&#x7B49;&#xFF0C;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x4E0D;&#x7B49;&#x3002;</p>
</li>
<li>
<p>&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;x.equals(null)&#xFF0C;&#x6C38;&#x8FDC;&#x8FD4;&#x56DE;&#x662F;&#x201C;false&#x201D;&#xFF1B;x.equals(&#x548C;x&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x8C61;)&#x6C38;&#x8FDC;&#x8FD4;&#x56DE;&#x662F;&#x201C;false&#x201D;&#x3002;</p>
</li>
</ul>

      

      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color5">Java</a>
        		</li>
      		
		</ul>
	</div>

      
	<div class="article-category tagcloud">
		<i class="icon-book icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="/categories/DataStructure/" class="article-tag-list-link color5">Data Structure</a>
        		</li>
      		
		</ul>
	</div>


      
        <p class="article-more-link">
          <a class="article-more-a" href="/2016/11/13/java-e4-b8-ad-e7-9a-84-e6-af-94-e8-be-83/">展开全文 >></a>
        </p>
      

      
      <div class="clearfix"></div>
    </div>
  </div>
</article>








  
    <article id="post-machine-learning-e5-a4-8d-e4-b9-a0-ef-bc-88-e5-9b-9b-ef-bc-89-ef-bc-9a-e6-a6-82-e5-bf-b5-e5-ad-a6-e4-b9-a0" class="article article-type-post  article-index" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/10/19/machine-learning-e5-a4-8d-e4-b9-a0-ef-bc-88-e5-9b-9b-ef-bc-89-ef-bc-9a-e6-a6-82-e5-bf-b5-e5-ad-a6-e4-b9-a0/">Machine Learning 复习（四）：概念学习</a>
    </h1>
  

        
        <a href="/2016/10/19/machine-learning-e5-a4-8d-e4-b9-a0-ef-bc-88-e5-9b-9b-ef-bc-89-ef-bc-9a-e6-a6-82-e5-bf-b5-e5-ad-a6-e4-b9-a0/" class="archive-article-date">
  	<time datetime="2016-10-19T11:35:39.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-10-19</time>
</a>
        
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <script src="/assets/js/DPlayer.min.js"> </script><h3 id="gai-nian-xue-xi-concept-learning">&#x6982;&#x5FF5;&#x5B66;&#x4E60;&#xFF08;Concept Learning&#xFF09; <a href="#gai-nian-xue-xi-concept-learning" class="header-anchor">#</a></h3>
<p>&#x6982;&#x5FF5;&#x5B66;&#x4E60;&#x662F;&#x6307;&#x4ECE;&#x67D0;&#x4E2A;&#x5E03;&#x5C14;&#x51FD;&#x6570;&#x7684;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x8BAD;&#x7EC3;&#x4E2D;&#x63A8;&#x65AD;&#x51FA;&#x8BE5;&#x5E03;&#x5C14;&#x51FD;&#x6570;&#x3002;</p>
<h5 id="li-zi">&#x4F8B;&#x5B50; <a href="#li-zi" class="header-anchor">#</a></h5>
<p>&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x6982;&#x5FF5;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7ECF;&#x5178;&#x6559;&#x6750;&#x300A;Machine learning&#x300B;&#xFF08;Tom Mitchell&#x8457;&#xFF09;&#x4E2D;&#x7684;&#x7ECF;&#x5178;&#x4F8B;&#x5B50;&#x6765;&#x89E3;&#x91CA;&#xFF1A;
<img src="http://i.imgur.com/0SnpShX.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5C5E;&#x6027;EnjoySport&#x8868;&#x793A;&#x6700;&#x7EC8;&#x662F;&#x5426;&#x8FD0;&#x52A8;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x76EE;&#x6807;&#x662F;&#x6839;&#x636E;sky&#xFF0C;humidity&#x7B49;&#x7684;&#x5C5E;&#x6027;&#x6765;&#x9884;&#x6D4B;&#x51FA;EnjoySport&#x7684;&#x503C;&#x3002;</p>
<ul>
<li>
<p>&#x5C5E;&#x6027;&#x7684;&#x53D6;&#x503C;&#x53EF;&#x4EE5;&#x4E3A;&#xFF1A;</p>
<pre><code>*   &#xFF1F;&#xFF1A;&#x8868;&#x793A;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x4EFB;&#x610F;&#x503C;
</code></pre>
<ul>
<li>&#x660E;&#x786E;&#x6307;&#x5B9A;&#x5C5E;&#x6027;&#x503C;&#xFF08;&#x5982;warm&#xFF09;</li>
<li>&#x4E0D;&#x5141;&#x8BB8;&#x4EFB;&#x4F55;&#x503C;&#xFF1A;<img src="http://i.imgur.com/Sy3EXiV.png" alt=""></li>
</ul>
</li>
</ul>
<p>&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;EnjoySport&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#xFF1A;</p>
<ul>
<li>
<p>&#x5DF2;&#x77E5;&#xFF1A;</p>
<ul>
<li>
<p>&#x5B9E;&#x4F8B;&#x96C6; X&#xFF1A;&#x53EF;&#x80FD;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x6BCF;&#x4E2A;&#x65E5;&#x5B50;&#x90FD;&#x6709;&#x5982;&#x4E0B;&#x5C5E;&#x6027;&#x63CF;&#x8FF0;&#xFF1A;</p>
<pre><code>    *   Sky
</code></pre>
<ul>
<li>Temp</li>
<li>Humid</li>
<li>Wind</li>
<li>Water</li>
<li>Forecast</li>
</ul>
</li>
<li>
<p>&#x5047;&#x8BBE;&#x96C6;&#xFF1A; H&#x3002;&#x6BCF;&#x4E2A;&#x5047;&#x8BBE;&#x96C6;&#x90FD;&#x6709;6&#x4E2A;&#x5C5E;&#x6027;&#x7684;&#x4EFB;&#x610F;&#x53D6;&#x503C;&#x3002;</p>
</li>
<li>
<p>&#x76EE;&#x6807;&#x6982;&#x5FF5;c&#xFF1A;EnjoySport&#xFF1A; <img src="http://i.imgur.com/uGkb5OB.png" alt=""></p>
</li>
<li>
<p>&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B; D&#xFF1A; +/-&#x7684;&#x5173;&#x4E8E;&#x76EE;&#x6807;&#x6982;&#x5FF5;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;
<img src="http://i.imgur.com/nOw2ffI.png" alt=""></p>
</li>
<li>
<p>&#x5F52;&#x7EB3;&#x5B66;&#x4E60;&#x5047;&#x8BBE;&#xFF1A; &#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5047;&#x8BBE;&#x80FD;&#x591F;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x6837;&#x672C;&#x4E2D;&#x5F88;&#x597D;&#x5730;&#x903C;&#x8FD1;&#x76EE;&#x6807;&#x51FD;&#x6570;&#xFF0C;&#x5C31;&#x80FD;&#x5728;&#x672A;&#x89C1;&#x5B9E;&#x4F8B;&#x4E2D;&#x5F88;&#x597D;&#x5730;&#x903C;&#x8FD1;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x3002;
<img src="http://i.imgur.com/vDaItGC.png" alt=""></p>
</li>
<li>
<p>Find-S &#x7B97;&#x6CD5;&#xFF1A;</p>
</li>
<li>
<p>&#x521D;&#x59CB;&#x5316;H&#x5230;&#x6700;&#x7279;&#x522B;&#x7684;&#x90A3;&#x4E2A;&#x5047;&#x8BBE;</p>
</li>
<li>
<p>&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;X&#x4E2D;&#x7684;&#x7EA6;&#x675F;ai&#xFF1A;</p>
<pre><code>    *   &#x5982;&#x679C;ai&#x5DF2;&#x7ECF;&#x7B26;&#x5408;&#x5047;&#x8BBE;&#xFF0C;&#x4EC0;&#x4E48;&#x4E5F;&#x4E0D;&#x505A;&#x3002;
</code></pre>
<ul>
<li>
<p>&#x5426;&#x5219;&#xFF0C;&#x7528;&#x4E00;&#x4E2A;&#x66F4;&#x52A0;general&#x7684;&#x7EA6;&#x675F;&#x6765;&#x4EE3;&#x66FF;H&#x4E2D;&#x7684;ai</p>
</li>
<li>
<p>&#x8F93;&#x51FA;&#x6700;&#x7EC8;&#x7684;&#x5047;&#x8BBE; H
<img src="http://i.imgur.com/hMNrVw1.png" alt=""></p>
</li>
</ul>
</li>
<li>
<p>Find-S &#x7B97;&#x6CD5;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x6CA1;&#x6709;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<pre><code>*   &#x96BE;&#x4EE5;&#x5224;&#x65AD;&#x662F;&#x5426;&#x5BF9;&#x6982;&#x5FF5;&#x8FDB;&#x884C;&#x4E86;&#x5B66;&#x4E60;
</code></pre>
<ul>
<li>
<p>&#x662F;&#x5426;&#x80FD;&#x5904;&#x7406;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF1A;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#xFF0C;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x5E38;&#x5E38;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x3002;&#x8FD9;&#x79CD;&#x4E0D;&#x4E00;&#x81F4;&#x53EF;&#x80FD;&#x4F1A;&#x4E25;&#x91CD;&#x7834;&#x574F;Find-S&#x7B97;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;Find-S&#x7B97;&#x6CD5;&#x5FFD;&#x7565;&#x4E86;&#x6240;&#x6709;&#x7684;&#x53CD;&#x4F8B;&#x3002;&#x6211;&#x4EEC;&#x671F;&#x5F85;&#x7684;&#x7B97;&#x6CD5;&#x81F3;&#x5C11;&#x8981;&#x80FD;&#x68C0;&#x6D4B;&#x51FA;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5E76;&#x80FD;&#x5BB9;&#x5FCD;&#x8FD9;&#x6837;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>
</li>
<li>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7528;&#x7279;&#x6B8A;&#x5047;&#x8BBE;&#xFF1F;&#x5982;&#x679C;&#x6709;&#x591A;&#x4E2A;&#xFF0C;&#x6B64;&#x7B97;&#x6CD5;&#x53EA;&#x80FD;&#x627E;&#x5230;&#x6700;&#x7279;&#x6B8A;&#x7684;&#x90A3;&#x4E2A;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4E0D;&#x7528;&#x6700;&#x4E00;&#x822C;&#x7684;&#x5047;&#x8BBE;&#x5462;&#xFF0C;&#x6216;&#x8005;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x5047;&#x8BBE;&#x3002;</p>
</li>
<li>
<p>&#x5982;&#x679C;&#x6709;&#x591A;&#x4E2A;&#x6781;&#x5927;&#x7279;&#x6B8A;&#x5047;&#x8BBE;&#xFF1F;&#x5728;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x5047;&#x8BBE;&#x7A7A;&#x95F4;&#xFF08;&#x540E;&#x9762;&#x4F1A;&#x8BA8;&#x8BBA;&#x5230;&#xFF09;&#x4E2D;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#x6781;&#x5927;&#x7279;&#x6B8A;&#x5047;&#x8BBE;&#x3002;</p>
</li>
<li>
<p>&#x53D8;&#x5F62;&#x7A7A;&#x95F4;&#xFF08;Version Spaces):
&#x6240;&#x6709;&#x548C;&#x6570;&#x636E;&#x96C6;&#x4EE5;&#x53CA;&#x5047;&#x8BBE;&#x8868;&#x793A;&#x5BF9;&#x5E94;&#x7684;&#x5047;&#x8BBE;&#x7684;&#x96C6;&#x5408;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5728;Find-S&#x4E2D;&#xFF0C;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x7684;&#x5047;&#x8BBE;&#x53EF;&#x80FD;&#x53EA;&#x662F;H&#x4E2D;&#x4E0E;&#x8BAD;&#x7EC3;&#x6837;&#x4F8B;&#x4E00;&#x81F4;&#x7684;&#x591A;&#x4E2A;&#x5047;&#x8BBE;&#x4E4B;&#x4E00;&#x3002;</p>
</li>
</ul>
</li>
<li>
<p>&#x5217;&#x8868;&#x540E;&#x6D88;&#x9664;&#x7B97;&#x6CD5;&#xFF08;List-Then-Eliminate&#xFF09;&#xFF1A;</p>
<pre><code>*   &#x5148;&#x628A;&#x53D8;&#x5F62;&#x7A7A;&#x95F4;&#x8BBE;&#x7F6E;&#x4E3A;&#x6240;&#x6709;&#x5047;&#x8BBE;&#x7684;&#x5217;&#x8868;
</code></pre>
<ul>
<li>
<p>&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x6837;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x6392;&#x9664;&#x5047;&#x8BBE;&#x4E2D;&#x548C;&#x6837;&#x4F8B;&#x4E0D;&#x7B26;&#x5408;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
</li>
<li>
<p>&#x8F93;&#x51FA;&#x53D8;&#x5F62;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5047;&#x8BBE;&#x3002;</p>
</li>
<li>
<p>&#x4E00;&#x822C;&#x8FB9;&#x754C;&#xFF08;General boundary&#xFF09;&#xFF1A; &#x8868;&#x793A;&#x5728;H&#x4E2D;&#x4E0E;D&#x76F8;&#x4E00;&#x81F4;&#x7684;&#x6781;&#x5927;&#x4E00;&#x822C;&#x6210;&#x5458;&#x7684;&#x96C6;&#x5408;&#x3002;</p>
</li>
</ul>
</li>
<li>
<p>&#x7279;&#x6B8A;&#x8FB9;&#x754C;&#xFF08;Specific Boundary&#xFF09;&#xFF1A;&#x8868;&#x793A;&#x5728;H&#x4E2D;&#x4E0E;D&#x76F8;&#x4E00;&#x81F4;&#x7684;&#x6781;&#x5927;&#x7279;&#x6B8A;&#x6210;&#x5458;&#x7684;&#x96C6;&#x5408;&#x3002;</p>
</li>
<li>
<p>&#x6240;&#x6709;&#x7684;&#x53D8;&#x5F62;&#x7A7A;&#x95F4;&#x90FD;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x8FB9;&#x754C;&#x4E4B;&#x95F4;&#xFF1A;
<img src="http://i.imgur.com/n0uBYdt.png" alt=""></p>
</li>
</ul>
</li>
</ul>
<h3 id="hui-dao-enjoy-sport-de-li-zi">&#x56DE;&#x5230;enjoy sport&#x7684;&#x4F8B;&#x5B50; <a href="#hui-dao-enjoy-sport-de-li-zi" class="header-anchor">#</a></h3>
<p><img src="http://i.imgur.com/0SnpShX.png" alt="">
&#x6211;&#x4EEC;&#x6765;&#x68B3;&#x7406;&#x4E00;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x8F93;&#x5165;&#x7A7A;&#x95F4;&#xFF1A; X={sky(cloudy/sunny/rainy),Temp=(warm/cold),Humid=(Normal/high),Wind=(Strong/weak),water=(warm/cool),forecast=(same/change)}
&#x6240;&#x4EE5;&#x4E00;&#x5171;&#x662F; = 3_2_2_2_2*2 =96</li>
<li>&#x6982;&#x5FF5;&#x7A7A;&#x95F4;&#xFF08;Concept Space&#xFF09;&#xFF1A;
&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#xFF0C;&#x90FD;&#x6709;&#x6B63;&#x4F8B;&#x53CD;&#x4F8B;&#x4E24;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x6982;&#x5FF5;&#x3002;
&#x6240;&#x4EE5;&#x6982;&#x5FF5;&#x7A7A;&#x95F4;&#x4E3A;2^96</li>
<li>&#x5047;&#x8BBE;&#x7A7A;&#x95F4;&#xFF1A;&#x628A;&#x6BCF;&#x79CD;&#x60C5;&#x51B5;&#x5305;&#x542B;all&#x8FD9;&#x4E2A;&#x9009;&#x9879;&#xFF0C;&#x76F8;&#x4E58;=4_3_3_3_3*3+1=973.&#x8FD9;&#x91CC;&#x52A0;&#x7684;1&#x8868;&#x793A;&#x7684;&#x662F;&#x5168;&#x5426;&#x7684;&#x60C5;&#x51B5;&#x3002;</li>
</ul>
<h3 id="gui-na-pian-zhi-inductive-bias">&#x5F52;&#x7EB3;&#x504F;&#x7F6E;(Inductive Bias) <a href="#gui-na-pian-zhi-inductive-bias" class="header-anchor">#</a></h3>
<p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x8BD5;&#x56FE;&#x53BB;&#x5EFA;&#x9020;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x7528;&#x6765;&#x9884;&#x6D4B;&#x67D0;&#x4E2A;&#x76EE;&#x6807;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x8981;&#x8FBE;&#x5230;&#x6B64;&#x76EE;&#x7684;&#xFF0C;&#x8981;&#x7ED9;&#x4E8E;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x4E00;&#x4E9B;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#xFF0C;&#x6837;&#x672C;&#x8BF4;&#x660E;&#x8F93;&#x5165;&#x4E0E;&#x8F93;&#x51FA;&#x4E4B;&#x95F4;&#x7684;&#x9884;&#x671F;&#x5173;&#x7CFB;&#x3002;&#x7136;&#x540E;&#x5047;&#x8BBE;&#x5B66;&#x4E60;&#x5668;&#x5728;&#x9884;&#x6D4B;&#x4E2D;&#x903C;&#x8FD1;&#x6B63;&#x786E;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x5728;&#x8BAD;&#x7EC3;&#x4E2D;&#x672A;&#x51FA;&#x73B0;&#x7684;&#x6837;&#x672C;&#x3002;&#x65E2;&#x7136;&#x672A;&#x77E5;&#x72B6;&#x51B5;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x82E5;&#x6CA1;&#x6709;&#x5176;&#x5B83;&#x989D;&#x5916;&#x7684;&#x5047;&#x8BBE;&#xFF0C;&#x8FD9;&#x4EFB;&#x52A1;&#x5C31;&#x65E0;&#x6CD5;&#x89E3;&#x51B3;&#x3002;&#x8FD9;&#x79CD;&#x5173;&#x4E8E;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x7684;&#x5FC5;&#x8981;&#x5047;&#x8BBE;&#x5C31;&#x79F0;&#x4E3A;&#x5F52;&#x7EB3;&#x504F;&#x7F6E;&#xFF08;Mitchell, 1980; desJardins and Gordon, 1995&#xFF09;&#x3002;</p>
<p>&#x53C2;&#x8003;&#xFF1A;
&#x300A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x300B;&#xFF08;Tom Mitchell&#xFF09;</p>

      

      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color4">CMU</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color1">10601</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color1">MachineLearning</a>
        		</li>
      		
		</ul>
	</div>

      
	<div class="article-category tagcloud">
		<i class="icon-book icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="/categories/CMU课程/" class="article-tag-list-link color1">CMU课程</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="/categories/MachineLearning/" class="article-tag-list-link color2">Machine Learning</a>
        		</li>
      		
		</ul>
	</div>


      
        <p class="article-more-link">
          <a class="article-more-a" href="/2016/10/19/machine-learning-e5-a4-8d-e4-b9-a0-ef-bc-88-e5-9b-9b-ef-bc-89-ef-bc-9a-e6-a6-82-e5-bf-b5-e5-ad-a6-e4-b9-a0/">展开全文 >></a>
        </p>
      

      
      <div class="clearfix"></div>
    </div>
  </div>
</article>








  
    <article id="post-machine-learning-e5-a4-8d-e4-b9-a0-ef-bc-880-ef-bc-89-ef-bc-9a-e6-9c-ba-e5-99-a8-e5-ad-a6-e4-b9-a0-e5-9f-ba-e6-9c-ac-e4-bb-8b-e7-bb-8d" class="article article-type-post  article-index" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/10/18/machine-learning-e5-a4-8d-e4-b9-a0-ef-bc-880-ef-bc-89-ef-bc-9a-e6-9c-ba-e5-99-a8-e5-ad-a6-e4-b9-a0-e5-9f-ba-e6-9c-ac-e4-bb-8b-e7-bb-8d/">Machine Learning 复习（零）：机器学习基本介绍</a>
    </h1>
  

        
        <a href="/2016/10/18/machine-learning-e5-a4-8d-e4-b9-a0-ef-bc-880-ef-bc-89-ef-bc-9a-e6-9c-ba-e5-99-a8-e5-ad-a6-e4-b9-a0-e5-9f-ba-e6-9c-ac-e4-bb-8b-e7-bb-8d/" class="archive-article-date">
  	<time datetime="2016-10-18T11:34:16.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-10-18</time>
</a>
        
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <script src="/assets/js/DPlayer.min.js"> </script><p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x662F;&#x57FA;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF08;1980s-&#x73B0;&#x5728;&#xFF09;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x4F8B;&#x5B50;&#x6765;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x3002;</p>
<h3 id="ji-qi-xue-xi-kuang-jia">&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6846;&#x67B6; <a href="#ji-qi-xue-xi-kuang-jia" class="header-anchor">#</a></h3>
<ul>
<li>
<p>&#x901A;&#x5E38;&#x662F;&#x6210;&#x5BF9;&#x51FA;&#x73B0;&#xFF08;Input-Correct_Output&#xFF09;</p>
</li>
<li>
<p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5E38;&#x89C1;&#x60C5;&#x51B5;&#xFF1A;</p>
<pre><code>*   **&#x5206;&#x7C7B;(Classification)**&#xFF1A; &#x533B;&#x7597;&#x8BCA;&#x65AD;&#xFF1A; &#x4ECE;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x6307;&#x5411;&#x4E00;&#x4E9B;&#x5206;&#x7C7B;&#xFF1B;*   **&#x56DE;&#x5F52;&#xFF08;Regression&#xFF09;**&#xFF1A;&#x9884;&#x6D4B;&#x660E;&#x5929;&#x7684;&#x5929;&#x6C14;&#xFF1A;&#x4ECE;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x5230;&#x4E00;&#x4E2A;&#x6570;&#x5B57;
</code></pre>
<ul>
<li><strong>&#x903B;&#x8F91;&#x56DE;&#x5F52;&#xFF08;Logistic Regression&#xFF09;</strong>: &#x5B58;&#x6D3B;&#x51E0;&#x7387;&#xFF1A;&#x4ECE;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x5230;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x6027;</li>
</ul>
</li>
</ul>
<h3 id="ru-he-jie-jue-yi-ge-ji-qi-xue-xi-de-wen-ti">&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x95EE;&#x9898; <a href="#ru-he-jie-jue-yi-ge-ji-qi-xue-xi-de-wen-ti" class="header-anchor">#</a></h3>
<ul>
<li>&#x5B9A;&#x4E49;&#x4F60;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x8003;&#x8651;&#x4F60;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x6BD4;&#x5982;&#x662F;&#x8981;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x5141;&#x8BB8;&#x8D37;&#x6B3E;</li>
<li>&#x8003;&#x8651;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x6709;&#x591A;&#x5C11;&#x6570;&#x636E;&#xFF0C;&#x8981;&#x82B1;&#x591A;&#x5C11;&#x65F6;&#x95F4;&#x548C;&#x52AA;&#x529B;</li>
<li>&#x8003;&#x8651;&#x8F93;&#x51FA;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x662F;&#x6570;&#x5B57;&#x8FD8;&#x662F;&#x5206;&#x7C7B;&#xFF0C;&#x662F;&#x53EF;&#x80FD;&#x6027;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x8BA1;&#x5212;</li>
<li>&#x9009;&#x62E9;&#x8861;&#x91CF;&#x8868;&#x73B0;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x6BD4;&#x5982;&#x635F;&#x5931;&#x51FD;&#x6570;&#x6216;&#x9519;&#x8BEF;&#x7387;</li>
<li>&#x9009;&#x62E9;&#x8F93;&#x5165;&#x7684;&#x5F62;&#x5F0F;</li>
<li>&#x9009;&#x62E9;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF08;&#x5047;&#x8BBE;&#x7A7A;&#x95F4;&#xFF09;</li>
<li>&#x9009;&#x62E9;&#x6216;&#x8005;&#x8BBE;&#x8BA1;&#x4E00;&#x79CD;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;</li>
</ul>
<p><img src="http://i.imgur.com/13KMImC.png" alt=""></p>
<h3 id="ji-qi-xue-xi-he-tong-ji-de-guan-xi">&#x673A;&#x5668;&#x5B66;&#x4E60;&#x548C;&#x7EDF;&#x8BA1;&#x7684;&#x5173;&#x7CFB; <a href="#ji-qi-xue-xi-he-tong-ji-de-guan-xi" class="header-anchor">#</a></h3>
<p>&#x4ECE;20&#x4E16;&#x7EAA;90&#x5E74;&#x4EE3;&#x4E2D;&#xFF0C;&#x4EBA;&#x4EEC;&#x5F00;&#x59CB;&#x6162;&#x6162;&#x4E86;&#x89E3;&#x7EDF;&#x8BA1;&#x548C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<ul>
<li>
<p>&#x7EDF;&#x8BA1;&#xFF1A;</p>
<pre><code>*   &#x6570;&#x5B66;&#x7684;&#x5206;&#x652F;
</code></pre>
<ul>
<li>&#x66F4;&#x591A;&#x8003;&#x8651;&#x662F;&#x5426;&#x6B63;&#x786E;</li>
<li>&#x4E0D;&#x592A;&#x8003;&#x8651;&#x8BA1;&#x7B97;&#x7684;&#x590D;&#x6742;&#x6027;</li>
</ul>
</li>
<li>
<p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF1A;</p>
<pre><code>*   &#x4FE1;&#x606F;&#x6280;&#x672F;&#x6216;&#x8005;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#x5206;&#x652F;
</code></pre>
<ul>
<li>&#x66F4;&#x770B;&#x91CD;&#x662F;&#x5426;&#x80FD;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#x8FD0;&#x7528;</li>
<li>&#x4E0D;&#x592A;&#x8003;&#x8651;&#x7EDF;&#x8BA1;&#x539F;&#x7406;</li>
<li>&#x5982;&#x4ECA;&#xFF0C;&#x4E24;&#x8005;&#x5DF2;&#x7ECF;&#x6709;&#x6548;&#x7ED3;&#x5408;&#x4E86;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E5F;&#x5E38;&#x5E38;&#x79F0;&#x4E3A;&#x201C;&#x7EDF;&#x8BA1;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x201D;&#x3002;</li>
</ul>
</li>
</ul>

      

      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color4">CMU</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color1">10601</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color1">MachineLearning</a>
        		</li>
      		
		</ul>
	</div>

      
	<div class="article-category tagcloud">
		<i class="icon-book icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="/categories/CMU课程/" class="article-tag-list-link color1">CMU课程</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="/categories/MachineLearning/" class="article-tag-list-link color2">Machine Learning</a>
        		</li>
      		
		</ul>
	</div>


      
        <p class="article-more-link">
          <a class="article-more-a" href="/2016/10/18/machine-learning-e5-a4-8d-e4-b9-a0-ef-bc-880-ef-bc-89-ef-bc-9a-e6-9c-ba-e5-99-a8-e5-ad-a6-e4-b9-a0-e5-9f-ba-e6-9c-ac-e4-bb-8b-e7-bb-8d/">展开全文 >></a>
        </p>
      

      
      <div class="clearfix"></div>
    </div>
  </div>
</article>








  
    <article id="post-machine-learning-e5-a4-8d-e4-b9-a0-ef-bc-88-e4-ba-8c-ef-bc-89-ef-bc-9a-e4-bf-a1-e6-81-af-e8-ae-ba" class="article article-type-post  article-index" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/10/18/machine-learning-e5-a4-8d-e4-b9-a0-ef-bc-88-e4-ba-8c-ef-bc-89-ef-bc-9a-e4-bf-a1-e6-81-af-e8-ae-ba/">Machine Learning 复习（二）：信息论</a>
    </h1>
  

        
        <a href="/2016/10/18/machine-learning-e5-a4-8d-e4-b9-a0-ef-bc-88-e4-ba-8c-ef-bc-89-ef-bc-9a-e4-bf-a1-e6-81-af-e8-ae-ba/" class="archive-article-date">
  	<time datetime="2016-10-18T09:14:33.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-10-18</time>
</a>
        
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <script src="/assets/js/DPlayer.min.js"> </script><h3 id="informaiton">Informaiton <a href="#informaiton" class="header-anchor">#</a></h3>
<ul>
<li>&#x4FE1;&#x606F; &#xFF01;= &#x77E5;&#x8BC6;</li>
<li>&#x4FE1;&#x606F;&#x7528;&#x6765;&#x51CF;&#x5C11;&#x4E0D;&#x786E;&#x5B9A;&#x6027;</li>
<li>&#x5F53;&#x6211;&#x4EEC;&#x5F97;&#x77E5;E&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E86;</li>
</ul>
<p><img src="http://i.imgur.com/d6puw09.png" alt=""></p>
<p>bits&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<pre><code>*   &#x5176;&#x4E2D;log&#x7684;&#x5E95;&#x6570;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x4E3A;2.
*   &#x8FD9;&#x4E5F;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x8868;&#x793A;&#x4E86;&#x4E8B;&#x4EF6;E&#x7684;&#x201C;&#x60CA;&#x559C;&#x201D;&#x6570;&#x91CF;&#x3002;
*   &#x4F8B;&#x5982;&#x629B;&#x4E00;&#x679A;&#x786C;&#x5E01;&#x5F97;&#x5230;&#x7684;&#x4FE1;&#x606F;&#x662F;&#xFF1A;![](http://i.imgur.com/xCAfm06.png)
*   &#x629B;&#x4E00;&#x679A;&#x9AB0;&#x5B50;&#x5F97;&#x5230;&#x7684;&#x4FE1;&#x606F;&#x662F;&#xFF1A;
</code></pre>
<p><img src="http://i.imgur.com/3qhzEa5.png" alt=""></p>
<ul>
<li>&#x4FE1;&#x606F;&#x71B5;&#xFF08;Entropy&#xFF09;&#x7528;&#x6765;&#x5EA6;&#x91CF;&#x968F;&#x673A;&#x53D8;&#x91CF;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;<img src="http://i.imgur.com/vhNudZf.png" alt=""></li>
</ul>
<p><img src="http://i.imgur.com/hMmPF6t.png" alt=""></p>
<p>&lt;pre class=&quot;editor-colors lang-text&quot;&gt;&lt;div class=&quot;line&quot;&gt;&lt;span class=&quot;text plain&quot;&gt;&lt;span class=&quot;meta bullet-point star text&quot;&gt;&lt;span&gt;&#xA0;&lt;/span&gt;&lt;span class=&quot;punctuation definition item text&quot;&gt;&lt;span&gt;<em>&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&#xA0;&#x4EE3;&#x8868;&#x7684;&#x662F;&#x89C2;&#x5BDF;S&#x4E8B;&#x4EF6;&#x6765;&#x6E90;&#x6240;&#x80FD;&#x5F97;&#x5230;&#x7684;&#x5E73;&#x5747;&#x4FE1;&#x606F;&#x91CF;&#x3002;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/div&gt;&lt;div class=&quot;line&quot;&gt;&lt;span class=&quot;text plain&quot;&gt;&lt;span class=&quot;meta bullet-point star text&quot;&gt;&lt;span&gt;&#xA0;&lt;/span&gt;&lt;span class=&quot;punctuation definition item text&quot;&gt;&lt;span&gt;</em>&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&#xA0;&#x4EE3;&#x8868;&#x7684;&#x662F;&#x89C2;&#x5BDF;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x6240;&#x5F97;&#x5230;&#x7684;&#x5E73;&#x5747;&#x201C;&#x60CA;&#x559C;&#x201D;&#x91CF;&#x3002;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/div&gt;&lt;div class=&quot;line&quot;&gt;&lt;span class=&quot;text plain&quot;&gt;&lt;span class=&quot;meta bullet-point star text&quot;&gt;&lt;span&gt;&#xA0;&lt;/span&gt;&lt;span class=&quot;punctuation definition item text&quot;&gt;&lt;span&gt;<em>&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&#xA0;&#x5728;&#x89C2;&#x5BDF;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x4E4B;&#x524D;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x3002;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/div&gt;&lt;div class=&quot;line&quot;&gt;&lt;span class=&quot;text plain&quot;&gt;&lt;span class=&quot;meta bullet-point star text&quot;&gt;&lt;span&gt;&#xA0;&lt;/span&gt;&lt;span class=&quot;punctuation definition item text&quot;&gt;&lt;span&gt;</em>&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&#xA0;&#x6839;&#x636E;Shannon&#x5B9A;&#x5F8B;&#xFF0C;&#x5F53;&#x4F60;&#x7528;code&#x6765;&#x4F20;&#x9012;&#x4FE1;&#x606F;&#x65F6;&#xFF0C;&#x6700;&#x4F4E;&#x7684;limit&#x662F;code&#x7684;efficiency&#x4E0D;&#x80FD;&#x4F4E;&#x4E8E;Entropy&#x3002;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/div&gt;&lt;/pre&gt;</p>
<ul>
<li>
<p>&#x4FE1;&#x606F;&#x71B5;&#x7684;&#x7279;&#x6027;&#xFF1A;</p>
<ul>
<li>&#x4E0D;&#x4E3A;&#x8D1F;&#x3002;</li>
<li>&#x6982;&#x7387;&#x8D8A;&#x5927;&#xFF0C;&#x81EA;&#x4FE1;&#x606F;&#x91CF;&#x8D8A;&#x5C0F;</li>
<li>&#x8BBE;K&#x662F;&#x7CFB;&#x7EDF;&#x5185;&#x7684;&#x4FE1;&#x606F;&#x603B;&#x6570;&#xFF0C;&#x5219;
<img src="http://i.imgur.com/Dq8RQVR.png" alt="">&#x5F53;p=1/k,&#x5373;&#x4E8B;&#x4EF6;&#x6982;&#x7387;&#x76F8;&#x7B49;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;S&#x7684;&#x71B5;&#x6700;&#x5927;&#x3002;</li>
</ul>
</li>
<li>
<p>&#x8054;&#x5408;&#x71B5;&#xFF1A;</p>
<ul>
<li>
<p>&#x901A;&#x8FC7;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#x660E;&#xFF1A;
<img src="http://i.imgur.com/cJLL1eO.png" alt=""></p>
<pre><code>*   &#x5982;&#x56FE;&#xFF0C;H&#xFF08;T&#xFF09;= H&#xFF08;0.3&#xFF0C;0.5&#xFF0C;0.2&#xFF09;=1.48548
</code></pre>
</li>
</ul>
</li>
</ul>
<p>H(M)=H(0.6,0.4)=0.970951
H(T)+H(M)=2.456431
*   &#x800C;&#x8054;&#x5408;&#x71B5;&#x5219;&#x8868;&#x793A;&#x4E3A;&#xFF1A;
<img src="http://i.imgur.com/fXwGoZd.png" alt=""></p>
<pre><code>    &#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF1A;
</code></pre>
<p><img src="http://i.imgur.com/bRTkMLK.png" alt="">
&#x5F53;X&#xFF0C;Y&#x5728;&#x7EDF;&#x8BA1;&#x5B66;&#x4E0A;&#x4E92;&#x76F8;&#x72EC;&#x7ACB;&#x65F6;&#xFF0C;&#x7B49;&#x53F7;&#x6210;&#x7ACB;&#x3002;</p>
<ul>
<li>
<p>&#x6761;&#x4EF6;&#x71B5;&#xFF08;Conditional Entropy&#xFF09;;
P(T=t|M=m):
<img src="http://i.imgur.com/FGzAOEu.png" alt="">
<img src="http://i.imgur.com/yIkhyGa.png" alt=""></p>
<ul>
<li>
<p>&#x5E73;&#x5747;&#x6761;&#x4EF6;&#x71B5;&#xFF1A;
<img src="http://i.imgur.com/CJsv6Xz.png" alt=""></p>
<pre><code>*   &#x90A3;&#x4E48;M&#xFF08;cold/mild/hot&#xFF09;&#x80FD;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x591A;&#x5C11;&#x5173;&#x4E8E;T&#x7684;&#x4FE1;&#x606F;&#x5462;&#xFF1F;
</code></pre>
</li>
</ul>
</li>
</ul>
<p><img src="http://i.imgur.com/7Hgqpdo.png" alt=""></p>
<pre><code>    &#x540C;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x89C2;&#x5BDF;T&#x80FD;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x591A;&#x5C11;&#x548C;M&#x6709;&#x5173;&#x7684;&#x4FE1;&#x606F;&#xFF1A;
</code></pre>
<p><img src="http://i.imgur.com/xbxyZyg.png" alt=""></p>
<ul>
<li>
<p>&#x5E73;&#x5747;&#x4E92;&#x4FE1;&#x606F;&#xFF1A;
<img src="http://i.imgur.com/XqcI5yk.png" alt=""></p>
<ul>
<li>
<p>&#x6027;&#x8D28;&#xFF1A;</p>
<pre><code>    *   &#x5BF9;&#x79F0;&#x6027;&#xFF1A;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5BF9;&#x4E8E;X&#x548C;Y&#xFF0C;&#x5E73;&#x5747;&#x4E92;&#x4FE1;&#x606F;&#x90FD;&#x662F;I&#xFF08;X&#xFF1B;Y&#xFF09;
</code></pre>
<ul>
<li>&#x4E0D;&#x4E3A;&#x8D1F;&#xFF1A; &#x4F46;&#x662F;H(X) &#x2212; H(X/y) &#x53EF;&#x80FD;&#x4E3A;&#x8D1F;</li>
<li>&#x5982;&#x679C;X&#xFF0C;Y&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x5C31;&#x662F;0</li>
<li>&#x53EF;&#x76F8;&#x52A0;&#x7684;</li>
<li><img src="http://i.imgur.com/2L2g7mM.png" alt=""></li>
</ul>
</li>
</ul>
</li>
<li>
<p>&#x5BF9;&#x4E8E;&#x4E09;&#x4E2A;&#x4FE1;&#x606F;&#x6E90;&#xFF1A;
<img src="http://i.imgur.com/DMMhYMM.png" alt=""></p>
</li>
<li>
<p>&#x9A6C;&#x5C14;&#x79D1;&#x592B;&#x94FE;&#xFF08;Markov Source&#xFF09;:
&#x9A6C;&#x5C14;&#x53EF;&#x592B;&#x94FE;&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x79CD;&#x72B6;&#x6001;&#x5E8F;&#x5217;&#xFF0C;&#x5176;&#x6BCF;&#x4E2A;&#x72B6;&#x6001;&#x503C;&#x53D6;&#x51B3;&#x4E8E;&#x524D;&#x9762;&#x6709;&#x9650;&#x4E2A;&#x72B6;&#x6001;&#x3002;&#x9A6C;&#x5C14;&#x53EF;&#x592B;&#x94FE;&#x662F;&#x5177;&#x6709;&#x9A6C;&#x5C14;&#x53EF;&#x592B;&#x6027;&#x8D28;&#x7684;&#x968F;&#x673A;&#x53D8;&#x91CF;&#x7684;&#x4E00;&#x4E2A;&#x6570;&#x5217;&#x3002;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x5373;&#x5B83;&#x4EEC;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x53D6;&#x503C;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x72B6;&#x6001;&#x7A7A;&#x95F4;&#x201D;&#xFF0C;&#x800C;  &#x7684;&#x503C;&#x5219;&#x662F;&#x5728;&#x65F6;&#x95F4;n&#x7684;&#x72B6;&#x6001;&#x3002;&#x5982;&#x679C;<img src="http://i.imgur.com/kHK3e83.png" alt="">&#x5BF9;&#x4E8E;&#x8FC7;&#x53BB;&#x72B6;&#x6001;&#x7684;&#x6761;&#x4EF6;&#x6982;&#x7387;&#x5206;&#x5E03;&#x4EC5;&#x662F;  &#x7684;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5219; <img src="http://i.imgur.com/xBCVgwp.png" alt=""></p>
</li>
</ul>

      

      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color4">CMU</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color1">10601</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color1">MachineLearning</a>
        		</li>
      		
		</ul>
	</div>

      
	<div class="article-category tagcloud">
		<i class="icon-book icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="/categories/CMU课程/" class="article-tag-list-link color1">CMU课程</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="/categories/MachineLearning/" class="article-tag-list-link color2">Machine Learning</a>
        		</li>
      		
		</ul>
	</div>


      
        <p class="article-more-link">
          <a class="article-more-a" href="/2016/10/18/machine-learning-e5-a4-8d-e4-b9-a0-ef-bc-88-e4-ba-8c-ef-bc-89-ef-bc-9a-e4-bf-a1-e6-81-af-e8-ae-ba/">展开全文 >></a>
        </p>
      

      
      <div class="clearfix"></div>
    </div>
  </div>
</article>








  
    <article id="post-machine-learning-e5-a4-8d-e4-b9-a0-e4-b8-80-ef-bc-9a-e6-a6-82-e7-8e-87-e7-bb-9f-e8-ae-a1-e5-92-8c-e7-ba-bf-e6-80-a7-e5-9b-9e-e5-bd-92" class="article article-type-post  article-index" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/10/17/machine-learning-e5-a4-8d-e4-b9-a0-e4-b8-80-ef-bc-9a-e6-a6-82-e7-8e-87-e7-bb-9f-e8-ae-a1-e5-92-8c-e7-ba-bf-e6-80-a7-e5-9b-9e-e5-bd-92/">Machine Learning 复习 (一)：概率统计和线性回归</a>
    </h1>
  

        
        <a href="/2016/10/17/machine-learning-e5-a4-8d-e4-b9-a0-e4-b8-80-ef-bc-9a-e6-a6-82-e7-8e-87-e7-bb-9f-e8-ae-a1-e5-92-8c-e7-ba-bf-e6-80-a7-e5-9b-9e-e5-bd-92/" class="archive-article-date">
  	<time datetime="2016-10-17T12:54:30.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-10-17</time>
</a>
        
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <script src="/assets/js/DPlayer.min.js"> </script><p>Machine Learning &#x603B;&#x7ED3;</p>
<h3 id="probability-and-statistics">Probability and Statistics <a href="#probability-and-statistics" class="header-anchor">#</a></h3>
<ul>
<li>
<p>&#x5E38;&#x89C4;&#x53D8;&#x91CF;&#xFF08;Regular variables&#xFF09;&#x5E94;&#x8BE5;&#x662F;&#x6570;&#x5B57;&#x6216;&#x8005;&#x662F;&#x5176;&#x4ED6;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x968F;&#x673A;&#x53D8;&#x91CF;&#xFF08;Random Variables&#xFF09;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x503C;&#x5F97;&#x5206;&#x90E8;&#x3002; &#x6BD4;&#x5982;&#xFF0C;&#x6254;&#x4E00;&#x679A;&#x786C;&#x5E01;&#x662F;&#x968F;&#x673A;&#x53D8;&#x91CF;X&#x7684;&#x5982;&#x4E0B;&#x5206;&#x5E03;&#xFF0C;&#x2018;Head&#x2019;&#x53EF;&#x80FD;&#x6027;&#x4E3A;0.5&#xFF0C;&#x2018;Tail&#x2019;&#x53EF;&#x80FD;&#x6027;&#x4E3A;0.5.</p>
</li>
<li>
<p>&#x4E00;&#x822C;&#x6211;&#x4EEC;&#x7528;&#x5927;&#x5199;&#x5B57;&#x6BCD;&#x8868;&#x793A;&#x968F;&#x673A;&#x53D8;&#x91CF;&#xFF0C;&#x7528;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#x8868;&#x793A;&#x968F;&#x673A;&#x53D8;&#x91CF;&#x53D6;&#x7684;&#x503C;&#x3002;
<img src="http://i.imgur.com/pDKvACY.png" alt=""></p>
</li>
<li>
<p>&#x94FE;&#x5F0F;&#x6CD5;&#x5219;&#xFF1A;
<img src="http://i.imgur.com/4mhM7ZX.png" alt=""></p>
</li>
<li>
<p>&#x72EC;&#x7ACB;&#x4E8B;&#x4EF6;&#xFF1A;
<img src="http://i.imgur.com/OW5IlLd.png" alt=""></p>
</li>
<li>
<p>&#x6570;&#x5B66;&#x671F;&#x671B;E&#xFF1A;
<img src="http://i.imgur.com/cnOMht3.png" alt=""></p>
<ul>
<li>
<p>&#x6027;&#x8D28;&#xFF1A;</p>
<pre><code>*   &#x7EBF;&#x6027;&#x8868;&#x8FBE;&#xFF1A;
</code></pre>
</li>
</ul>
</li>
</ul>
<p><img src="http://i.imgur.com/umYck9X.png" alt="">
*   &#x5728;&#x4E0D;&#x5047;&#x5B9A;&#x4EFB;&#x4F55;X&#x548C;Y&#x7684;&#x5173;&#x7CFB;&#x6761;&#x4EF6;&#x4E0B;&#xFF1A;
<img src="http://i.imgur.com/oIUCHhI.png" alt=""></p>
<ul>
<li>&#x65B9;&#x5DEE;&#xFF1A;</li>
</ul>
<p>Var[X] = E[(X &#x2212; E[X])2]
<img src="http://i.imgur.com/nMY4vIP.png" alt=""></p>
<ul>
<li>
<p>&#x6807;&#x51C6;&#x5DEE;&#xFF1A;
<img src="http://i.imgur.com/eDUZuou.png" alt=""></p>
</li>
<li>
<p>X,Y&#x7684;&#x534F;&#x65B9;&#x5DEE;&#xFF1A;
<img src="http://i.imgur.com/H8fkuCv.png" alt=""></p>
</li>
<li>
<p>&#x65B9;&#x5DEE;&#xFF0C;&#x6807;&#x51C6;&#x5DEE;&#xFF0C;&#x534F;&#x65B9;&#x5DEE;&#x7684;&#x4E00;&#x4E9B;&#x6027;&#x8D28;&#xFF1A;
<img src="http://i.imgur.com/K1fjJc8.png" alt=""></p>
</li>
<li>
<p>&#x603B;&#x65B9;&#x5DEE;&#x5B9A;&#x5F8B;&#xFF08;The law of total variance&#xFF09;:
<img src="http://i.imgur.com/kEzg3MB.png" alt=""></p>
</li>
<li>
<p>&#x7EBF;&#x6027;&#x76F8;&#x5173;&#xFF08;&#x901A;&#x5E38;&#x88AB;&#x7B80;&#x79F0;&#x4E3A; &#x76F8;&#x5173;&#xFF09;&#xFF1A;</p>
<ul>
<li>
<p>&#x5C5E;&#x4E8E;[-1&#xFF0C;1]
<img src="http://i.imgur.com/5DyzoXH.png" alt=""></p>
</li>
<li>
<p>&#x76F8;&#x5173;&#x6027;&#x5728;&#x53D8;&#x91CF;&#x7684;&#x79FB;&#x52A8;&#x548C;&#x8303;&#x56F4;&#x53D8;&#x5316;&#x4E2D;&#x5E38;&#x5E38;&#x662F;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x7684;
<img src="http://i.imgur.com/CNoMJ92.png" alt=""></p>
<ul>
<li>&#x5982;&#x679C;X&#xFF0C;Y&#x4E92;&#x76F8;&#x72EC;&#x7ACB;&#xFF0C;&#x90A3;&#x4E48;&#x7EBF;&#x6027;&#x76F8;&#x5173;&#x6027;&#x4E3A;0&#xFF0C;&#x4F46;&#x662F;&#x53CD;&#x4E4B;&#x4E0D;&#x53EF;&#x4EE5;&#x3002;&#x5373;X&#xFF0C;Y&#x53EF;&#x80FD;&#x7EBF;&#x6027;&#x4E0D;&#x76F8;&#x5173;&#xFF0C;&#x4F46;&#x662F;&#x4F9D;&#x65E7;&#x4E0D;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#x3002;
&#x6240;&#x4EE5;&#x7ED3;&#x8BBA;&#x53EA;&#x80FD;&#x662F;&#xFF1A;
&#x72EC;&#x7ACB; -&gt; &#x7EBF;&#x6027;&#x4E0D;&#x76F8;&#x5173;&#xFF0C;&#x53CD;&#x4E4B;&#x4E0D;&#x53EF;&#x3002;</li>
</ul>
</li>
</ul>
</li>
</ul>
<h3 id="correlation-vs-mutual-information">Correlation vs. Mutual Information <a href="#correlation-vs-mutual-information" class="header-anchor">#</a></h3>
<ul>
<li>
<p>Mutual Information &#x7684;&#x5B9A;&#x4E49;&#xFF08;&#x53EF;&#x53C2;&#x89C1;&#x53E6;&#x4E00;&#x7BC7;&#x535A;&#x5BA2;&#x3010;&#x73B0;&#x5728;&#x6CA1;&#x6709;&#x54C8;&#x54C8;&#x3011;&#xFF1A;Machine Learning&#x4FE1;&#x606F;&#x8BBA;&#x590D;&#x4E60;&#xFF09;&#xFF1A;</p>
</li>
<li>
<p>&#x7EBF;&#x6027;&#x76F8;&#x5173;&#x6027;&#x9700;&#x8981;x&#xFF0C;y&#x7684;&#x503C;&#x90FD;&#x662F;&#x6570;&#x5B57;&#xFF0C;&#x6240;&#x4EE5;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x8DDD;&#x79BB;&#x6982;&#x5FF5;---&#x5EA6;&#x91CF;&#x7A7A;&#x95F4;&#xFF08;metric space&#xFF09;&#x3002;</p>
<ul>
<li>
<p>&#x5EA6;&#x91CF;&#x7A7A;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8861;&#x91CF;&#x7EBF;&#x6027;&#x76F8;&#x5173;&#x7684;&#x7A0B;&#x5EA6;&#x548C;&#x7D27;&#x5BC6;&#x5EA6;&#xFF08;tightness&#xFF09;&#x3002;</p>
<ul>
<li>&#x5BF9;&#x4E8E;binary&#x7684;&#x968F;&#x673A;&#x53D8;&#x91CF;&#xFF0C;&#x8BA4;&#x4E3A;&#x53D8;&#x91CF;&#x62E5;&#x6709;&#x4E24;&#x4E2A;&#x6570;&#x503C;&#xFF0C;0&#x548C;1&#x3002;&#x8303;&#x56F4;&#x4E5F;&#x662F;[-1&#xFF0C;1]&#x3002;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x66F4;&#x52A0;&#x5728;&#x610F;&#x76F8;&#x5173;&#x7684;&#x5F3A;&#x5EA6;&#xFF0C;&#x800C;&#x975E;&#x53CD;&#x5411;&#x6027;&#xFF08;polarity&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4F1A;&#x89C2;&#x5BDF;<img src="http://i.imgur.com/snCouQg.png" alt=""> &#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5176;&#x8303;&#x56F4;&#x4E3A;[0,1]</li>
</ul>
</li>
</ul>
</li>
<li>
<p>&#x76F8;&#x53CD;&#xFF0C;Mutual Information &#x4E0D;&#x9700;&#x8981;&#x5EA6;&#x91CF;&#x7A7A;&#x95F4;&#x3002;
<img src="http://i.imgur.com/Nzz5md8.png" alt=""></p>
</li>
<li>
<p>Mutual Information I&#xFF08;X;Y&#xFF09;&#x5F88;&#x5927;&#x4F46;&#x662F;&#x76F8;&#x5173;&#x6027;&#x4E3A;0&#x7684;&#x4F8B;&#x5B50;:</p>
<ul>
<li>
<p>&#x4E00;&#x4E2A;&#x5B8C;&#x7F8E;&#x7684;&#x591A;&#x8FB9;&#x5F62;&#xFF0C;&#x9876;&#x70B9;&#x7684;&#x7EBF;&#x6027;&#x76F8;&#x5173;&#x6027;&#x6C38;&#x8FDC;&#x4E3A;0&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x5B9A;&#x70B9;&#x4E2A;&#x6570;&#x8D8B;&#x5411;&#x65E0;&#x7A77;&#xFF0C;I&#xFF08;X&#xFF1B;Y&#xFF09;&#x4E5F;&#x4F1A;&#x8D8B;&#x5411;&#x65E0;&#x7A77;&#x3002;</p>
<pre><code>    *   &#x6700;&#x5C0F;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;&#x7B49;&#x8FB9;&#x4E09;&#x89D2;&#x5F62;
</code></pre>
<ul>
<li>&#x6765;&#x601D;&#x8003;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5747;&#x5300;&#x7684;&#x6B63;&#x65B9;&#x5F62;&#xFF0C;&#x5F53;&#x4F60;&#x65CB;&#x8F6C;&#x5B83;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x76F8;&#x5173;&#x6027;&#x4E0D;&#x53D8;&#xFF0C;&#x4F46;&#x662F;I&#x4F1A;&#x968F;&#x7740;&#x65CB;&#x8F6C;&#x800C;&#x53D8;&#x5316;&#x3002;&#x5F53;&#x65CB;&#x8F6C;&#x5230;&#x548C;&#x8F74;&#x5E73;&#x884C;&#x65F6;&#xFF0C;I&#x51CF;&#x5C0F;&#x4E86;&#x3002;
<img src="http://i.imgur.com/0VfYmLq.png" alt=""></li>
</ul>
</li>
</ul>
</li>
<li>
<p>Mutual Information &#x4E3A;0&#x4F46;&#x662F;&#x76F8;&#x5173;&#x6027;&#x4E0D;&#x4E3A;0&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<ul>
<li>&#x6CA1;&#x6709;&#x3002;&#x56E0;&#x4E3A;I&#xFF08;X&#xFF1B;Y&#xFF09;=0 &#x610F;&#x5473;&#x7740;X&#xFF0C;Y&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x76F8;&#x5173;&#x6027;&#x4E00;&#x5B9A;&#x4E3A;0&#x3002;</li>
</ul>
</li>
</ul>
<h3 id="linear-learning-in-one-dimension-simple-linear-regression">Linear Learning in One Dimension(Simple Linear Regression) <a href="#linear-learning-in-one-dimension-simple-linear-regression" class="header-anchor">#</a></h3>
<ul>
<li>&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x8003;&#x8651;&#x7684;&#x662F;&#x4E00;&#x79CD;Mapping X-&gt;Y.X&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#x4F1A;&#x7ED9;&#x51FA;&#xFF0C;&#x6211;&#x4EEC;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x4E86;&#x89E3;P&#xFF08;y|x&#xFF09;&#x800C;&#x4E0D;&#x662F;P&#xFF08;x&#xFF0C;y&#xFF09;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x77E5;&#x9053;&#x5728;&#x7ED9;&#x5B9A;x&#x7684;&#x60C5;&#x51B5;&#x4E0B;y&#x7684;&#x671F;&#x671B;&#x503C;&#x3002;&#x5373;&#xFF0C;E[Y|X=x]&#xFF0C;&#x66F4;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;X&#x548C;E[Y]&#x7B26;&#x5408;&#x4E00;&#x79CD;&#x7EBF;&#x6027;&#x5173;&#x7CFB;&#xFF1A;
<img src="http://i.imgur.com/FtpiBMl.png" alt="">
&#x6216;&#x8005;&#x8BF4;&#x662F;&#xFF1A;
<img src="http://i.imgur.com/79iWQIz.png" alt=""></li>
<li>&#x3B2;&#x662F;&#x659C;&#x7387;&#xFF0C;&#x3B1;&#x662F;&#x622A;&#x8DDD;&#xFF0C;&#x3B5;&#x662F;&#x96F6;&#x5747;&#x503C;&#x5206;&#x5E03;&#x3002;&#xFF08;&#x597D;&#x4E86;&#x597D;&#x4E86;&#x8FD9;&#x4E2A;&#x4E2D;&#x5B66;&#x5C31;&#x5B66;&#x8FC7;&#x4E86;&#x3002;&#xFF09;</li>
<li>&#x5BF9;&#x4E8E;&#x7ED9;&#x5B9A;&#x7684;&#x659C;&#x7387;&#x548C;&#x622A;&#x8DDD;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E00;&#x6761;&#x7EBF;&#xFF0C;&#x7136;&#x540E;&#x8BA1;&#x7B97;&#x4E00;&#x4E0B;&#x8BEF;&#x5DEE;&#x3002;
<img src="http://i.imgur.com/cHM6aMP.png" alt="">
&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x79CD;&#x8BEF;&#x5DEE;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x9519;&#x8BEF;&#xFF0C;&#x53EA;&#x662F;&#x9884;&#x6D4B;&#x503C;&#x548C;&#x771F;&#x5B9E;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x8DDD;.</li>
<li>&#x4E00;&#x79CD;&#x627E;&#x5230;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6700;&#x5C0F;&#x5316;&#x6B8B;&#x5DEE;&#x5E73;&#x65B9;&#xFF0C; &#x8FD9;&#x91CC;&#x5047;&#x8BBE;&#x8BEF;&#x5DEE;&#x662F;Guassion&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x6B63;&#x6001;&#x5206;&#x5E03;&#xFF09;&#x7684;&#x3002;
<img src="http://i.imgur.com/ElJtZHe.png" alt="">
&#x6709;&#x4E00;&#x79CD;&#x76F8;&#x8FD1;&#x89E3;&#x6CD5;&#xFF1A;
<img src="http://i.imgur.com/MlB77DE.png" alt=""></li>
</ul>
<h3 id="linear-learning-in-multiple-dimensions">Linear Learning in Multiple Dimensions <a href="#linear-learning-in-multiple-dimensions" class="header-anchor">#</a></h3>
<ul>
<li>&#x5982;&#x679C;X&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#x6BD4;&#x5982;&#xFF1A;
<img src="http://i.imgur.com/vHnaG1o.png" alt=""></li>
<li>&#x6211;&#x4EEC;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x5047;&#x8BBE;&#x7EBF;&#x6027;&#x5173;&#x7CFB;&#xFF1A;
<img src="http://i.imgur.com/ppDgVx1.png" alt=""></li>
<li>&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#x7B26;&#x53F7;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5047;&#x8BBE;&#x3B2;0=&#x3B1;&#xFF0C;&#x540C;&#x65F6;x0=1&#x3002;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x5982;&#x4E0B;&#x6A21;&#x578B;&#xFF1A;
<img src="http://i.imgur.com/LOlkLBu.png" alt=""></li>
<li>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x6570;&#x636E;&#x96C6;&#x7528;&#x77E9;&#x9635;&#x8868;&#x793A;
<img src="http://i.imgur.com/gx7nN0Q.png" alt=""></li>
<li>&#x7559;&#x5B58;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x4E3A;&#xFF1A;
<img src="http://i.imgur.com/07n1cTT.png" alt=""></li>
<li>&#x548C;&#x4E0A;&#x9762;&#x7684;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x540C;&#x6837;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x51FA;&#x6700;&#x5C0F;&#x5316;&#x6B8B;&#x5DEE;&#x5E73;&#x65B9;&#xFF1A;
<img src="http://i.imgur.com/8r1EA7v.png" alt="">
&#x6216;&#x8005;&#x4E00;&#x79CD;&#x8FD1;&#x4F3C;&#x89E3;&#x6CD5;&#xFF1A;
<img src="http://i.imgur.com/ojQx65w.png" alt=""></li>
</ul>

      

      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color4">CMU</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color1">10601</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color1">MachineLearning</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color3">Statics</a>
        		</li>
      		
		</ul>
	</div>

      
	<div class="article-category tagcloud">
		<i class="icon-book icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="/categories/CMU课程/" class="article-tag-list-link color1">CMU课程</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="/categories/MachineLearning/" class="article-tag-list-link color2">Machine Learning</a>
        		</li>
      		
		</ul>
	</div>


      
        <p class="article-more-link">
          <a class="article-more-a" href="/2016/10/17/machine-learning-e5-a4-8d-e4-b9-a0-e4-b8-80-ef-bc-9a-e6-a6-82-e7-8e-87-e7-bb-9f-e8-ae-a1-e5-92-8c-e7-ba-bf-e6-80-a7-e5-9b-9e-e5-bd-92/">展开全文 >></a>
        </p>
      

      
      <div class="clearfix"></div>
    </div>
  </div>
</article>








  
    <article id="post-leetcode-172-easyfactorial-trailing-zeroes" class="article article-type-post  article-index" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/10/15/leetcode-172-easyfactorial-trailing-zeroes/">LeetCode 172.Factorial Trailing Zeroes</a>
    </h1>
  

        
        <a href="/2016/10/15/leetcode-172-easyfactorial-trailing-zeroes/" class="archive-article-date">
  	<time datetime="2016-10-15T06:19:35.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-10-15</time>
</a>
        
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <script src="/assets/js/DPlayer.min.js"> </script><blockquote>
<p>Question:</p>
</blockquote>
<blockquote>
<p>Given an integer n, return the number of trailing zeroes in n!.</p>
</blockquote>
<p>&#x9898;&#x610F;&#x662F;&#x6C42;n&#x7684;&#x9636;&#x4E58;&#x540E;&#x9762;0&#x7684;&#x4E2A;&#x6570;&#x3002;</p>
<h3 id="basic-solution">Basic Solution <a href="#basic-solution" class="header-anchor">#</a></h3>
<p>&#x76F4;&#x63A5;&#x786C;&#x6C42;n!&#x7684;&#x7ED3;&#x679C;,&#x518D;&#x8BA1;&#x7B97;&#x672B;&#x5C3E;0&#x7684;&#x4E2A;&#x6570;&#xFF0C;&#x5982;&#x679C;n&#x8FC7;&#x5927;&#xFF0C;&#x7ED3;&#x679C;&#x4F1A;&#x6EA2;&#x51FA;&#x3002;</p>
<p>** Better Solution **</p>
<p><code>Complexity</code> : O(lgn)</p>
<p>&#x540E;&#x7F00;&#x4E3A;0&#x7684;&#x90FD;&#x662F;2&#x548C;5&#x76F8;&#x4E58;&#x5F97;&#x5230;&#x7684;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x8BA1;&#x7B97;2&#x548C;5&#x7684;&#x4E2A;&#x6570;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x4F8B;&#x5982;&#xFF1A;</p>
<p>n = 5! = 1 * 2 * 2 * 2 * 3 * 5 &#x6709;3&#x4E2A;2&#xFF0C;1&#x4E2A;5
n = 7! = 1 * 2 * 3 * 2 * 2 * 5 * 2 * 3 * 7 &#x6709;4&#x4E2A;2&#xFF0C;1&#x4E2A;5</p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;2&#x4F1A;&#x8FDC;&#x8FDC;&#x6BD4;5&#x591A;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x6709;5&#x7684;&#x4E2A;&#x6570;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x8981;&#x6CE8;&#x610F;&#xFF1A;</p>
<p>n = 25! &#x4E0D;&#x6B62;2&#x4E2A;5&#xFF0C;&#x800C;&#x662F;3&#x4E2A;5&#xFF0C;&#x56E0;&#x4E3A;25 = 5 * 5</p>
<p>&#x6240;&#x4EE5;  result = n/5 + n/25 + n/125....</p>
<p>Python Solution:</p>
<p><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div></pre></td><td class="code"><pre><div class="line">class Solution(object):</div><div class="line">   def trailingZeroes(self, n):</div><div class="line">       num, x = 0, 5</div><div class="line">       while n &amp;gt;= x:</div><div class="line">              num += n/x</div><div class="line">              x *= 5</div><div class="line">      return num</div></pre></td></tr></table></figure></p>

      

      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color4">LeetCode</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color5">Easy</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color2">Python</a>
        		</li>
      		 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color5">Math</a>
        		</li>
      		
		</ul>
	</div>

      
	<div class="article-category tagcloud">
		<i class="icon-book icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="/categories/LeetCode/" class="article-tag-list-link color4">LeetCode</a>
        		</li>
      		
		</ul>
	</div>


      
        <p class="article-more-link">
          <a class="article-more-a" href="/2016/10/15/leetcode-172-easyfactorial-trailing-zeroes/">展开全文 >></a>
        </p>
      

      
      <div class="clearfix"></div>
    </div>
  </div>
</article>








  
    <article id="post-e5-90-ac-e6-9d-8e-e5-ae-97-e7-9b-9b" class="article article-type-post  article-index" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/09/23/e5-90-ac-e6-9d-8e-e5-ae-97-e7-9b-9b/">听李宗盛</a>
    </h1>
  

        
        <a href="/2016/09/23/e5-90-ac-e6-9d-8e-e5-ae-97-e7-9b-9b/" class="archive-article-date">
  	<time datetime="2016-09-23T16:44:12.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-09-23</time>
</a>
        
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <script src="/assets/js/DPlayer.min.js"> </script><p><embed src="http://www.xiami.com/widget/12753884_1772001102/singlePlayer.swf" type="application/x-shockwave-flash" width="257" height="33" wmode="transparent"></p>
<p>&#x591C;&#x91CC;&#x4ECE;&#x706F;&#x706B;&#x901A;&#x660E;&#x7684;&#x5B66;&#x6821;&#x56DE;&#x5230;&#x5BB6;&#xFF0C;&#x867E;&#x7C73;&#x968F;&#x673A;&#x653E;&#x4E86;&#x4E00;&#x9996;&#x6B4C;&#x3002; &#x5C45;&#x7136;&#x662F;&#x674E;&#x5B97;&#x76DB;&#x7248;&#x7684;&#x300A;&#x9634;&#x5929;&#x300B;&#x3002;</p>
<p>&#x6211;&#x4E00;&#x4E0B;&#x60F3;&#x5230;&#x4E86;&#x6211;&#x54E5;&#xFF0C;&#x4E00;&#x4E2A;&#x957F;&#x671F;&#x53EA;&#x542C;&#x674E;&#x5B97;&#x76DB;&#x548C;&#x6C11;&#x8C23;&#x7684;&#x7537;&#x4EBA;&#x3002;&#x5927;&#x591A;&#x6570;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4F1A;&#x5FD8;&#x8BB0;&#x4ED6;&#x53EA;&#x6BD4;&#x6211;&#x5927;&#x4E00;&#x5C81;&#xFF0C;&#x4ED6;&#x8BB2;&#x8D77;&#x9053;&#x7406;&#xFF0C;&#x603B;&#x662F;&#x8BA9;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x670D;&#x3002;</p>
<p>&#x5370;&#x8C61;&#x91CC;&#xFF0C;&#x4E00;&#x8D77;&#x594B;&#x6597;&#x7684;&#x65E5;&#x5B50;&#x91CC;&#xFF0C;&#x4ED6;&#x603B;&#x662F;&#x7A9D;&#x5728;&#x6C99;&#x53D1;&#x91CC;&#xFF0C;Mac&#x5C31;&#x516C;&#x653E;&#x674E;&#x5B97;&#x76DB;&#x3002;&#x6211;&#x4E00;&#x4E2A;&#x672C;&#x6765;&#x6CA1;&#x542C;&#x8FC7;&#x674E;&#x5B97;&#x76DB;&#x7684;&#x4EBA;&#xFF0C;&#x6700;&#x540E;&#x8FDE;&#x300A;&#x5C71;&#x4E18;&#x300B;&#x7684;&#x6B4C;&#x8BCD;&#x90FD;&#x5012;&#x80CC;&#x5982;&#x6D41;&#x4E86;&#x3002;</p>
<p>&#x6BCF;&#x53E5;&#x8BDD;&#xFF0C;&#x90FD;&#x50CF;&#x8FC7;&#x5B8C;&#x4E86;&#x4E00;&#x751F;&#x3002;</p>
<p>&#x4E4B;&#x540E;&#xFF0C;&#x6709;&#x7761;&#x4E0D;&#x7740;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x628A;&#x8FD9;&#x9996;&#x6B4C;&#x62FF;&#x51FA;&#x6765;&#x542C;&#x3002;</p>
<p>&#x91D1;&#x739F;&#x5C90;&#x7FFB;&#x5531;&#x8FC7;&#xFF0C;&#x592A;&#x7C89;&#x9970;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x592A;&#x5E74;&#x8F7B;&#xFF0C;&#x5F88;&#x4E0D;&#x559C;&#x3002;</p>
<p>&#x867D;&#x7136;&#x6211;&#x662F;&#x7EDD;&#x5BF9;&#x4E0D;&#x76F8;&#x4FE1;&#x6240;&#x8C13;&#x201C;&#x592A;&#x5E74;&#x8F7B;&#x4E86;&#xFF0C;&#x4E0D;&#x80FD;&#x5982;&#x4F55;&#x5982;&#x4F55;&#x5982;&#x4F55;&#x201D;&#x8FD9;&#x6837;&#x7684;&#x8BF4;&#x8F9E;&#x7684;&#xFF0C;&#x90A3;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x79CD;&#x6545;&#x4F5C;&#x8001;&#x6210;&#x501A;&#x8001;&#x5356;&#x8001;&#x7684;&#x59FF;&#x6001;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8FD9;&#x9996;&#x6B4C;&#xFF0C;&#x4F46;&#x662F;&#x674E;&#x5B97;&#x76DB;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x6C89;&#x6DC0;&#x4E86;&#x5F88;&#x4E45;&#x7684;&#x597D;&#x9152;&#x3002;&#x4F60;&#x5F88;&#x6015;&#x4E00;&#x6253;&#x5F00;&#xFF0C;&#x65E0;&#x6CD5;&#x62B5;&#x5FA1;&#x6251;&#x9762;&#x800C;&#x6765;&#x7684;&#x5C81;&#x6708;&#x611F;&#xFF0C;&#x5E74;&#x8F7B;&#x662F;&#x771F;&#x7684;&#x4F1A;&#x9189;&#x7684;&#x3002;</p>
<p>&#x542C;&#x674E;&#x5B97;&#x76DB;&#x548C;&#x6881;&#x9759;&#x8339;&#x7684;&#x5408;&#x5531;&#xFF0C;&#x58F0;&#x7EBF;&#x90FD;&#x662F;&#x88AB;&#x62C9;&#x957F;&#x4E86;&#x7684;&#xFF0C;&#x80CC;&#x540E;&#x7684;&#x4E1C;&#x897F;&#x592A;&#x591A;&#x3002;&#x8BF4;&#x4E5F;&#x8BF4;&#x4E0D;&#x5B8C;&#x7684;&#x611F;&#x89C9;&#x3002;&#x6881;&#x9759;&#x8339;&#x7FFB;&#x5531;&#x8FC7;&#x674E;&#x5B97;&#x76DB;&#x7684;&#x300A;&#x95EE;&#x300B;&#xFF0C;&#x300A;&#x68A6;&#x9192;&#x65F6;&#x5206;&#x300B;&#xFF0C;&#x300A;&#x660E;&#x660E;&#x767D;&#x767D;&#x6211;&#x7684;&#x5FC3;&#x300B;&#xFF0C;&#x6709;&#x5979;&#x81EA;&#x5DF1;&#x7684;&#x5473;&#x9053;&#xFF0C;&#x771F;&#x5B9E;&#x3002;</p>
<p>&#x6709;&#x6BB5;&#x65F6;&#x95F4;&#x5355;&#x5FAA;&#x542C;&#x674E;&#x5B97;&#x76DB;&#x7684;&#x300A;&#x6F02;&#x6D0B;&#x8FC7;&#x6D77;&#x6765;&#x770B;&#x4F60;&#x300B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5E38;&#x5750;&#x5728;&#x5730;&#x6BEF;&#x4E0A;&#xFF0C;&#x5E38;&#x89C9;&#x5F97;&#x67D4;&#x8F6F;&#x800C;&#x88AB;&#x7737;&#x987E;&#xFF0C;&#x89C9;&#x5F97;&#x5FC3;&#x5B89;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x542C;&#x6B4C;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#xFF0C;&#x4E0D;&#x5E26;&#x611F;&#x60C5;&#x5730;&#x542C;&#xFF0C;&#x4E0D;&#x8BA4;&#x771F;&#x3002;&#x5E26;&#x611F;&#x60C5;&#x5730;&#x542C;&#xFF0C;&#x53C8;&#x592A;&#x7D2F;&#x3002;</p>
<p>&#x53EA;&#x80FD;&#x9002;&#x91CF;&#x3002;&#x6447;&#x6EDA;&#xFF0C;&#x6D41;&#x884C;&#xFF0C;&#x53E4;&#x5178;&#xFF0C;&#x90FD;&#x8981;&#x9002;&#x91CF;&#xFF0C;&#x624D;&#x80FD;&#x51B7;&#x9759;&#x5730;&#x4FDD;&#x6301;&#x81EA;&#x5DF1;&#x7684;&#x5E73;&#x8861;&#x3002;</p>
<p>&#x542C;&#x674E;&#x5B97;&#x76DB;&#xFF0C;&#x66F4;&#x8981;&#x9002;&#x91CF;&#x3002;&#x4E0D;&#x7136;&#x4E00;&#x4E0D;&#x5C0F;&#x5FC3;&#xFF0C;&#x542C;&#x591A;&#x4E86;&#x6216;&#x8BB8;&#x5C31;&#x770B;&#x6DE1;&#x4EBA;&#x751F;&#x4E86;&#x3002;</p>
<p>&#x8981;&#x771F;&#x770B;&#x6DE1;&#x4EBA;&#x751F;&#xFF0C;&#x5F88;&#x96BE;&#x4FDD;&#x6301;&#x5BF9;&#x751F;&#x6D3B;&#x6709;&#x70ED;&#x60C5;&#x7684;&#x90A3;&#x79CD;&#x82F1;&#x96C4;&#x4E3B;&#x4E49;&#x4E86;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x4ECA;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x9700;&#x8981;&#x88AB;&#x6FC0;&#x52B1;&#x7684;&#x5E74;&#x9F84;&#x91CC;&#xFF0C;&#x6211;&#x60F3;&#xFF0C;&#x7B49;&#x5230;&#x6709;&#x4E00;&#x5929;&#x89C9;&#x5F97;&#x7D2F;&#x4E86;&#xFF0C;&#x89C9;&#x5F97;&#x8D70;&#x4E0D;&#x4E0B;&#x53BB;&#x4E86;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x968F;&#x610F;&#x7684;&#x6001;&#x5EA6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x518D;&#x6765;&#x542C;&#x542C;&#x674E;&#x5B97;&#x76DB;&#x5427;&#x3002;</p>

      

      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color4">李宗盛</a>
        		</li>
      		
		</ul>
	</div>

      
	<div class="article-category tagcloud">
		<i class="icon-book icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="/categories/书影音/" class="article-tag-list-link color4">书影音</a>
        		</li>
      		
		</ul>
	</div>


      
        <p class="article-more-link">
          <a class="article-more-a" href="/2016/09/23/e5-90-ac-e6-9d-8e-e5-ae-97-e7-9b-9b/">展开全文 >></a>
        </p>
      

      
      <div class="clearfix"></div>
    </div>
  </div>
</article>








  
    <article id="post-python-remove-e8-af-af-e5-8c-ba" class="article article-type-post  article-index" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/09/19/python-remove-e8-af-af-e5-8c-ba/">python remove误区</a>
    </h1>
  

        
        <a href="/2016/09/19/python-remove-e8-af-af-e5-8c-ba/" class="archive-article-date">
  	<time datetime="2016-09-19T07:58:35.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-09-19</time>
</a>
        
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <script src="/assets/js/DPlayer.min.js"> </script><p>&#x5728;list&#x91CC;&#x9762;&#x8FB9;&#x67E5;&#x627E;&#x8FB9;remove&#xFF0C;&#x4F1A;&#x51FA;&#x9519;&#x3002; &#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;Debug&#x4E86;&#x4E00;&#x4E2A;&#x65E9;&#x4E0A;&#x771F;&#x662F;&#x54ED;&#x778E;&#x3002;</p>
<p>&#x539F;&#x6765;&#x662F;&#xFF1A;</p>
<p><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div></pre></td><td class="code"><pre><div class="line">for h in total_h:</div><div class="line">    if attr_value_list not in h:</div><div class="line">       total_h.remove(h)</div></pre></td></tr></table></figure></p>
<p>&#x4F46;&#x7ED3;&#x679C;&#x59CB;&#x7EC8;&#x9519;&#x8BEF;&#xFF0C;&#x8DD1;&#x4E0D;&#x51FA;&#x5206;&#x3002;</p>
<p>&#x8C03;&#x7528;remove&#x540E;&#xFF0C;index&#x6539;&#x53D8;&#x4E86;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6539;&#x6210;&#x4E86;&#x5982;&#x4E0B;&#xFF0C;&#x5148;&#x628A;&#x8981;remove&#x7684;&#x5B58;&#x5728;&#x65B0;&#x7684;list&#x91CC;&#x9762;&#xFF0C;&#x518D;&#x904D;&#x5386;list&#x53BB;&#x6389;&#x3002;</p>
<p><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div></pre></td><td class="code"><pre><div class="line">for h in total_h:</div><div class="line">    new_h = []</div><div class="line">    if attr_value_list not in h:</div><div class="line">       for x in h:</div><div class="line">           new_h.append(x)</div><div class="line">       remove_list.append(new_h)</div><div class="line">for r in remove_list:</div><div class="line">    total_h.remove(r)</div></pre></td></tr></table></figure></p>

      

      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="javascript:void(0)" class="js-tag article-tag-list-link color2">python</a>
        		</li>
      		
		</ul>
	</div>

      
	<div class="article-category tagcloud">
		<i class="icon-book icon"></i>
		<ul class="article-tag-list">
			 
        		<li class="article-tag-list-item">
        			<a href="/categories/技术冷板凳/" class="article-tag-list-link color1">技术冷板凳</a>
        		</li>
      		
		</ul>
	</div>


      
        <p class="article-more-link">
          <a class="article-more-a" href="/2016/09/19/python-remove-e8-af-af-e5-8c-ba/">展开全文 >></a>
        </p>
      

      
      <div class="clearfix"></div>
    </div>
  </div>
</article>








  
  
    <nav id="page-nav">
      <a class="extend prev" rel="prev" href="/page/3/">&laquo; Prev</a><a class="page-number" href="/">1</a><a class="page-number" href="/page/2/">2</a><a class="page-number" href="/page/3/">3</a><span class="page-number current">4</span><a class="page-number" href="/page/5/">5</a><a class="extend next" rel="next" href="/page/5/">Next &raquo;</a>
    </nav>
  


          </div>
        </div>
      </div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2017 Star
    	</div>
      	<div class="footer-right">
      		<a href="http://hexo.io/" target="_blank">Hexo</a>  Theme <a href="https://github.com/litten/hexo-theme-yilia" target="_blank">Yilia</a> by Litten
      	</div>
    </div>
  </div>
</footer>
    </div>
    <script>
	var yiliaConfig = {
		mathjax: false,
		isHome: true,
		isPost: false,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: false,
		root: "/",
		innerArchive: true,
		showTags: false
	}
</script>

<script>!function(t){function n(r){if(e[r])return e[r].exports;var o=e[r]={exports:{},id:r,loaded:!1};return t[r].call(o.exports,o,o.exports,n),o.loaded=!0,o.exports}var e={};return n.m=t,n.c=e,n.p="./",n(0)}([function(t,n,e){"use strict";function r(t){return t&&t.__esModule?t:{default:t}}function o(t,n){var e=/\/|index.html/g;return t.replace(e,"")===n.replace(e,"")}function i(){for(var t=document.querySelectorAll(".js-header-menu li a"),n=window.location.pathname,e=0,r=t.length;e<r;e++){var i=t[e];o(n,i.getAttribute("href"))&&(0,d.default)(i,"active")}}function u(t){for(var n=t.offsetLeft,e=t.offsetParent;null!==e;)n+=e.offsetLeft,e=e.offsetParent;return n}function f(t){for(var n=t.offsetTop,e=t.offsetParent;null!==e;)n+=e.offsetTop,e=e.offsetParent;return n}function c(t,n,e,r,o){var i=u(t),c=f(t)-n;if(c-e<=o){var a=t.$newDom;a||(a=t.cloneNode(!0),(0,h.default)(t,a),t.$newDom=a,a.style.position="fixed",a.style.top=(e||c)+"px",a.style.left=i+"px",a.style.zIndex=r||2,a.style.width="100%",a.style.color="#fff"),a.style.visibility="visible",t.style.visibility="hidden"}else{t.style.visibility="visible";var s=t.$newDom;s&&(s.style.visibility="hidden")}}function a(){var t=document.querySelector(".js-overlay"),n=document.querySelector(".js-header-menu");c(t,document.body.scrollTop,-63,2,0),c(n,document.body.scrollTop,1,3,0)}function s(){document.querySelector("#container").addEventListener("scroll",function(t){a()}),window.addEventListener("scroll",function(t){a()}),a()}function l(){x.default.versions.mobile&&window.screen.width<800&&(i(),s())}var p=e(71),d=r(p),v=e(72),y=(r(v),e(84)),h=r(y),b=e(69),x=r(b),m=e(75),g=r(m),w=e(70);l(),(0,w.addLoadEvent)(function(){g.default.init()}),t.exports={}},function(t,n){var e=t.exports="undefined"!=typeof window&&window.Math==Math?window:"undefined"!=typeof self&&self.Math==Math?self:Function("return this")();"number"==typeof __g&&(__g=e)},function(t,n){var e={}.hasOwnProperty;t.exports=function(t,n){return e.call(t,n)}},function(t,n,e){var r=e(49),o=e(15);t.exports=function(t){return r(o(t))}},function(t,n,e){t.exports=!e(8)(function(){return 7!=Object.defineProperty({},"a",{get:function(){return 7}}).a})},function(t,n,e){var r=e(6),o=e(12);t.exports=e(4)?function(t,n,e){return r.f(t,n,o(1,e))}:function(t,n,e){return t[n]=e,t}},function(t,n,e){var r=e(10),o=e(30),i=e(24),u=Object.defineProperty;n.f=e(4)?Object.defineProperty:function(t,n,e){if(r(t),n=i(n,!0),r(e),o)try{return u(t,n,e)}catch(t){}if("get"in e||"set"in e)throw TypeError("Accessors not supported!");return"value"in e&&(t[n]=e.value),t}},function(t,n,e){var r=e(22)("wks"),o=e(13),i=e(1).Symbol,u="function"==typeof i,f=t.exports=function(t){return r[t]||(r[t]=u&&i[t]||(u?i:o)("Symbol."+t))};f.store=r},function(t,n){t.exports=function(t){try{return!!t()}catch(t){return!0}}},function(t,n,e){var r=e(35),o=e(16);t.exports=Object.keys||function(t){return r(t,o)}},function(t,n,e){var r=e(11);t.exports=function(t){if(!r(t))throw TypeError(t+" is not an object!");return t}},function(t,n){t.exports=function(t){return"object"==typeof t?null!==t:"function"==typeof t}},function(t,n){t.exports=function(t,n){return{enumerable:!(1&t),configurable:!(2&t),writable:!(4&t),value:n}}},function(t,n){var e=0,r=Math.random();t.exports=function(t){return"Symbol(".concat(void 0===t?"":t,")_",(++e+r).toString(36))}},function(t,n){var e=t.exports={version:"2.4.0"};"number"==typeof __e&&(__e=e)},function(t,n){t.exports=function(t){if(void 0==t)throw TypeError("Can't call method on  "+t);return t}},function(t,n){t.exports="constructor,hasOwnProperty,isPrototypeOf,propertyIsEnumerable,toLocaleString,toString,valueOf".split(",")},function(t,n){t.exports={}},function(t,n){t.exports=!0},function(t,n){n.f={}.propertyIsEnumerable},function(t,n,e){var r=e(6).f,o=e(2),i=e(7)("toStringTag");t.exports=function(t,n,e){t&&!o(t=e?t:t.prototype,i)&&r(t,i,{configurable:!0,value:n})}},function(t,n,e){var r=e(22)("keys"),o=e(13);t.exports=function(t){return r[t]||(r[t]=o(t))}},function(t,n,e){var r=e(1),o="__core-js_shared__",i=r[o]||(r[o]={});t.exports=function(t){return i[t]||(i[t]={})}},function(t,n){var e=Math.ceil,r=Math.floor;t.exports=function(t){return isNaN(t=+t)?0:(t>0?r:e)(t)}},function(t,n,e){var r=e(11);t.exports=function(t,n){if(!r(t))return t;var e,o;if(n&&"function"==typeof(e=t.toString)&&!r(o=e.call(t)))return o;if("function"==typeof(e=t.valueOf)&&!r(o=e.call(t)))return o;if(!n&&"function"==typeof(e=t.toString)&&!r(o=e.call(t)))return o;throw TypeError("Can't convert object to primitive value")}},function(t,n,e){var r=e(1),o=e(14),i=e(18),u=e(26),f=e(6).f;t.exports=function(t){var n=o.Symbol||(o.Symbol=i?{}:r.Symbol||{});"_"==t.charAt(0)||t in n||f(n,t,{value:u.f(t)})}},function(t,n,e){n.f=e(7)},function(t,n,e){var r=e(1),o=e(14),i=e(46),u=e(5),f="prototype",c=function(t,n,e){var a,s,l,p=t&c.F,d=t&c.G,v=t&c.S,y=t&c.P,h=t&c.B,b=t&c.W,x=d?o:o[n]||(o[n]={}),m=x[f],g=d?r:v?r[n]:(r[n]||{})[f];d&&(e=n);for(a in e)s=!p&&g&&void 0!==g[a],s&&a in x||(l=s?g[a]:e[a],x[a]=d&&"function"!=typeof g[a]?e[a]:h&&s?i(l,r):b&&g[a]==l?function(t){var n=function(n,e,r){if(this instanceof t){switch(arguments.length){case 0:return new t;case 1:return new t(n);case 2:return new t(n,e)}return new t(n,e,r)}return t.apply(this,arguments)};return n[f]=t[f],n}(l):y&&"function"==typeof l?i(Function.call,l):l,y&&((x.virtual||(x.virtual={}))[a]=l,t&c.R&&m&&!m[a]&&u(m,a,l)))};c.F=1,c.G=2,c.S=4,c.P=8,c.B=16,c.W=32,c.U=64,c.R=128,t.exports=c},function(t,n){var e={}.toString;t.exports=function(t){return e.call(t).slice(8,-1)}},function(t,n,e){var r=e(11),o=e(1).document,i=r(o)&&r(o.createElement);t.exports=function(t){return i?o.createElement(t):{}}},function(t,n,e){t.exports=!e(4)&&!e(8)(function(){return 7!=Object.defineProperty(e(29)("div"),"a",{get:function(){return 7}}).a})},function(t,n,e){"use strict";var r=e(18),o=e(27),i=e(36),u=e(5),f=e(2),c=e(17),a=e(51),s=e(20),l=e(58),p=e(7)("iterator"),d=!([].keys&&"next"in[].keys()),v="@@iterator",y="keys",h="values",b=function(){return this};t.exports=function(t,n,e,x,m,g,w){a(e,n,x);var O,S,_,j=function(t){if(!d&&t in A)return A[t];switch(t){case y:return function(){return new e(this,t)};case h:return function(){return new e(this,t)}}return function(){return new e(this,t)}},P=n+" Iterator",E=m==h,M=!1,A=t.prototype,T=A[p]||A[v]||m&&A[m],L=T||j(m),N=m?E?j("entries"):L:void 0,C="Array"==n?A.entries||T:T;if(C&&(_=l(C.call(new t)),_!==Object.prototype&&(s(_,P,!0),r||f(_,p)||u(_,p,b))),E&&T&&T.name!==h&&(M=!0,L=function(){return T.call(this)}),r&&!w||!d&&!M&&A[p]||u(A,p,L),c[n]=L,c[P]=b,m)if(O={values:E?L:j(h),keys:g?L:j(y),entries:N},w)for(S in O)S in A||i(A,S,O[S]);else o(o.P+o.F*(d||M),n,O);return O}},function(t,n,e){var r=e(10),o=e(55),i=e(16),u=e(21)("IE_PROTO"),f=function(){},c="prototype",a=function(){var t,n=e(29)("iframe"),r=i.length,o="<",u=">";for(n.style.display="none",e(48).appendChild(n),n.src="javascript:",t=n.contentWindow.document,t.open(),t.write(o+"script"+u+"document.F=Object"+o+"/script"+u),t.close(),a=t.F;r--;)delete a[c][i[r]];return a()};t.exports=Object.create||function(t,n){var e;return null!==t?(f[c]=r(t),e=new f,f[c]=null,e[u]=t):e=a(),void 0===n?e:o(e,n)}},function(t,n,e){var r=e(35),o=e(16).concat("length","prototype");n.f=Object.getOwnPropertyNames||function(t){return r(t,o)}},function(t,n){n.f=Object.getOwnPropertySymbols},function(t,n,e){var r=e(2),o=e(3),i=e(45)(!1),u=e(21)("IE_PROTO");t.exports=function(t,n){var e,f=o(t),c=0,a=[];for(e in f)e!=u&&r(f,e)&&a.push(e);for(;n.length>c;)r(f,e=n[c++])&&(~i(a,e)||a.push(e));return a}},function(t,n,e){t.exports=e(5)},function(t,n,e){var r=e(15);t.exports=function(t){return Object(r(t))}},function(t,n,e){t.exports={default:e(41),__esModule:!0}},function(t,n,e){t.exports={default:e(42),__esModule:!0}},function(t,n,e){"use strict";function r(t){return t&&t.__esModule?t:{default:t}}n.__esModule=!0;var o=e(39),i=r(o),u=e(38),f=r(u),c="function"==typeof f.default&&"symbol"==typeof i.default?function(t){return typeof t}:function(t){return t&&"function"==typeof f.default&&t.constructor===f.default&&t!==f.default.prototype?"symbol":typeof t};n.default="function"==typeof f.default&&"symbol"===c(i.default)?function(t){return"undefined"==typeof t?"undefined":c(t)}:function(t){return t&&"function"==typeof f.default&&t.constructor===f.default&&t!==f.default.prototype?"symbol":"undefined"==typeof t?"undefined":c(t)}},function(t,n,e){e(65),e(63),e(66),e(67),t.exports=e(14).Symbol},function(t,n,e){e(64),e(68),t.exports=e(26).f("iterator")},function(t,n){t.exports=function(t){if("function"!=typeof t)throw TypeError(t+" is not a function!");return t}},function(t,n){t.exports=function(){}},function(t,n,e){var r=e(3),o=e(61),i=e(60);t.exports=function(t){return function(n,e,u){var f,c=r(n),a=o(c.length),s=i(u,a);if(t&&e!=e){for(;a>s;)if(f=c[s++],f!=f)return!0}else for(;a>s;s++)if((t||s in c)&&c[s]===e)return t||s||0;return!t&&-1}}},function(t,n,e){var r=e(43);t.exports=function(t,n,e){if(r(t),void 0===n)return t;switch(e){case 1:return function(e){return t.call(n,e)};case 2:return function(e,r){return t.call(n,e,r)};case 3:return function(e,r,o){return t.call(n,e,r,o)}}return function(){return t.apply(n,arguments)}}},function(t,n,e){var r=e(9),o=e(34),i=e(19);t.exports=function(t){var n=r(t),e=o.f;if(e)for(var u,f=e(t),c=i.f,a=0;f.length>a;)c.call(t,u=f[a++])&&n.push(u);return n}},function(t,n,e){t.exports=e(1).document&&document.documentElement},function(t,n,e){var r=e(28);t.exports=Object("z").propertyIsEnumerable(0)?Object:function(t){return"String"==r(t)?t.split(""):Object(t)}},function(t,n,e){var r=e(28);t.exports=Array.isArray||function(t){return"Array"==r(t)}},function(t,n,e){"use strict";var r=e(32),o=e(12),i=e(20),u={};e(5)(u,e(7)("iterator"),function(){return this}),t.exports=function(t,n,e){t.prototype=r(u,{next:o(1,e)}),i(t,n+" Iterator")}},function(t,n){t.exports=function(t,n){return{value:n,done:!!t}}},function(t,n,e){var r=e(9),o=e(3);t.exports=function(t,n){for(var e,i=o(t),u=r(i),f=u.length,c=0;f>c;)if(i[e=u[c++]]===n)return e}},function(t,n,e){var r=e(13)("meta"),o=e(11),i=e(2),u=e(6).f,f=0,c=Object.isExtensible||function(){return!0},a=!e(8)(function(){return c(Object.preventExtensions({}))}),s=function(t){u(t,r,{value:{i:"O"+ ++f,w:{}}})},l=function(t,n){if(!o(t))return"symbol"==typeof t?t:("string"==typeof t?"S":"P")+t;if(!i(t,r)){if(!c(t))return"F";if(!n)return"E";s(t)}return t[r].i},p=function(t,n){if(!i(t,r)){if(!c(t))return!0;if(!n)return!1;s(t)}return t[r].w},d=function(t){return a&&v.NEED&&c(t)&&!i(t,r)&&s(t),t},v=t.exports={KEY:r,NEED:!1,fastKey:l,getWeak:p,onFreeze:d}},function(t,n,e){var r=e(6),o=e(10),i=e(9);t.exports=e(4)?Object.defineProperties:function(t,n){o(t);for(var e,u=i(n),f=u.length,c=0;f>c;)r.f(t,e=u[c++],n[e]);return t}},function(t,n,e){var r=e(19),o=e(12),i=e(3),u=e(24),f=e(2),c=e(30),a=Object.getOwnPropertyDescriptor;n.f=e(4)?a:function(t,n){if(t=i(t),n=u(n,!0),c)try{return a(t,n)}catch(t){}if(f(t,n))return o(!r.f.call(t,n),t[n])}},function(t,n,e){var r=e(3),o=e(33).f,i={}.toString,u="object"==typeof window&&window&&Object.getOwnPropertyNames?Object.getOwnPropertyNames(window):[],f=function(t){try{return o(t)}catch(t){return u.slice()}};t.exports.f=function(t){return u&&"[object Window]"==i.call(t)?f(t):o(r(t))}},function(t,n,e){var r=e(2),o=e(37),i=e(21)("IE_PROTO"),u=Object.prototype;t.exports=Object.getPrototypeOf||function(t){return t=o(t),r(t,i)?t[i]:"function"==typeof t.constructor&&t instanceof t.constructor?t.constructor.prototype:t instanceof Object?u:null}},function(t,n,e){var r=e(23),o=e(15);t.exports=function(t){return function(n,e){var i,u,f=String(o(n)),c=r(e),a=f.length;return c<0||c>=a?t?"":void 0:(i=f.charCodeAt(c),i<55296||i>56319||c+1===a||(u=f.charCodeAt(c+1))<56320||u>57343?t?f.charAt(c):i:t?f.slice(c,c+2):(i-55296<<10)+(u-56320)+65536)}}},function(t,n,e){var r=e(23),o=Math.max,i=Math.min;t.exports=function(t,n){return t=r(t),t<0?o(t+n,0):i(t,n)}},function(t,n,e){var r=e(23),o=Math.min;t.exports=function(t){return t>0?o(r(t),9007199254740991):0}},function(t,n,e){"use strict";var r=e(44),o=e(52),i=e(17),u=e(3);t.exports=e(31)(Array,"Array",function(t,n){this._t=u(t),this._i=0,this._k=n},function(){var t=this._t,n=this._k,e=this._i++;return!t||e>=t.length?(this._t=void 0,o(1)):"keys"==n?o(0,e):"values"==n?o(0,t[e]):o(0,[e,t[e]])},"values"),i.Arguments=i.Array,r("keys"),r("values"),r("entries")},function(t,n){},function(t,n,e){"use strict";var r=e(59)(!0);e(31)(String,"String",function(t){this._t=String(t),this._i=0},function(){var t,n=this._t,e=this._i;return e>=n.length?{value:void 0,done:!0}:(t=r(n,e),this._i+=t.length,{value:t,done:!1})})},function(t,n,e){"use strict";var r=e(1),o=e(2),i=e(4),u=e(27),f=e(36),c=e(54).KEY,a=e(8),s=e(22),l=e(20),p=e(13),d=e(7),v=e(26),y=e(25),h=e(53),b=e(47),x=e(50),m=e(10),g=e(3),w=e(24),O=e(12),S=e(32),_=e(57),j=e(56),P=e(6),E=e(9),M=j.f,A=P.f,T=_.f,L=r.Symbol,N=r.JSON,C=N&&N.stringify,k="prototype",F=d("_hidden"),q=d("toPrimitive"),I={}.propertyIsEnumerable,B=s("symbol-registry"),D=s("symbols"),W=s("op-symbols"),H=Object[k],K="function"==typeof L,R=r.QObject,J=!R||!R[k]||!R[k].findChild,U=i&&a(function(){return 7!=S(A({},"a",{get:function(){return A(this,"a",{value:7}).a}})).a})?function(t,n,e){var r=M(H,n);r&&delete H[n],A(t,n,e),r&&t!==H&&A(H,n,r)}:A,G=function(t){var n=D[t]=S(L[k]);return n._k=t,n},$=K&&"symbol"==typeof L.iterator?function(t){return"symbol"==typeof t}:function(t){return t instanceof L},z=function(t,n,e){return t===H&&z(W,n,e),m(t),n=w(n,!0),m(e),o(D,n)?(e.enumerable?(o(t,F)&&t[F][n]&&(t[F][n]=!1),e=S(e,{enumerable:O(0,!1)})):(o(t,F)||A(t,F,O(1,{})),t[F][n]=!0),U(t,n,e)):A(t,n,e)},Y=function(t,n){m(t);for(var e,r=b(n=g(n)),o=0,i=r.length;i>o;)z(t,e=r[o++],n[e]);return t},Q=function(t,n){return void 0===n?S(t):Y(S(t),n)},X=function(t){var n=I.call(this,t=w(t,!0));return!(this===H&&o(D,t)&&!o(W,t))&&(!(n||!o(this,t)||!o(D,t)||o(this,F)&&this[F][t])||n)},V=function(t,n){if(t=g(t),n=w(n,!0),t!==H||!o(D,n)||o(W,n)){var e=M(t,n);return!e||!o(D,n)||o(t,F)&&t[F][n]||(e.enumerable=!0),e}},Z=function(t){for(var n,e=T(g(t)),r=[],i=0;e.length>i;)o(D,n=e[i++])||n==F||n==c||r.push(n);return r},tt=function(t){for(var n,e=t===H,r=T(e?W:g(t)),i=[],u=0;r.length>u;)!o(D,n=r[u++])||e&&!o(H,n)||i.push(D[n]);return i};K||(L=function(){if(this instanceof L)throw TypeError("Symbol is not a constructor!");var t=p(arguments.length>0?arguments[0]:void 0),n=function(e){this===H&&n.call(W,e),o(this,F)&&o(this[F],t)&&(this[F][t]=!1),U(this,t,O(1,e))};return i&&J&&U(H,t,{configurable:!0,set:n}),G(t)},f(L[k],"toString",function(){return this._k}),j.f=V,P.f=z,e(33).f=_.f=Z,e(19).f=X,e(34).f=tt,i&&!e(18)&&f(H,"propertyIsEnumerable",X,!0),v.f=function(t){return G(d(t))}),u(u.G+u.W+u.F*!K,{Symbol:L});for(var nt="hasInstance,isConcatSpreadable,iterator,match,replace,search,species,split,toPrimitive,toStringTag,unscopables".split(","),et=0;nt.length>et;)d(nt[et++]);for(var nt=E(d.store),et=0;nt.length>et;)y(nt[et++]);u(u.S+u.F*!K,"Symbol",{for:function(t){return o(B,t+="")?B[t]:B[t]=L(t)},keyFor:function(t){if($(t))return h(B,t);throw TypeError(t+" is not a symbol!")},useSetter:function(){J=!0},useSimple:function(){J=!1}}),u(u.S+u.F*!K,"Object",{create:Q,defineProperty:z,defineProperties:Y,getOwnPropertyDescriptor:V,getOwnPropertyNames:Z,getOwnPropertySymbols:tt}),N&&u(u.S+u.F*(!K||a(function(){var t=L();return"[null]"!=C([t])||"{}"!=C({a:t})||"{}"!=C(Object(t))})),"JSON",{stringify:function(t){if(void 0!==t&&!$(t)){for(var n,e,r=[t],o=1;arguments.length>o;)r.push(arguments[o++]);return n=r[1],"function"==typeof n&&(e=n),!e&&x(n)||(n=function(t,n){if(e&&(n=e.call(this,t,n)),!$(n))return n}),r[1]=n,C.apply(N,r)}}}),L[k][q]||e(5)(L[k],q,L[k].valueOf),l(L,"Symbol"),l(Math,"Math",!0),l(r.JSON,"JSON",!0)},function(t,n,e){e(25)("asyncIterator")},function(t,n,e){e(25)("observable")},function(t,n,e){e(62);for(var r=e(1),o=e(5),i=e(17),u=e(7)("toStringTag"),f=["NodeList","DOMTokenList","MediaList","StyleSheetList","CSSRuleList"],c=0;c<5;c++){var a=f[c],s=r[a],l=s&&s.prototype;l&&!l[u]&&o(l,u,a),i[a]=i.Array}},function(t,n){"use strict";var e={versions:function(){var t=window.navigator.userAgent;return{trident:t.indexOf("Trident")>-1,presto:t.indexOf("Presto")>-1,webKit:t.indexOf("AppleWebKit")>-1,gecko:t.indexOf("Gecko")>-1&&t.indexOf("KHTML")==-1,mobile:!!t.match(/AppleWebKit.*Mobile.*/),ios:!!t.match(/\(i[^;]+;( U;)? CPU.+Mac OS X/),android:t.indexOf("Android")>-1||t.indexOf("Linux")>-1,iPhone:t.indexOf("iPhone")>-1||t.indexOf("Mac")>-1,iPad:t.indexOf("iPad")>-1,webApp:t.indexOf("Safari")==-1,weixin:t.indexOf("MicroMessenger")==-1}}()};t.exports=e},function(t,n,e){"use strict";function r(t){return t&&t.__esModule?t:{default:t}}var o=e(40),i=r(o),u=function(){function t(t,n,e){return n||e?String.fromCharCode(n||e):o[t]||t}function n(t){return l[t]}var e=/&quot;|&lt;|&gt;|&amp;|&nbsp;|&apos;|&#(\d+);|&#(\d+)/g,r=/['<> "&]/g,o={"&quot;":'"',"&lt;":"<","&gt;":">","&amp;":"&","&nbsp;":" "},f=/\u00a0/g,c=/<br\s*\/?>/gi,a=/\r?\n/g,s=/\s/g,l={};for(var p in o)l[o[p]]=p;return o["&apos;"]="'",l["'"]="&#39;",{encode:function(t){return t?(""+t).replace(r,n).replace(a,"<br/>").replace(s,"&nbsp;"):""},decode:function(n){return n?(""+n).replace(c,"\n").replace(e,t).replace(f," "):""},encodeBase16:function(t){if(!t)return t;t+="";for(var n=[],e=0,r=t.length;r>e;e++)n.push(t.charCodeAt(e).toString(16).toUpperCase());return n.join("")},encodeBase16forJSON:function(t){if(!t)return t;t=t.replace(/[\u4E00-\u9FBF]/gi,function(t){return escape(t).replace("%u","\\u")});for(var n=[],e=0,r=t.length;r>e;e++)n.push(t.charCodeAt(e).toString(16).toUpperCase());return n.join("")},decodeBase16:function(t){if(!t)return t;t+="";for(var n=[],e=0,r=t.length;r>e;e+=2)n.push(String.fromCharCode("0x"+t.slice(e,e+2)));return n.join("")},encodeObject:function(t){if(t instanceof Array)for(var n=0,e=t.length;e>n;n++)t[n]=u.encodeObject(t[n]);else if("object"==("undefined"==typeof t?"undefined":(0,i.default)(t)))for(var r in t)t[r]=u.encodeObject(t[r]);else if("string"==typeof t)return u.encode(t);return t},loadScript:function(t){var n=document.createElement("script");document.getElementsByTagName("body")[0].appendChild(n),n.setAttribute("src",t)},addLoadEvent:function(t){var n=window.onload;"function"!=typeof window.onload?window.onload=t:window.onload=function(){n(),t()}}}}();t.exports=u},function(t,n){function e(t,n){t.classList?t.classList.add(n):t.className+=" "+n}t.exports=e},function(t,n){function e(t,n){if(t.classList)t.classList.remove(n);else{var e=new RegExp("(^|\\b)"+n.split(" ").join("|")+"(\\b|$)","gi");t.className=t.className.replace(e," ")}}t.exports=e},,,function(t,n){"use strict";function e(){var t=document.querySelector("#page-nav");if(t&&!document.querySelector("#page-nav .extend.prev")&&(t.innerHTML='<a class="extend prev disabled" rel="prev">&laquo; Prev</a>'+t.innerHTML),t&&!document.querySelector("#page-nav .extend.next")&&(t.innerHTML=t.innerHTML+'<a class="extend next disabled" rel="next">Next &raquo;</a>'),yiliaConfig&&yiliaConfig.open_in_new){var n=document.querySelectorAll(".article-entry a:not(.article-more-a)");n.forEach(function(t){t.setAttribute("target","_blank")})}var e=document.querySelector("#js-aboutme");e&&0!==e.length&&(e.innerHTML=e.innerText)}t.exports={init:e}},,,,,,,,,function(t,n){function e(t,n){if("string"==typeof n)return t.insertAdjacentHTML("afterend",n);var e=t.nextSibling;return e?t.parentNode.insertBefore(n,e):t.parentNode.appendChild(n)}t.exports=e}])</script><script src="/./main.2d7529.js"></script><script>!function(){var e=function(e){var t=document.createElement("script");document.getElementsByTagName("body")[0].appendChild(t),t.setAttribute("src",e)};e("/slider.885efe.js")}()</script>


    
<div class="tools-col" q-class="show:isShow,hide:isShow|isFalse" q-on="click:stop(e)">
  <div class="tools-nav header-menu">
    
    
      
      
      
    
      
      
      
    
      
      
      
    
    

    <ul style="width: 70%">
    
    
      
      <li style="width: 33.333333333333336%" q-on="click: openSlider(e, 'innerArchive')"><a href="javascript:void(0)" q-class="active:innerArchive">所有文章</a></li>
      
        
      
      <li style="width: 33.333333333333336%" q-on="click: openSlider(e, 'friends')"><a href="javascript:void(0)" q-class="active:friends">友链</a></li>
      
        
      
      <li style="width: 33.333333333333336%" q-on="click: openSlider(e, 'aboutme')"><a href="javascript:void(0)" q-class="active:aboutme">关于我</a></li>
      
        
    </ul>
  </div>
  <div class="tools-wrap">
    
    	<section class="tools-section tools-section-all" q-show="innerArchive">
        <div class="search-wrap">
          <input class="search-ipt" q-model="search" type="text" placeholder="find something…">
          <i class="icon-search icon" q-show="search|isEmptyStr"></i>
          <i class="icon-close icon" q-show="search|isNotEmptyStr" q-on="click:clearChose(e)"></i>
        </div>
        <div class="widget tagcloud search-tag">
          <p class="search-tag-wording">tag:</p>
          <label class="search-switch">
            <input type="checkbox" q-on="click:toggleTag(e)" q-attr="checked:showTags">
          </label>
          <ul class="article-tag-list" q-show="showTags">
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color3">OA</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color2">Docker</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color2">Hadoop</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">Yarn</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">Zookeeper</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color1">真实的生命</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color1">Essay</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">Advanced Cloud Computing</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color4">Distributed System</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color4">CMU</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color2">Google</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color4">LeetCode</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color2">Medium</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color2">String</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color2">Design</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">Tree</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">Java</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">Sort</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">Interview</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">Easy</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color1">Queue</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">tree</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color2">Python</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color4">Facebook</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color1">Array</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color2">Bit Manipulation</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color3">Backtracking</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color2">Matrix</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">MicroSoft</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">Dynamic Programming</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color4">Binary Search</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color1">Hash Table</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color1">Stack</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color3">Two pointers</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">Data Structure</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color1">emacs</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">Blog</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color3">食物</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color4">李宗盛</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">香港电影</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">六楼后座</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color4">markdown</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color5">Math</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color1">10601</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color1">MachineLearning</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color3">Statics</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color1">Cloud Computing</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color2">python</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)" class="js-tag color2">Career</a>
              </li>
            
            <div class="clearfix"></div>
          </ul>
        </div>
        <ul class="search-ul">
          <p q-show="jsonFail" style="padding: 20px; font-size: 12px;">
            缺失模块。<br/>1、在博客根目录（注意不是yilia根目录）执行以下命令：<br/> npm i hexo-generator-json-content --save<br/><br/>
            2、在根目录_config.yml里添加配置：
<pre style="font-size: 12px;" q-show="jsonFail">
  jsonContent:
    meta: false
    pages: false
    posts:
      title: true
      date: true
      path: true
      text: true
      raw: false
      content: false
      slug: false
      updated: false
      comments: false
      link: false
      permalink: false
      excerpt: false
      categories: false
      tags: true
</pre>
          </p>
          <li class="search-li" q-repeat="items" q-show="isShow">
            <a q-attr="href:path|urlformat" class="search-title"><i class="icon-quo-left icon"></i><span q-text="title"></span></a>
            <p class="search-time">
              <i class="icon-calendar icon"></i>
              <span q-text="date|dateformat"></span>
            </p>
            <p class="search-tag">
              <i class="icon-price-tags icon"></i>
              <span q-repeat="tags" q-on="click:choseTag(e, name)" q-text="name|tagformat"></span>
            </p>
          </li>
        </ul>
    	</section>
    

    
    	<section class="tools-section tools-section-friends" q-show="friends">
  		
        <ul class="search-ul">
          
            <li class="search-li">
              <a href="http://localhost:4000/" target="_blank" class="search-title"><i class="icon-quo-left icon"></i>友情链接1</a>
            </li>
          
            <li class="search-li">
              <a href="http://localhost:4000/" target="_blank" class="search-title"><i class="icon-quo-left icon"></i>友情链接2</a>
            </li>
          
            <li class="search-li">
              <a href="http://localhost:4000/" target="_blank" class="search-title"><i class="icon-quo-left icon"></i>友情链接3</a>
            </li>
          
            <li class="search-li">
              <a href="http://localhost:4000/" target="_blank" class="search-title"><i class="icon-quo-left icon"></i>友情链接4</a>
            </li>
          
            <li class="search-li">
              <a href="http://localhost:4000/" target="_blank" class="search-title"><i class="icon-quo-left icon"></i>友情链接5</a>
            </li>
          
            <li class="search-li">
              <a href="http://localhost:4000/" target="_blank" class="search-title"><i class="icon-quo-left icon"></i>友情链接6</a>
            </li>
          
        </ul>
  		
    	</section>
    

    
    	<section class="tools-section tools-section-me" q-show="aboutme">
  	  	
  	  		<div class="aboutme-wrap" id="js-aboutme">很惭愧&lt;br&gt;&lt;br&gt;只做了一点微小的工作&lt;br&gt;谢谢大家</div>
  	  	
    	</section>
    
  </div>
  
</div>
    <!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">

    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>

    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">

        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>

        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">

            <div class="pswp__top-bar">

                <!--  Controls are self-explanatory. Order can be changed. -->

                <div class="pswp__counter"></div>

                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>

                <button class="pswp__button pswp__button--share" style="display:none" title="Share"></button>

                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>

                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>

                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                      <div class="pswp__preloader__cut">
                        <div class="pswp__preloader__donut"></div>
                      </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div> 
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>

        </div>

    </div>

</div>
  </div><!-- hexo-inject:begin --><!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config({"tex2jax":{"inlineMath":[["$","$"],["\\(","\\)"]],"skipTags":["script","noscript","style","textarea","pre","code"],"processEscapes":true},"TeX":{"equationNumbers":{"autoNumber":"AMS"}}});
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
<!-- End: Injected MathJax -->
<!-- hexo-inject:end -->
</body>
</html>