
<!DOCTYPE html>
<html lang="en">
    
<head>
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="generator" content="Star">
    <title>Archives: 2016/8 - Star</title>
    <meta name="author" content="Star">
    
    
    
        <link rel="alternate" type="application/atom+xml" title="RSS" href="/atom.xml">
    
    <meta name="description" content="不要温和地走进那个良夜。@CMU">
<meta property="og:type" content="blog">
<meta property="og:title" content="Star">
<meta property="og:url" content="http://yoursite.com/archives/2016/08/index.html">
<meta property="og:site_name" content="Star">
<meta property="og:description" content="不要温和地走进那个良夜。@CMU">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Star">
<meta name="twitter:description" content="不要温和地走进那个良夜。@CMU">
    
    
        
    
    
    
    
    
    <!--STYLES-->
    <link rel="stylesheet" href="/assets/css/style-yrst5vo1nxaxbp2g3v9na2wg1lixlpr3ghbjdvskeixmu79deycecx3rh4bt.min.css">
    <!--STYLES END--><!-- hexo-inject:begin --><!-- hexo-inject:end -->
    
    
</head>

    <body>
        <!-- hexo-inject:begin --><!-- hexo-inject:end --><div id="blog">
            <!-- Define author's picture -->


    

<header id="header" data-behavior="1">
    <i id="btn-open-sidebar" class="fa fa-lg fa-bars"></i>
    <div class="header-title">
        <a class="header-title-link" href="/ ">Star</a>
    </div>
    
        
            <a  class="header-right-picture "
                href="#about">
        
        
        </a>
    
</header>

            <!-- Define author's picture -->


<nav id="sidebar" data-behavior="1">
    <div class="sidebar-container">
        
        
            <ul class="sidebar-buttons">
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/ "
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-home"></i>
                        <span class="sidebar-button-desc">Home</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/all-categories"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-bookmark"></i>
                        <span class="sidebar-button-desc">Categories</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/all-tags"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-tags"></i>
                        <span class="sidebar-button-desc">Tags</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/all-archives"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-archive"></i>
                        <span class="sidebar-button-desc">Archives</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link open-algolia-search"
                             href="#search"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-search"></i>
                        <span class="sidebar-button-desc">Search</span>
                    </a>
            </li>
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="#about"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-question"></i>
                        <span class="sidebar-button-desc">About</span>
                    </a>
            </li>
            
        </ul>
        
            <ul class="sidebar-buttons">
            
        </ul>
        
            <ul class="sidebar-buttons">
            
                <li class="sidebar-button">
                    
                        <a  class="sidebar-button-link "
                             href="/atom.xml"
                            
                        >
                    
                        <i class="sidebar-button-icon fa fa-lg fa-rss"></i>
                        <span class="sidebar-button-desc">RSS</span>
                    </a>
            </li>
            
        </ul>
        
    </div>
</nav>

            
            <div id="main" data-behavior="1"
                 class="
                        hasCoverMetaIn
                        ">
                
    <section class="postShorten-group main-content-wrap">
    
    
    <article class="postShorten postShorten--thumbnailimg-bottom" itemscope itemType="http://schema.org/BlogPosting">
        <div class="postShorten-wrap">
            
            <div class="postShorten-header">
                <h1 class="postShorten-title" itemprop="headline">
                    
                        <a class="link-unstyled" href="/2016/08/27/e6-98-8e-e5-a4-a9-e4-b8-80-e5-88-87-e5-a5-bd-e8-af-b4/">
                            明天一切好说
                        </a>
                    
                </h1>
                <div class="postShorten-meta">
    <time itemprop="datePublished" datetime="2016-08-27T13:29:32-04:00">
	
		    Aug 27, 2016
    	
    </time>
    
        <span>in </span>
        
    <a class="category-link" href="/categories/真实的生命/">真实的生命</a>


    
</div>

            </div>
            
                <div class="postShorten-content" itemprop="articleBody">
                    <script src="/assets/js/DPlayer.min.js"> </script><p>&#xA0;</p>
<p>&#xA0; &#xA0; &#xA0; &#x843D;&#x5730;&#x706F;&#x6E29;&#x548C;&#x5730;&#x4EAE;&#x7740;&#xFF0C;&#x6536;&#x62FE;&#x597D;&#x5367;&#x5BA4;&#xFF0C;&#x6446;&#x597D;&#x8863;&#x67B6;&#xFF0C;&#x53A8;&#x623F;&#x9910;&#x5177;&#x6446;&#x597D;&#xFF0C;&#x624D;&#x7EC8;&#x4E8E;&#x6709;&#x65F6;&#x95F4;&#x5750;&#x5728;&#x81EA;&#x5DF1;&#x62FC;&#x7684;&#x6C99;&#x53D1;&#x4E0A;&#x548C;&#x5BA4;&#x53CB;&#x8BB2;&#x51E0;&#x53E5;&#x8BDD;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#x6765;&#x4E86;&#x4E00;&#x5468;&#x591A;&#x4E00;&#x4E9B;&#xFF0C;&#x51E0;&#x4E4E;&#x90FD;&#x5728;&#x75B2;&#x4E8E;&#x5E94;&#x4ED8;&#x4E00;&#x4E2A;&#x5B89;&#x8EAB;&#x7ACB;&#x547D;&#x7684;&#x5730;&#x65B9;&#x3002;&#x60F3;&#x6765;&#xFF0C;&#x88AB;&#x6D77;&#x5173;&#x5173;&#x8FC7;&#x5C0F;&#x9ED1;&#x5C4B;&#xFF0C;&#x88AB;&#x623F;&#x5C4B;manager&#x543C;&#x8FC7;&#xFF0C;&#x88AB;&#x4E0D;&#x9760;&#x8C31;&#x7684;&#x7BA1;&#x7406;&#x4EBA;&#x5458;&#x653E;&#x9E3D;&#x5B50;&#xFF0C;&#x88AB;&#x8BA1;&#x5212;&#x4E2D;&#x7684;&#x5BA4;&#x53CB;&#x5751;&#x5F97;&#x63AA;&#x624B;&#x4E0D;&#x53CA;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#x521A;&#x5230;&#x5339;&#x5179;&#x5821;&#xFF0C;&#x7B2C;&#x4E09;&#x6B21;&#x8DD1;&#x5230;&#x81EA;&#x5DF1;&#x56DB;&#x6708;&#x4EFD;&#x5C31;&#x79DF;&#x4E0B;&#x6765;&#x7684;&#x516C;&#x5BD3;&#x5374;&#x8FD8;&#x662F;&#x62FF;&#x4E0D;&#x5230;&#x94A5;&#x5319;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x5728;&#x516C;&#x4EA4;&#x7AD9;&#x53F0;&#xFF0C;&#x5DEE;&#x70B9;&#x5C31;&#x54ED;&#x51FA;&#x6765;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0;&#x540E;&#x6765;&#x4E5F;&#x6CA1;&#x6709;&#x54ED;&#xFF0C;&#x5FC3;&#x91CC;&#x89C9;&#x5F97;&#x4E0D;&#x503C;&#x5F97;&#xFF0C;&#x81EA;&#x5DF1;&#x63D0;&#x524D;&#x5B9A;&#x4E86;&#x5408;&#x7EA6;&#xFF0C;&#x6253;&#x8FC7;&#x7535;&#x8BDD;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8FC7;&#x9519;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x662F;&#x6211;&#x8981;&#x54ED;&#x3002;&#x6709;&#x95EE;&#x9898;&#x5C31;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x597D;&#x4E86;&#xFF0C;&#x4E0D;&#x7ED9;&#x6211;&#x6211;&#x5C31;&#x4E00;&#x76F4;&#x6253;&#x7535;&#x8BDD;&#xFF0C;&#x4E00;&#x76F4;&#x6765;&#xFF0C;&#x8017;&#x4E0B;&#x53BB;&#x3002;&#x8FD9;&#x4E48;&#x60F3;&#x7740;&#xFF0C;&#x773C;&#x6CEA;&#x8FD8;&#x662F;&#x6253;&#x4E86;&#x4E2A;&#x8F6C;&#x3002;&#x773C;&#x524D;&#x662F;&#x6559;&#x5802;&#xFF0C;&#x5BF9;&#x9762;&#x662F;&#x94F6;&#x884C;&#xFF0C;&#x6765;&#x5F80;&#x7684;&#x8F66;&#x8F86;&#x91CC;&#x8FD8;&#x6709;&#x7279;&#x65AF;&#x62C9;&#x3002;&#x771F;&#x4E0D;&#x6562;&#x76F8;&#x4FE1;&#xFF0C;&#x8FD9;&#x91CC;&#x662F;&#x7F8E;&#x56FD;&#x554A;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0;&#x7EC8;&#x4E8E;&#x62FF;&#x5230;&#x4E86;&#x94A5;&#x5319;&#xFF0C;&#x6FC0;&#x52A8;&#x5F97;&#x53BB;&#x4E2D;&#x9910;&#x9986;&#x5403;&#x4E86;&#x4E00;&#x7897;&#x725B;&#x8089;&#x9762;&#xFF0C;&#x548C;&#x4E00;&#x8D77;&#x7684;&#x59D1;&#x5A18;&#x8BF4;&#x8D77;&#x665A;&#x4E0A;&#x60F3;&#x53BB;&#x63A5;yuki&#xFF0C;&#x5979;&#x8BF4;&#x4F60;&#x81EA;&#x5DF1;&#x90FD;&#x6CA1;&#x7167;&#x987E;&#x597D;&#xFF0C;&#x8FD8;&#x7BA1;&#x522B;&#x4EBA;&#x3002;&#x54C7;&#x5730;&#x4E00;&#x4E0B;&#xFF0C;&#x5FC3;&#x91CC;&#x611F;&#x89C9;&#x88AB;&#x523A;&#x5230;&#x4E86;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x8BB0;&#x5F97;&#x5927;&#x56DB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x820D;&#x53CB;&#x90FD;&#x4E0D;&#x5728;&#xFF0C;&#x5BBF;&#x820D;&#x9ED1;&#x4E86;&#xFF0C;&#x6211;&#x624D;&#x53D1;&#x73B0;&#x56DB;&#x5E74;&#x6211;&#x4ECE;&#x6765;&#x6CA1;&#x53BB;&#x5145;&#x8FC7;&#x4E00;&#x6B21;&#x7535;&#x3002;&#x540E;&#x6765;&#x53BB;&#x6FB3;&#x6D32;&#xFF0C;&#x5BA4;&#x53CB;&#x662F;&#x4E2A;&#x4E8B;&#x65E0;&#x5DE8;&#x7EC6;&#x90FD;&#x4F1A;&#x7167;&#x987E;&#x5468;&#x5168;&#x7684;&#x5F3A;&#x8FEB;&#x75C7;&#x59D1;&#x5A18;&#xFF0C;&#x6211;&#x51E0;&#x4E4E;&#x4E5F;&#x6CA1;&#x6709;&#x64CD;&#x8FC7;&#x4EC0;&#x4E48;&#x5FC3;&#x3002;&#x201C;&#x751F;&#x6D3B;&#x4ECE;&#x6765;&#x90FD;&#x662F;&#x4E0D;&#x5BB9;&#x6613;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x89C9;&#x5F97;&#x5BB9;&#x6613;&#xFF0C;&#x53EA;&#x662F;&#x6709;&#x4EBA;&#x66FF;&#x4F60;&#x627F;&#x62C5;&#x4E86;&#x800C;&#x5DF2;&#x3002;&#x201D;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4EE5;&#x524D;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x4ECE;&#x6765;&#x4E5F;&#x90FD;&#x662F;&#x72EC;&#x5F53;&#x4E00;&#x9762;&#x7684;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x6240;&#x4EE5;&#xFF0C;&#x5C1D;&#x8BD5;&#x5BA2;&#x6C14;&#x5730;&#x7ED9;&#x623F;&#x5C4B;&#x7BA1;&#x7406;&#x8FDE;&#x53D1;&#x90AE;&#x4EF6;&#xFF0C;&#x6709;&#x4E8B;&#x513F;&#x6CA1;&#x4E8B;&#x513F;&#x53BB;&#x697C;&#x4E0B;&#x529E;&#x516C;&#x5BA4;&#x770B;manager&#x5728;&#x4E0D;&#x5728;&#xFF0C;&#x53BB;&#x94F6;&#x884C;&#x89E3;&#x51B3;&#x8D26;&#x6237;&#x88AB;&#x51BB;&#x7ED3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4ECE;li&#x59D0;&#x59D0;&#x5BB6;&#x91CC;&#x62D6;&#x5E8A;&#x56DE;&#x5BB6;&#xFF0C;&#x627E;&#x4EBA;&#x5F00;&#x5C0F;&#x8D27;&#x8F66;&#x8FD0;&#x9001;&#x5BB6;&#x5177;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0;&#xA0;&#x65E2;&#x7136;&#x8981;&#x7ED3;&#x679C;&#xFF0C;&#x5C31;&#x8981;&#x597D;&#x597D;&#x5904;&#x7406;&#x95EE;&#x9898;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4ECA;&#x5929;&#xFF0C;manager&#x8FC5;&#x901F;&#x5E2E;&#x6211;&#x6362;&#x4E86;&#x574F;&#x6389;&#x7684;&#x95E8;&#x9501;&#xFF0C;&#x6211;&#x521A;&#x8BF4;&#x51B0;&#x7BB1;&#x574F;&#x4E86;&#x4E0B;&#x5348;&#x5C31;&#x7ED9;&#x6211;&#x6362;&#x4E86;&#x65B0;&#x7684;&#xFF0C;&#x8FD8;&#x5F00;&#x59CB;&#x548C;&#x6211;&#x5F00;&#x73A9;&#x7B11;&#xFF0C;&#x6211;&#x867D;&#x7136;&#x542C;&#x4E0D;&#x61C2;&#x4ED6;&#x8BF4;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x7B11;&#x8BDD;&#xFF0C;&#x4F46;&#x80FD;&#x611F;&#x89C9;&#x4ED6;&#x7684;&#x6001;&#x5EA6;&#x597D;&#x4E86;&#x5F88;&#x591A;&#x3002;&#x4EA4;&#x4E86;&#x5B66;&#x8D39;&#xFF0C;&#x4E5F;&#x627E;&#x5230;&#x4E86;&#x65B0;&#x5BA4;&#x53CB;&#xFF0C;&#x7EC8;&#x4E8E;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x6210;&#x578B;&#x7684;&#x7A9D;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x548C;&#x68A6;&#x7476;&#x8BF4;&#xFF0C;&#x4FE9;&#x4EBA;&#x4F4F;&#x4E5F;&#x633A;&#x597D;&#xFF0C;&#x8981;&#x4E0D;&#x662F;&#x623F;&#x79DF;&#x592A;&#x8D35;&#xFF0C;&#x771F;&#x60F3;&#x5C31;&#x8FD9;&#x4E48;&#x5F85;&#x7740;&#xFF0C;&#x6709;&#x4E2A;&#x91C7;&#x5149;&#x597D;&#x7684;&#x5927;&#x5BA2;&#x5385;&#x6211;&#x5C31;&#x662F;&#x57FA;&#x672C;&#x4E0D;&#x5728;&#x5BB6;&#x4E5F;&#x4F1A;&#x89C9;&#x5F97;&#x5F00;&#x5FC3;&#x7684;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0;&#x5979;&#x8BF4;&#xFF0C;&#x4F60;&#x60F3;&#x554A;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0;&#x7FFB;&#x767D;&#x773C;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0;&#x8FD9;&#x59D1;&#x5A18;&#x6765;&#x4E86;&#x4EE5;&#x540E;&#xFF0C;&#x4E5F;&#x6CA1;&#x5C11;&#x8D70;&#x8DEF;&#xFF0C;&#x53EF;&#x662F;&#x6709;&#x5979;&#x4E00;&#x8D77;&#xFF0C;&#x6211;&#x53CD;&#x5012;&#x6BD4;&#x4E4B;&#x524D;&#x597D;&#x8FC7;&#x4E86;&#x5F88;&#x591A;&#x3002;&#x597D;&#x50CF;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x7684;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0;&#x8FD9;&#x4E00;&#x5468;&#x6765;&#xFF0C;&#x5954;&#x6CE2;&#x6765;&#x53BB;&#x4E4B;&#x5916;&#x7684;&#x671F;&#x5F85;&#x7ADF;&#x662F;&#x5750;&#x4E0B;&#x597D;&#x597D;&#x505A;&#x9898;&#xFF0C;&#x597D;&#x597D;&#x8BFB;&#x4E66;&#xFF0C;&#x6CA1;&#x4EBA;&#x6253;&#x6270;&#x3002;&#x539F;&#x6765;&#x5B89;&#x9759;&#x4E5F;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x5962;&#x4F88;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#x60F3;&#x6765;&#xFF0C;&#x4E4B;&#x540E;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x8D1F;&#x62C5;&#x91CD;&#xFF0C;&#x538B;&#x529B;&#x5927;&#xFF0C;&#x6050;&#x6015;&#x5728;&#x6240;&#x96BE;&#x514D;&#x3002;&#x53EF;&#x662F;&#x554A;&#xFF0C;&#x65E2;&#x7136;&#x9009;&#x62E9;&#x6765;&#x5230;&#x4E86;&#x8FD9;&#x91CC;&#xFF0C;&#x4E5F;&#x8BB8;&#x5C31;&#x4E0D;&#x8BA1;&#x8F83;&#x8FD9;&#x4E9B;&#x4E86;&#x3002;</p>
<pre><code>&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &#x660E;&#x5929;&#x4E00;&#x5207;&#x597D;&#x8BF4;&#x3002;&#x665A;&#x5B89;&#x3002;
</code></pre>

                    
                        
                    
                    
                        <p>
                            <a href="/2016/08/27/e6-98-8e-e5-a4-a9-e4-b8-80-e5-88-87-e5-a5-bd-e8-af-b4/#post-footer" class="postShorten-excerpt_link link">
                                Comment and share
                            </a>
                        </p>
                    
                </div>
            
        </div>
        
    </article>
    
    
    <article class="postShorten postShorten--thumbnailimg-bottom" itemscope itemType="http://schema.org/BlogPosting">
        <div class="postShorten-wrap">
            
            <div class="postShorten-header">
                <h1 class="postShorten-title" itemprop="headline">
                    
                        <a class="link-unstyled" href="/2016/08/02/2016-08-02/">
                            2016-08-02
                        </a>
                    
                </h1>
                <div class="postShorten-meta">
    <time itemprop="datePublished" datetime="2016-08-02T23:27:22-04:00">
	
		    Aug 02, 2016
    	
    </time>
    
        <span>in </span>
        
    <a class="category-link" href="/categories/真实的生命/">真实的生命</a>


    
</div>

            </div>
            
                <div class="postShorten-content" itemprop="articleBody">
                    <script src="/assets/js/DPlayer.min.js"> </script><p>&#x4ECA;&#x5929;&#x5750;&#x5728;&#x7A97;&#x53F0;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x770B;&#x7740;&#x84DD;&#x5929;&#x767D;&#x4E91;&#x53D1;&#x4E86;&#x4F1A;&#x513F;&#x5446;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E09;&#x5929;&#x5C31;&#x8981;&#x79BB;&#x5F00;&#x4E0A;&#x6D77;&#x4E86;&#x3002;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x5199;&#x8FC7;&#x6587;&#x5B57;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x4F1A;&#x8BF4;&#xFF0C;&#x4E0A;&#x6D77;&#x554A;&#xFF0C;&#x6211;&#x771F;&#x559C;&#x6B22;&#x8FD9;&#x5EA7;&#x57CE;&#x3002;</p>
<p>&#x4E5F;&#x8BB8;&#x53BB;&#x8FC7;&#x5F88;&#x591A;&#x5730;&#x65B9;&#xFF0C;&#x4E5F;&#x8BB8;&#x5C06;&#x8981;&#x53BB;&#x5F88;&#x591A;&#x5730;&#x65B9;&#xFF0C;&#x4E5F;&#x8BB8;&#x770B;&#x8FC7;&#x5F88;&#x591A;&#x98CE;&#x666F;&#xFF0C;&#x4E5F;&#x8BB8;&#x5C06;&#x8981;&#x770B;&#x5F88;&#x591A;&#x98CE;&#x666F;&#xFF0C;&#x4F46;&#x6211;&#x4E0D;&#x4F1A;&#x5FD8;&#x8BB0;&#x5728;&#x6211;&#x8FD8;&#x5E74;&#x8F7B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0A;&#x6D77;&#x6240;&#x7ED9;&#x4E88;&#x6211;&#x7684;&#x4E00;&#x5207;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x662F;&#x8BA9;&#x6211;&#x5FC3;&#x5B89;&#x7684;&#x5730;&#x65B9;&#x3002;&#x5BF9;&#x4E00;&#x4E2A;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5730;&#x65B9;&#x4E0D;&#x4F1A;&#x5F88;&#x591A;&#x7684;&#x3002;</p>
<p>&#x60F3;&#x8D77;&#x5728;&#x6FB3;&#x6D32;&#x7684;&#x65F6;&#x5019;&#x603B;&#x4F1A;&#x770B;&#x661F;&#x7A7A;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x4F4F;&#x8FDB;&#x5927;&#x623F;&#x5B50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5750;&#x5728;&#x9633;&#x53F0;&#x4E0A;&#x770B;&#x4E86;&#x597D;&#x4E45;&#xFF0C;&#x4E5F;&#x4E0D;&#x8BF4;&#x8BDD;&#xFF0C;&#x4E5F;&#x4E0D;&#x60F3;&#x6709;&#x4EBA;&#x5728;&#x65C1;&#x8FB9;&#x3002;&#x5C31;&#x60F3;&#x8FD9;&#x4E48;&#x770B;&#x7740;&#xFF0C;&#x540E;&#x6765;&#x592A;&#x51B7;&#x4E86;&#x8FDB;&#x4E86;&#x5C4B;&#xFF0C;&#x5750;&#x5728;&#x5730;&#x6BEF;&#x4E0A;&#xFF0C;&#x8111;&#x5B50;&#x91CC;&#x8FD8;&#x662F;&#x661F;&#x7A7A;&#x3002;</p>
<p>&#x5BD2;&#x5047;&#x7684;&#x65F6;&#x5019;&#x88AB;&#x62C9;&#x53BB;Road Trip&#xFF0C;&#x4F4F;&#x8FDB;&#x4E00;&#x4E2A;&#x65C1;&#x8FB9;&#x4EC0;&#x4E48;&#x4E5F;&#x6CA1;&#x6709;&#x7684;&#x5C0F;&#x6728;&#x5C4B;&#xFF0C;&#x8EBA;&#x5728;&#x5E8A;&#x4E0A;&#x5C31;&#x80FD;&#x770B;&#x5230;&#x5929;&#x7A7A;&#x3002;&#x53EF;&#x662F;&#x6211;&#x4E00;&#x4E0A;&#x5E8A;&#x5C31;&#x7761;&#x7740;&#x4E86;&#xFF0C;&#x9192;&#x6765;&#x7684;&#x65F6;&#x5019;&#x51CC;&#x6668;&#x56DB;&#x70B9;&#xFF0C;&#x9519;&#x8FC7;&#x4E86;&#x4E09;&#x70B9;&#x4E8C;&#x5341;&#x7684;&#x53CC;&#x5B50;&#x5EA7;&#x6D41;&#x661F;&#x96E8;&#x3002;</p>
<p>&#x53EF;&#x90A3;&#x4E00;&#x523B;&#xFF0C;&#x4E00;&#x70B9;&#x4E5F;&#x4E0D;&#x89C9;&#x5F97;&#x53EF;&#x60DC;&#x3002;</p>
<p>&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5FC3;&#x91CC;&#x4E5F;&#x662F;&#x60F3;&#x7740;&#x8FD9;&#x56DB;&#x4E2A;&#x5B57;&#xFF0C;&#x6765;&#x65E5;&#x65B9;&#x957F;&#x3002;&#x661F;&#x7A7A;&#x4E00;&#x76F4;&#x5728;&#x554A;&#x3002;&#x4E0D;&#x7528;&#x6015;&#x3002;</p>
<p>&#x9AD8;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x987E;&#x8349;&#x8349;&#x7B2C;&#x4E00;&#x6B21;&#x5728;&#x672C;&#x5B50;&#x4E0A;&#x5199;&#x7ED9;&#x6211;&#x8FD9;&#x53E5;&#x8BDD;&#xFF0C;&#x6765;&#x65E5;&#x65B9;&#x957F;&#x3002;&#x7EC6;&#x7626;&#x7684;&#x5B57;&#x4F53;&#x7279;&#x522B;&#x597D;&#x770B;&#x3002;&#x4F46;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x5B57;&#x4F53;&#xFF0C;&#x5979;&#x548C;&#x6211;&#x51B7;&#x6218;&#x3001;&#x95F9;&#x77DB;&#x76FE;&#xFF0C;&#x4E00;&#x4E2A;&#x5B66;&#x671F;&#x6CA1;&#x6709;&#x8BB2;&#x8BDD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x662F;&#x7528;&#x8FD9;&#x79CD;&#x5B57;&#x4F53;&#x7ED9;&#x6211;&#x5199;&#x4E86;&#x5C0F;&#x7EB8;&#x6761;&#x6765;&#x548C;&#x597D;&#x3002;</p>
<p>&#x90A3;&#x65F6;&#x5019;&#x771F;&#x662F;&#x5E74;&#x8F7B;&#xFF0C;&#x73B0;&#x5728;&#x8C01;&#x8FD8;&#x6709;&#x7CBE;&#x529B;&#x7EA0;&#x7F20;&#x8FD9;&#x4E48;&#x4E45;&#x3002;</p>
<p>&#x53EF;&#x662F;&#x6765;&#x65E5;&#x65B9;&#x957F;&#xFF0C;&#x5230;&#x540E;&#x6765;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x6211;&#x548C;&#x6211;&#x6700;&#x597D;&#x7684;&#x670B;&#x53CB;&#x4E00;&#x5E74;&#x624D;&#x89C1;&#x4E00;&#x9762;&#xFF0C;&#x4E00;&#x9762;&#x624D;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x4E00;&#x676F;&#x5496;&#x5561;&#x6216;&#x8005;&#x4E00;&#x987F;&#x996D;&#x3002;&#x5728;&#x673A;&#x573A;&#x8FD9;&#x6837;&#x5306;&#x5FD9;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x542C;&#x4E0A;&#x53BB;&#x6765;&#x65E5;&#x65B9;&#x957F;&#x771F;&#x662F;&#x9EBB;&#x6728;&#x81EA;&#x5DF1;&#x7684;&#x8BF4;&#x8F9E;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x90A3;&#x5929;&#x6960;&#x6960;&#x548C;&#x6211;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x628A;&#x75DB;&#x82E6;&#x5F53;&#x78E8;&#x70BC;&#xFF0C;&#x628A;&#x5E73;&#x51E1;&#x5F53;&#x5E78;&#x798F;&#xFF0C;&#x5728;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x7ED9;&#x81EA;&#x5DF1;&#x627E;&#x5230;&#x501F;&#x53E3;&#xFF0C;&#x627E;&#x5230;&#x5FC3;&#x5B89;&#x7406;&#x5F97;&#x7EE7;&#x7EED;&#x6D3B;&#x4E0B;&#x53BB;&#x7684;&#x501F;&#x53E3;&#x3002;&#x6211;&#x60F3;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x65E0;&#x6CD5;&#x5206;&#x8FA8;&#x75DB;&#x82E6;&#x548C;&#x771F;&#x6B63;&#x7684;&#x6109;&#x60A6;&#xFF0C;&#x4E60;&#x60EF;&#x4E86;&#x987A;&#x5E94;&#x4E86;&#x75DB;&#x82E6;&#xFF0C;&#x53CD;&#x800C;&#x5FD8;&#x8BB0;&#x4E86;&#x5982;&#x4F55;&#x89C4;&#x907F;&#x75DB;&#x82E6;&#x3002;&#x4F46;&#x89C4;&#x907F;&#x75DB;&#x82E6;&#xFF0C;&#x5F88;&#x96BE;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#xFF0C;&#x4EBA;&#x7684;&#x60EF;&#x6027;&#x4F1A;&#x7528;&#x7ECF;&#x9A8C;&#x4EE3;&#x66FF;&#x611F;&#x77E5;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x8FD8;&#x662F;&#x522B;&#x4EBA;&#x7684;&#x3002;</p>
<p>&#x53EF;&#x6211;&#x8FD8;&#x662F;&#x8BA4;&#x4E3A;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x611F;&#x53D7;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x54EA;&#x6015;&#x627E;&#x4E0D;&#x5230;&#x8DEF;&#x3002;&#x54EA;&#x6015;&#x56DE;&#x4E0D;&#x5230;&#x539F;&#x70B9;&#x3002;&#x4E5F;&#x8981;&#x5FE0;&#x4E8E;&#x81EA;&#x6211;&#x3002;</p>
<p>&#x665A;&#x5B89;&#x3002;</p>

                    
                        
                    
                    
                        <p>
                            <a href="/2016/08/02/2016-08-02/#post-footer" class="postShorten-excerpt_link link">
                                Comment and share
                            </a>
                        </p>
                    
                </div>
            
        </div>
        
    </article>
    
    <div class="pagination-bar">
    <ul class="pagination">
        
        
        <li class="pagination-number">page 1 of 1</li>
    </ul>
</div>

</section>



                <footer id="footer" class="main-content-wrap">
    <span class="copyrights">
        Copyrights &copy; 2017 Star. All Rights Reserved.
    </span>
</footer>

            </div>
            
        </div>
        


<div id="about">
    <div id="about-card">
        <div id="about-btn-close">
            <i class="fa fa-remove"></i>
        </div>
        
            <h4 id="about-card-name">Star</h4>
        
            <div id="about-card-bio"><p>author.bio</p>
</div>
        
        
            <div id="about-card-job">
                <i class="fa fa-briefcase"></i>
                <br/>
                <p>author.job</p>

            </div>
        
        
    </div>
</div>

        <div id="algolia-search-modal" class="modal-container">
    <div class="modal">
        <div class="modal-header">
            <span class="close-button"><i class="fa fa-close"></i></span>
            <a href="https://algolia.com" target="_blank" class="searchby-algolia text-color-light link-unstyled">
                <span class="searchby-algolia-text text-color-light text-small">by</span>
                <img class="searchby-algolia-logo" src="https://www.algolia.com/static_assets/images/press/downloads/algolia-light.svg">
            </a>
            <i class="search-icon fa fa-search"></i>
            <form id="algolia-search-form">
                <input type="text" id="algolia-search-input" name="search"
                    class="form-control input--large search-input" placeholder="Search "
                    autofocus="autofocus"/>
            </form>
        </div>
        <div class="modal-body">
            <div class="no-result text-color-light text-center">no post found</div>
            <div class="results">
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/21/e5-bc-80-e7-af-87-ef-bc-9a-e6-89-93-e7-a2-8e-e6-b5-85-e8-96-84-e5-92-8c-e7-9f-ab-e6-83-85/">
                            <h3 class="media-heading">开篇：打碎浅薄和矫情</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 21, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/21/2016-07-21/">
                            <h3 class="media-heading">2016-07-21</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 21, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/26/how-to-use-markdown-as-a-starter/">
                            <h3 class="media-heading">How to use Markdown as a starter</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 26, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/27/e4-bd-bf-e7-94-a8emacs-e4-bb-8e-e6-97-a0-e6-b3-95-e5-85-a5-e9-97-a8-e5-88-b0-e6-94-be-e5-bc-83/">
                            <h3 class="media-heading">使用Emacs: 从无法入门到放弃</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 27, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/07/30/e6-b8-a9-e5-ba-a6/">
                            <h3 class="media-heading">温度</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Jul 30, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/08/02/2016-08-02/">
                            <h3 class="media-heading">2016-08-02</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Aug 2, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/08/27/e6-98-8e-e5-a4-a9-e4-b8-80-e5-88-87-e5-a5-bd-e8-af-b4/">
                            <h3 class="media-heading">明天一切好说</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Aug 27, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/09/19/python-remove-e8-af-af-e5-8c-ba/">
                            <h3 class="media-heading">python remove误区</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Sep 19, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/09/23/e5-90-ac-e6-9d-8e-e5-ae-97-e7-9b-9b/">
                            <h3 class="media-heading">听李宗盛</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Sep 23, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
                <div class="media">
                    
                    <div class="media-body">
                        <a class="link-unstyled" href="http://yoursite.com/2016/10/15/leetcode-172-easyfactorial-trailing-zeroes/">
                            <h3 class="media-heading">LeetCode 172.Factorial Trailing Zeroes</h3>
                        </a>
                        <span class="media-meta">
                            <span class="media-date text-small">
                                
                                    Oct 15, 2016
                                
                            </span>
                        </span>
                        <div class="media-content hide-xs font-merryweather"></div>
                    </div>
                    <div style="clear:both;"></div>
                    <hr>
                </div>
                
            </div>
        </div>
        <div class="modal-footer">
            <p class="results-count text-medium"
                data-message-zero="no post found"
                data-message-one="1 post found"
                data-message-other="{n} posts found">
                32 posts found
            </p>
        </div>
    </div>
</div>
        
<div id="cover" style="background-image:url('/assets/images/cover.jpg');"></div>
        <!--SCRIPTS-->
<script src="/assets/js/script-rt08quwts7iav5x0cfd2ym0gb5qkd1lvrsmwrakxtkhefmaaes4ywkmnjnwf.min.js"></script>
<!--SCRIPTS END--><!-- hexo-inject:begin --><!-- hexo-inject:end -->



    </body>
</html>
